#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_WP_PIS_GRIZZLY

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_WP_PIS_GRIZZLY_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_WP_PIS_GRIZZLY.ABP_WP_PIS_GRIZZLY_C
// 0x04D0 (0x0840 - 0x0370)
class UABP_WP_PIS_GRIZZLY_C final : public URoNWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_WP_PIS_GRIZZLY::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0390(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x03B0(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04D8(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x04F8(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x05E8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0630(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0658(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0680(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0700(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0748(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0790(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x07B0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x07F0(0x0040)()
	double                                        Mag01Alpha;                                        // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_DropSpeedReloadMagazine();
	void AnimNotify_ShowMag();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WP_PIS_GRIZZLY_AnimGraphNode_BlendListByBool_9154FB4246C35C480D42B7BC0F07C4F6();
	void ExecuteUbergraph_ABP_WP_PIS_GRIZZLY(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_WP_PIS_GRIZZLY_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_WP_PIS_GRIZZLY_C")
	}
	static class UABP_WP_PIS_GRIZZLY_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_WP_PIS_GRIZZLY_C>();
	}
};
DUMPER7_ASSERTS_UABP_WP_PIS_GRIZZLY_C;

}

