#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AdvanceToEnemyPosition

#include "Basic.hpp"


namespace SDK::Params
{

// Function AdvanceToEnemyPosition.AdvanceToEnemyPosition_C.RequestCombatMove_Blueprint
// 0x0004 (0x0004 - 0x0000)
struct AdvanceToEnemyPosition_C_RequestCombatMove_Blueprint final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AdvanceToEnemyPosition_C_RequestCombatMove_Blueprint;

// Function AdvanceToEnemyPosition.AdvanceToEnemyPosition_C.ExecuteUbergraph_AdvanceToEnemyPosition
// 0x0018 (0x0018 - 0x0000)
struct AdvanceToEnemyPosition_C_ExecuteUbergraph_AdvanceToEnemyPosition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACyberneticController*                  CallFunc_GetOwningController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AdvanceToEnemyPosition_C_ExecuteUbergraph_AdvanceToEnemyPosition;

}

