#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AG_TargetFacingMe

#include "Basic.hpp"

#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AG_TargetFacingMe.AG_TargetFacingMe_C
// 0x0010 (0x0038 - 0x0028)
class UAG_TargetFacingMe_C final : public UAIActionGate
{
public:
	int32                                         TargetType;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bAllowLastTracked;                                 // 0x002C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bRequiresLOS;                                      // 0x002D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Threshold;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	bool CanOpen(const struct FAIActionDecisionContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AG_TargetFacingMe_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AG_TargetFacingMe_C")
	}
	static class UAG_TargetFacingMe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAG_TargetFacingMe_C>();
	}
};
DUMPER7_ASSERTS_UAG_TargetFacingMe_C;

}

