#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_SurrenderExitMelee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIAction_SurrenderExitMelee.AIAction_SurrenderExitMelee_C
// 0x0028 (0x0080 - 0x0058)
class UAIAction_SurrenderExitMelee_C final : public UAIAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bChosenExitType;                                   // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESurrenderExitType                            SurrenderExitType;                                 // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FocalPoint;                                        // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick_Blueprint(float DeltaTime);
	void ExecuteUbergraph_AIAction_SurrenderExitMelee(int32 EntryPoint);
	void BeginAction_Blueprint();

	bool ShouldPerformAction() const;
	void IsFakeExit(ESurrenderExitType ExitType, bool* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AIAction_SurrenderExitMelee_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIAction_SurrenderExitMelee_C")
	}
	static class UAIAction_SurrenderExitMelee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIAction_SurrenderExitMelee_C>();
	}
};
DUMPER7_ASSERTS_UAIAction_SurrenderExitMelee_C;

}

