#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_ActiveShooter_TargetNextCivilian

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIAction_ActiveShooter_TargetNextCivilian.AIAction_ActiveShooter_TargetNextCivilian_C
// 0x0040 (0x0098 - 0x0058)
class UAIAction_ActiveShooter_TargetNextCivilian_C final : public UAIAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACyberneticCharacter*                   TargetingCivilian;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TimeUntilNextTarget;                               // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACyberneticCharacter*>           FailedCivilianPaths;                               // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        TimeUntilKill;                                     // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeUntilNextVO;                                   // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTargetCivActivity_C*                   TargetCivAction;                                   // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void TryScriptedFireAtCivilian();
	void Tick_Blueprint(float DeltaTime);
	void OnPathFound_Blueprint(int32 PathId, ERonNavigationQueryResult Result);
	void OnCreate_Blueprint(class ACyberneticController* Controller);
	void FindNextCivilian();
	void ExecuteUbergraph_AIAction_ActiveShooter_TargetNextCivilian(int32 EntryPoint);
	void EndAction_Blueprint();
	void BeginAction_Blueprint();

	bool ShouldPerformAction() const;
	void GetNextClosestAliveCivilian(class ACyberneticCharacter** civilian, bool* Return_Value) const;
	class FString GatherDebugInfo() const;
	void CanTargetCivilian(class ACyberneticCharacter* InCivilian, bool* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AIAction_ActiveShooter_TargetNextCivilian_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIAction_ActiveShooter_TargetNextCivilian_C")
	}
	static class UAIAction_ActiveShooter_TargetNextCivilian_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIAction_ActiveShooter_TargetNextCivilian_C>();
	}
};
DUMPER7_ASSERTS_UAIAction_ActiveShooter_TargetNextCivilian_C;

}

