#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_FireAtLastSeenPos

#include "Basic.hpp"


namespace SDK::Params
{

// Function AIAction_FireAtLastSeenPos.AIAction_FireAtLastSeenPos_C.ExecuteUbergraph_AIAction_FireAtLastSeenPos
// 0x0010 (0x0010 - 0x0000)
struct AIAction_FireAtLastSeenPos_C_ExecuteUbergraph_AIAction_FireAtLastSeenPos final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseCombatActivity*                    CallFunc_GetCombatActivity_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AIAction_FireAtLastSeenPos_C_ExecuteUbergraph_AIAction_FireAtLastSeenPos;

// Function AIAction_FireAtLastSeenPos.AIAction_FireAtLastSeenPos_C.ShouldPerformAction
// 0x0001 (0x0001 - 0x0000)
struct AIAction_FireAtLastSeenPos_C_ShouldPerformAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AIAction_FireAtLastSeenPos_C_ShouldPerformAction;

}

