#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_HesitateMove

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIAction_HesitateMove.AIAction_HesitateMove_C
// 0x0068 (0x00C0 - 0x0058)
class UAIAction_HesitateMove_C final : public UAIAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                HesitateMoveLocation;                              // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastSeenSwatLocation;                              // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseOtherVoiceLine;                                // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RequestMoveCooldown;                               // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeOfLastMoveCalc;                                // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartingRadius;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicRadius;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick_Blueprint(float DeltaTime);
	bool ShouldForcePerformAction();
	void PlayHesitationVO();
	void OnPathFound_Blueprint(int32 PathId, ERonNavigationQueryResult Result);
	void InitAction_Blueprint(class ACyberneticController* Controller);
	void GetHesitationVoiceOver(bool bUseAlternate, class FString* NewParam);
	void ExecuteUbergraph_AIAction_HesitateMove(int32 EntryPoint);
	void EndAction_Blueprint();
	void BeginAction_Blueprint();

	bool ShouldPerformAction() const;
	class FName GetMoveStyleOverride() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AIAction_HesitateMove_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIAction_HesitateMove_C")
	}
	static class UAIAction_HesitateMove_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIAction_HesitateMove_C>();
	}
};
DUMPER7_ASSERTS_UAIAction_HesitateMove_C;

}

