#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_Startle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIAction_Startle.AIAction_Startle_C
// 0x0050 (0x00A8 - 0x0058)
class UAIAction_Startle_C final : public UAIAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsRightStartle;                                   // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StartleAnimation;                                  // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                StimulusLocation;                                  // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTrackingTarget;                                   // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Cooldown;                                          // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCoolingDown;                                    // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEverShotBefore;                                   // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BeginAction_Blueprint();
	void CustomEvent_0();
	void EndAction_Blueprint();
	void ExecuteUbergraph_AIAction_Startle(int32 EntryPoint);
	void InitAction_Blueprint(class ACyberneticController* Controller);
	void ResetData();
	void Tick_Blueprint(float DeltaTime);

	void AngleToAnimation(double InAngle, bool bRight, class FString* Return_Value) const;
	void CanStartle(bool* Return_Value) const;
	void IsLocationRightOfUs(const struct FVector& InLocation, bool* Return_Value) const;
	bool ShouldPerformAction() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AIAction_Startle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIAction_Startle_C")
	}
	static class UAIAction_Startle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIAction_Startle_C>();
	}
};
DUMPER7_ASSERTS_UAIAction_Startle_C;

}

