#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_TakeHostage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIAction_TakeHostage.AIAction_TakeHostage_C
// 0x0038 (0x0090 - 0x0058)
class UAIAction_TakeHostage_C final : public UAIAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACyberneticCharacter*                   TargetCivilian;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTakeHostageActivity*                   TakeHostageActivity;                               // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TakeHostageTime;                                   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bPerformHostageTaking;                             // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SearchRange;                                       // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        LookatThreshold;                                   // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TraceForNearbyCivilians(TArray<class ACyberneticCharacter*>* Return_Value);
	void OnTakeHostageFinished(class UBaseActivity* Activity, class ACyberneticController* Controller);
	void OnCreate_Blueprint(class ACyberneticController* Controller);
	void ExecuteUbergraph_AIAction_TakeHostage(int32 EntryPoint);
	void EquipBestHostageTakingWeapon(bool* bFoundWeapon);
	void EndAction_Blueprint();
	void BeginAction_Blueprint();

	bool ShouldSwitchWeapons() const;
	bool ShouldPerformAction() const;
	void IsCivilianNotFacingTarget(class ACyberneticCharacter* civilian, class AReadyOrNotCharacter* Target, bool* Return_Value) const;
	void IsCivilianFacingTarget(class ACyberneticCharacter* civilian, class AReadyOrNotCharacter* Target, bool* Return_Value) const;
	void FindClosestCivilian(TArray<class ACyberneticCharacter*>& Civilians, class ACyberneticCharacter** Return_Value) const;
	void AnySWATNearCivilian(class ACyberneticCharacter* civilian, bool* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AIAction_TakeHostage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIAction_TakeHostage_C")
	}
	static class UAIAction_TakeHostage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIAction_TakeHostage_C>();
	}
};
DUMPER7_ASSERTS_UAIAction_TakeHostage_C;

}

