#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_HesitateStationary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIAction_HesitateStationary.AIAction_HesitateStationary_C
// 0x0048 (0x00A0 - 0x0058)
class UAIAction_HesitateStationary_C final : public UAIAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                HesitateMoveLocation;                              // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastSeenSwatLocation;                              // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseOtherVoiceLine;                                // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick_Blueprint(float DeltaTime);
	void PlayHesitationVO();
	void InitAction_Blueprint(class ACyberneticController* Controller);
	void GetHesitationVoiceOver(bool bUseAlternate, class FString* NewParam);
	void ExecuteUbergraph_AIAction_HesitateStationary(int32 EntryPoint);
	void EndAction_Blueprint();
	void BeginAction_Blueprint();

	bool ShouldPerformAction() const;
	class FName GetMoveStyleOverride() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AIAction_HesitateStationary_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIAction_HesitateStationary_C")
	}
	static class UAIAction_HesitateStationary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIAction_HesitateStationary_C>();
	}
};
DUMPER7_ASSERTS_UAIAction_HesitateStationary_C;

}

