#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_SeekPlayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function AIAction_SeekPlayer.AIAction_SeekPlayer_C.OnCreate_Blueprint
// 0x0008 (0x0008 - 0x0000)
struct AIAction_SeekPlayer_C_OnCreate_Blueprint final
{
public:
	class ACyberneticController*                  Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AIAction_SeekPlayer_C_OnCreate_Blueprint;

// Function AIAction_SeekPlayer.AIAction_SeekPlayer_C.ExecuteUbergraph_AIAction_SeekPlayer
// 0x0020 (0x0020 - 0x0000)
struct AIAction_SeekPlayer_C_ExecuteUbergraph_AIAction_SeekPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACyberneticController*                  K2Node_Event_Controller;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USeekPlayerCombatMove_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBaseCombatActivity*                    CallFunc_GetCombatActivity_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AIAction_SeekPlayer_C_ExecuteUbergraph_AIAction_SeekPlayer;

// Function AIAction_SeekPlayer.AIAction_SeekPlayer_C.ShouldPerformAction
// 0x0020 (0x0020 - 0x0000)
struct AIAction_SeekPlayer_C_ShouldPerformAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseCombatActivity*                    CallFunc_GetCombatActivity_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBaseCombatMoveActivity*                CallFunc_GetCombatMoveActivity_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AIAction_SeekPlayer_C_ShouldPerformAction;

}

