#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AimAssistSystem

#include "Basic.hpp"

#include "AimAssistSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AimAssistSystem.UASAimAssistComponent.GetDrawAimBox
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetDrawAimBox final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetDrawAimBox;

// Function AimAssistSystem.UASAimAssistComponent.GetDrawCircles
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetDrawCircles final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetDrawCircles;

// Function AimAssistSystem.UASAimAssistComponent.GetDrawCrosshair
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetDrawCrosshair final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetDrawCrosshair;

// Function AimAssistSystem.UASAimAssistComponent.GetDrawSockets
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetDrawSockets final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetDrawSockets;

// Function AimAssistSystem.UASAimAssistComponent.GetDrawWeights
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetDrawWeights final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetDrawWeights;

// Function AimAssistSystem.UASAimAssistComponent.GetEnableAutoAim
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetEnableAutoAim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetEnableAutoAim;

// Function AimAssistSystem.UASAimAssistComponent.GetEnableMagnetism
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetEnableMagnetism final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetEnableMagnetism;

// Function AimAssistSystem.UASAimAssistComponent.GetEnableSnapToTarget
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetEnableSnapToTarget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetEnableSnapToTarget;

// Function AimAssistSystem.UASAimAssistComponent.GetEnableStickiness
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetEnableStickiness final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetEnableStickiness;

// Function AimAssistSystem.UASAimAssistComponent.GetEnableZoneScaling
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetEnableZoneScaling final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetEnableZoneScaling;

// Function AimAssistSystem.UASAimAssistComponent.GetMouseActive
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_GetMouseActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetMouseActive;

// Function AimAssistSystem.UASAimAssistComponent.IsAnimationBlocking
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_IsAnimationBlocking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_IsAnimationBlocking;

// Function AimAssistSystem.UASAimAssistComponent.OnTargetDestroyed
// 0x0008 (0x0008 - 0x0000)
struct UASAimAssistComponent_OnTargetDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_OnTargetDestroyed;

// Function AimAssistSystem.UASAimAssistComponent.SetAimAssistDataAsset
// 0x0008 (0x0008 - 0x0000)
struct UASAimAssistComponent_SetAimAssistDataAsset final
{
public:
	class UUASAimAssistConfigDataAsset*           DataAsset;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetAimAssistDataAsset;

// Function AimAssistSystem.UASAimAssistComponent.SetDrawAimBox
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetDrawAimBox final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetDrawAimBox;

// Function AimAssistSystem.UASAimAssistComponent.SetDrawCircles
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetDrawCircles final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetDrawCircles;

// Function AimAssistSystem.UASAimAssistComponent.SetDrawCrosshair
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetDrawCrosshair final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetDrawCrosshair;

// Function AimAssistSystem.UASAimAssistComponent.SetDrawSockets
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetDrawSockets final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetDrawSockets;

// Function AimAssistSystem.UASAimAssistComponent.SetDrawWeights
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetDrawWeights final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetDrawWeights;

// Function AimAssistSystem.UASAimAssistComponent.SetEnableAutoAim
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetEnableAutoAim final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetEnableAutoAim;

// Function AimAssistSystem.UASAimAssistComponent.SetEnableMagnetism
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetEnableMagnetism final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetEnableMagnetism;

// Function AimAssistSystem.UASAimAssistComponent.SetEnableSnapToTarget
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetEnableSnapToTarget final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetEnableSnapToTarget;

// Function AimAssistSystem.UASAimAssistComponent.SetEnableStickiness
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetEnableStickiness final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetEnableStickiness;

// Function AimAssistSystem.UASAimAssistComponent.SetEnableZoneScaling
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetEnableZoneScaling final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetEnableZoneScaling;

// Function AimAssistSystem.UASAimAssistComponent.SetMouseActive
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistComponent_SetMouseActive final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetMouseActive;

// Function AimAssistSystem.UASAimAssistComponent.SetScopeSizeFactor
// 0x0004 (0x0004 - 0x0000)
struct UASAimAssistComponent_SetScopeSizeFactor final
{
public:
	float                                         SizeFactor;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetScopeSizeFactor;

// Function AimAssistSystem.UASAimAssistComponent.SetWeaponAimPoint
// 0x0010 (0x0010 - 0x0000)
struct UASAimAssistComponent_SetWeaponAimPoint final
{
public:
	struct FVector2D                              AimPoint;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetWeaponAimPoint;

// Function AimAssistSystem.UASAimAssistComponent.SetWeaponBulletSpawnLocation
// 0x0018 (0x0018 - 0x0000)
struct UASAimAssistComponent_SetWeaponBulletSpawnLocation final
{
public:
	struct FVector                                BulletSpawnLocation;                               // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_SetWeaponBulletSpawnLocation;

// Function AimAssistSystem.UASAimAssistComponent.CalculateSocketDistance
// 0x0014 (0x0014 - 0x0000)
struct UASAimAssistComponent_CalculateSocketDistance final
{
public:
	struct FUASAimAssistTargetData                TargetData;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_CalculateSocketDistance;

// Function AimAssistSystem.UASAimAssistComponent.CalculateSocketWeight
// 0x0014 (0x0014 - 0x0000)
struct UASAimAssistComponent_CalculateSocketWeight final
{
public:
	struct FUASAimAssistTargetData                TargetData;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_CalculateSocketWeight;

// Function AimAssistSystem.UASAimAssistComponent.GetControlMultipliers
// 0x0008 (0x0008 - 0x0000)
struct UASAimAssistComponent_GetControlMultipliers final
{
public:
	float                                         Pitch;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetControlMultipliers;

// Function AimAssistSystem.UASAimAssistComponent.GetCrosshairPosition
// 0x0010 (0x0010 - 0x0000)
struct UASAimAssistComponent_GetCrosshairPosition final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetCrosshairPosition;

// Function AimAssistSystem.UASAimAssistComponent.GetRotationToCrosshairDirection
// 0x0040 (0x0040 - 0x0000)
struct UASAimAssistComponent_GetRotationToCrosshairDirection final
{
public:
	struct FVector                                From;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TraceProfileName;                                  // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDistanceToRotateToTarget;                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistComponent_GetRotationToCrosshairDirection;

// Function AimAssistSystem.UASAimAssistComponent.ShouldSocketBeConsidered
// 0x0014 (0x0014 - 0x0000)
struct UASAimAssistComponent_ShouldSocketBeConsidered final
{
public:
	struct FUASAimAssistTargetData                TargetData;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UASAimAssistComponent_ShouldSocketBeConsidered;

// Function AimAssistSystem.UASAimAssistTargetComponent.GetMoveSpeed
// 0x0004 (0x0004 - 0x0000)
struct UASAimAssistTargetComponent_GetMoveSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistTargetComponent_GetMoveSpeed;

// Function AimAssistSystem.UASAimAssistTargetComponent.GetWeightByState
// 0x0004 (0x0004 - 0x0000)
struct UASAimAssistTargetComponent_GetWeightByState final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistTargetComponent_GetWeightByState;

// Function AimAssistSystem.UASAimAssistTargetComponent.GetWeightLabel
// 0x0010 (0x0010 - 0x0000)
struct UASAimAssistTargetComponent_GetWeightLabel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistTargetComponent_GetWeightLabel;

// Function AimAssistSystem.UASAimAssistTargetComponent.Init
// 0x0008 (0x0008 - 0x0000)
struct UASAimAssistTargetComponent_Init final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistTargetComponent_Init;

// Function AimAssistSystem.UASAimAssistTargetComponent.ShouldAlwaysBlockTrace
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistTargetComponent_ShouldAlwaysBlockTrace final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistTargetComponent_ShouldAlwaysBlockTrace;

// Function AimAssistSystem.UASAimAssistTargetComponent.ShouldConsiderWeight
// 0x0001 (0x0001 - 0x0000)
struct UASAimAssistTargetComponent_ShouldConsiderWeight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UASAimAssistTargetComponent_ShouldConsiderWeight;

}

