#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIMBP_SuperShorty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ANIMBP_SuperShorty.ANIMBP_SuperShorty_C
// 0x00D0 (0x0440 - 0x0370)
class UANIMBP_SuperShorty_C final : public URoNWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03F0(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_FinishShellLoad();
	void AnimNotify_PrimeShellRack();
	void ExecuteUbergraph_ANIMBP_SuperShorty(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ANIMBP_SuperShorty_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ANIMBP_SuperShorty_C")
	}
	static class UANIMBP_SuperShorty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANIMBP_SuperShorty_C>();
	}
};
DUMPER7_ASSERTS_UANIMBP_SuperShorty_C;

}

