#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIMBP_Benelli_M4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ANIMBP_Benelli_M4_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ANIMBP_Benelli_M4.ANIMBP_Benelli_M4_C
// 0x03B0 (0x0720 - 0x0370)
class UANIMBP_Benelli_M4_C final : public URoNWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ANIMBP_Benelli_M4::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;            // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0390(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x03D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0420(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0468(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x04B0(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0530(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0550(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0570(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0660(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x06A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x06D0(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x06F8(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_FinishShellLoad();
	void AnimNotify_PrimeShellRack();
	void AnimNotify_ReloadNextShell();
	void AnimNotify_ReplaceShellRack();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ANIMBP_Benelli_M4_AnimGraphNode_BlendListByBool_24FABA7F44C81B59863D0FABC6873878();
	void ExecuteUbergraph_ANIMBP_Benelli_M4(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ANIMBP_Benelli_M4_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ANIMBP_Benelli_M4_C")
	}
	static class UANIMBP_Benelli_M4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANIMBP_Benelli_M4_C>();
	}
};
DUMPER7_ASSERTS_UANIMBP_Benelli_M4_C;

}

