#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIMBP_CharacterTriggable_Head

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ANIMBP_CharacterTriggable_Head_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ANIMBP_CharacterTriggable_Head.ANIMBP_CharacterTriggable_Head_C
// 0x0850 (0x0C40 - 0x03F0)
class UANIMBP_CharacterTriggable_Head_C final : public UStaticCharacterFaceAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ANIMBP_CharacterTriggable_Head::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x03F8(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0408(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0410(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0418(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0438(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0480(0x0158)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x05D8(0x00F0)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_2;                       // 0x06C8(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x07E8(0x0120)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0908(0x0040)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x0948(0x0120)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0x0A68(0x00D0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0B38(0x00F0)()
	class UAnimSequence*                          FaceSequenceRef;                                   // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Bodyref;                                           // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        LipSyncScale;                                      // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ANIMBP_CharacterTriggable_Head_AnimGraphNode_SequenceEvaluator_DA068789415B0767D317ED9D5D08724E();
	void ExecuteUbergraph_ANIMBP_CharacterTriggable_Head(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ANIMBP_CharacterTriggable_Head_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ANIMBP_CharacterTriggable_Head_C")
	}
	static class UANIMBP_CharacterTriggable_Head_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANIMBP_CharacterTriggable_Head_C>();
	}
};
DUMPER7_ASSERTS_UANIMBP_CharacterTriggable_Head_C;

}

