#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIMBP_C2_Charge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ANIMBP_C2_Charge.ANIMBP_C2_Charge_C
// 0x00D0 (0x0670 - 0x05A0)
class UANIMBP_C2_Charge_C final : public UReadyOrNotAnimInstance
{
public:
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05B8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x05D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0620(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ANIMBP_C2_Charge(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ANIMBP_C2_Charge_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ANIMBP_C2_Charge_C")
	}
	static class UANIMBP_C2_Charge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANIMBP_C2_Charge_C>();
	}
};
DUMPER7_ASSERTS_UANIMBP_C2_Charge_C;

}

