#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AppleProResMedia

#include "Basic.hpp"

#include "AppleProResMedia_structs.hpp"
#include "MovieSceneCapture_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieRenderPipelineCore_classes.hpp"


namespace SDK
{

// Class AppleProResMedia.AppleProResEncoderProtocol
// 0x0088 (0x00F0 - 0x0068)
class UAppleProResEncoderProtocol final : public UFrameGrabberProtocol
{
public:
	EAppleProResEncoderFormats                    EncodingFormat;                                    // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppleProResEncoderColorDescription           ColorDescription;                                  // 0x0069(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppleProResEncoderScanType                   ScanType;                                          // 0x006A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfEncodingThreads;                           // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEmbedTimecodeTrack;                               // 0x0070(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDropFrameTimecode;                                // 0x0071(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x7E];                                      // 0x0072(0x007E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppleProResEncoderProtocol")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppleProResEncoderProtocol")
	}
	static class UAppleProResEncoderProtocol* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppleProResEncoderProtocol>();
	}
};
DUMPER7_ASSERTS_UAppleProResEncoderProtocol;

// Class AppleProResMedia.AppleProResMediaSettings
// 0x0008 (0x0030 - 0x0028)
class UAppleProResMediaSettings final : public UObject
{
public:
	int32                                         NumberOfCPUDecodingThreads;                        // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppleProResMediaSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppleProResMediaSettings")
	}
	static class UAppleProResMediaSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppleProResMediaSettings>();
	}
};
DUMPER7_ASSERTS_UAppleProResMediaSettings;

// Class AppleProResMedia.MoviePipelineAppleProResOutput
// 0x0008 (0x0098 - 0x0090)
class UMoviePipelineAppleProResOutput final : public UMoviePipelineVideoOutputBase
{
public:
	EAppleProResEncoderCodec                      Codec;                                             // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDropFrameTimecode;                                // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideMaximumEncodingThreads;                   // 0x0092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxNumberOfEncodingThreads;                        // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoviePipelineAppleProResOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoviePipelineAppleProResOutput")
	}
	static class UMoviePipelineAppleProResOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineAppleProResOutput>();
	}
};
DUMPER7_ASSERTS_UMoviePipelineAppleProResOutput;

}

