#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AttachedFlashbangTrap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AttachedFlashbangTrap.BP_AttachedFlashbangTrap_C
// 0x0040 (0x0440 - 0x0400)
class ABP_AttachedFlashbangTrap_C final : public ATrapActorAttachedToDoor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_ActivateEffect;                                 // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ExplodeEffect;                                  // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        TrapActivateTime;                                  // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class AActor*>                         DamagedActorsMap;                                  // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AReadyOrNotCharacter*                   Triggered_By;                                      // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AttachedFlashbangTrap(int32 EntryPoint);
	void Explode_Trap();
	void OnTrapTriggered(class AReadyOrNotCharacter* TriggeredBy);
	void ReceivePointDamage(float Damage, const class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
	void ReceiveRadialDamage(float DamageReceived, const class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void Server_ApplyDamage(class AReadyOrNotCharacter* InTriggeredBy);

	void CanApplyDamage(const class UDamageType* InDamageType, bool* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AttachedFlashbangTrap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AttachedFlashbangTrap_C")
	}
	static class ABP_AttachedFlashbangTrap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AttachedFlashbangTrap_C>();
	}
};
DUMPER7_ASSERTS_ABP_AttachedFlashbangTrap_C;

}

