#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BreakableGlass_v01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BreakableGlass_v01.BP_BreakableGlass_v01_C
// 0x0070 (0x0330 - 0x02C0)
class ABP_BreakableGlass_v01_C final : public ABreakableGlass
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               GlassBreakParticleSystem;                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Glass;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Glass_Material;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        Target;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            New_Mesh;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Glass_Break_Particle_Scale;                        // 0x02F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             FMOD_Event;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMODParam>                      Params_0;                                          // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DrawDistance;                                      // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void StaticGlassHit(const struct FVector& HitLocation);
	void PlayQSMSound(const struct FTransform& Transform, class UFMODEvent* FMOD_Event_To_Play);
	void FirstHitPositionObject(int32 FirstPositionBox, int32 TextureY, int32 TextureX, const struct FVector& HitPosition, const struct FVector& ObjectiveDirection, float DamageRadius, bool bFirstHitCanBreakIt, float CharacterVelocityToBreak);
	void ExecuteUbergraph_BP_BreakableGlass_v01(int32 EntryPoint);
	void DestructibleHit(const struct FVector& Location);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BreakableGlass_v01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BreakableGlass_v01_C")
	}
	static class ABP_BreakableGlass_v01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BreakableGlass_v01_C>();
	}
};
DUMPER7_ASSERTS_ABP_BreakableGlass_v01_C;

}

