#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_Triggable_Training

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.ExecuteUbergraph_BP_Character_Triggable_Training
// 0x0360 (0x0360 - 0x0000)
struct BP_Character_Triggable_Training_C_ExecuteUbergraph_BP_Character_Triggable_Training final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_28;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_27;                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_26;                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_25;                  // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_24;                  // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_23;                  // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_22;                  // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_21;                  // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_20;                  // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0194(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x01AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x01BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x01F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0204(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x020C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0234(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x023C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_22;           // 0x0254(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0264(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x026C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_23;           // 0x0274(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x028C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_24;           // 0x0294(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_25;           // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x02B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x02BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_26;           // 0x02C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_27;           // 0x02D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x02E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x02EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x02F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F7[0x1];                                      // 0x02F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_28;           // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_29;                  // 0x032C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_4; // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_5; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x2];                                      // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_29;           // 0x034C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_ExecuteUbergraph_BP_Character_Triggable_Training;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnBlendOut_0657EFA145AC28071520558D7C1C3611
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnBlendOut_0657EFA145AC28071520558D7C1C3611 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnBlendOut_0657EFA145AC28071520558D7C1C3611;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnBlendOut_7E30D9F143E1D5253537D7B96E5EC137
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnBlendOut_7E30D9F143E1D5253537D7B96E5EC137 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnBlendOut_7E30D9F143E1D5253537D7B96E5EC137;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnBlendOut_8155E1144F6C19642E83BC9F21BCBB00
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnBlendOut_8155E1144F6C19642E83BC9F21BCBB00 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnBlendOut_8155E1144F6C19642E83BC9F21BCBB00;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnBlendOut_A34D60F14137F93D913FE6981F7041C8
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnBlendOut_A34D60F14137F93D913FE6981F7041C8 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnBlendOut_A34D60F14137F93D913FE6981F7041C8;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnBlendOut_D6370F284F4BA98B759735B70496968F
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnBlendOut_D6370F284F4BA98B759735B70496968F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnBlendOut_D6370F284F4BA98B759735B70496968F;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnBlendOut_E2033A574C7E4A167E7F9A98A38CB831
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnBlendOut_E2033A574C7E4A167E7F9A98A38CB831 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnBlendOut_E2033A574C7E4A167E7F9A98A38CB831;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnCompleted_0657EFA145AC28071520558D7C1C3611
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnCompleted_0657EFA145AC28071520558D7C1C3611 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnCompleted_0657EFA145AC28071520558D7C1C3611;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnCompleted_7E30D9F143E1D5253537D7B96E5EC137
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnCompleted_7E30D9F143E1D5253537D7B96E5EC137 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnCompleted_7E30D9F143E1D5253537D7B96E5EC137;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnCompleted_8155E1144F6C19642E83BC9F21BCBB00
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnCompleted_8155E1144F6C19642E83BC9F21BCBB00 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnCompleted_8155E1144F6C19642E83BC9F21BCBB00;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnCompleted_A34D60F14137F93D913FE6981F7041C8
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnCompleted_A34D60F14137F93D913FE6981F7041C8 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnCompleted_A34D60F14137F93D913FE6981F7041C8;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnCompleted_D6370F284F4BA98B759735B70496968F
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnCompleted_D6370F284F4BA98B759735B70496968F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnCompleted_D6370F284F4BA98B759735B70496968F;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnCompleted_E2033A574C7E4A167E7F9A98A38CB831
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnCompleted_E2033A574C7E4A167E7F9A98A38CB831 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnCompleted_E2033A574C7E4A167E7F9A98A38CB831;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnInterrupted_0657EFA145AC28071520558D7C1C3611
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnInterrupted_0657EFA145AC28071520558D7C1C3611 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnInterrupted_0657EFA145AC28071520558D7C1C3611;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnInterrupted_7E30D9F143E1D5253537D7B96E5EC137
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnInterrupted_7E30D9F143E1D5253537D7B96E5EC137 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnInterrupted_7E30D9F143E1D5253537D7B96E5EC137;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnInterrupted_8155E1144F6C19642E83BC9F21BCBB00
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnInterrupted_8155E1144F6C19642E83BC9F21BCBB00 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnInterrupted_8155E1144F6C19642E83BC9F21BCBB00;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnInterrupted_A34D60F14137F93D913FE6981F7041C8
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnInterrupted_A34D60F14137F93D913FE6981F7041C8 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnInterrupted_A34D60F14137F93D913FE6981F7041C8;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnInterrupted_D6370F284F4BA98B759735B70496968F
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnInterrupted_D6370F284F4BA98B759735B70496968F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnInterrupted_D6370F284F4BA98B759735B70496968F;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnInterrupted_E2033A574C7E4A167E7F9A98A38CB831
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnInterrupted_E2033A574C7E4A167E7F9A98A38CB831 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnInterrupted_E2033A574C7E4A167E7F9A98A38CB831;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyBegin_0657EFA145AC28071520558D7C1C3611
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyBegin_0657EFA145AC28071520558D7C1C3611 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyBegin_0657EFA145AC28071520558D7C1C3611;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyBegin_7E30D9F143E1D5253537D7B96E5EC137
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyBegin_7E30D9F143E1D5253537D7B96E5EC137 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyBegin_7E30D9F143E1D5253537D7B96E5EC137;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyBegin_8155E1144F6C19642E83BC9F21BCBB00
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyBegin_8155E1144F6C19642E83BC9F21BCBB00 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyBegin_8155E1144F6C19642E83BC9F21BCBB00;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyBegin_A34D60F14137F93D913FE6981F7041C8
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyBegin_A34D60F14137F93D913FE6981F7041C8 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyBegin_A34D60F14137F93D913FE6981F7041C8;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyBegin_D6370F284F4BA98B759735B70496968F
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyBegin_D6370F284F4BA98B759735B70496968F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyBegin_D6370F284F4BA98B759735B70496968F;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyBegin_E2033A574C7E4A167E7F9A98A38CB831
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyBegin_E2033A574C7E4A167E7F9A98A38CB831 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyBegin_E2033A574C7E4A167E7F9A98A38CB831;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyEnd_0657EFA145AC28071520558D7C1C3611
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyEnd_0657EFA145AC28071520558D7C1C3611 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyEnd_0657EFA145AC28071520558D7C1C3611;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyEnd_7E30D9F143E1D5253537D7B96E5EC137
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyEnd_7E30D9F143E1D5253537D7B96E5EC137 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyEnd_7E30D9F143E1D5253537D7B96E5EC137;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyEnd_8155E1144F6C19642E83BC9F21BCBB00
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyEnd_8155E1144F6C19642E83BC9F21BCBB00 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyEnd_8155E1144F6C19642E83BC9F21BCBB00;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyEnd_A34D60F14137F93D913FE6981F7041C8
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyEnd_A34D60F14137F93D913FE6981F7041C8 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyEnd_A34D60F14137F93D913FE6981F7041C8;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyEnd_D6370F284F4BA98B759735B70496968F
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyEnd_D6370F284F4BA98B759735B70496968F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyEnd_D6370F284F4BA98B759735B70496968F;

// Function BP_Character_Triggable_Training.BP_Character_Triggable_Training_C.OnNotifyEnd_E2033A574C7E4A167E7F9A98A38CB831
// 0x0008 (0x0008 - 0x0000)
struct BP_Character_Triggable_Training_C_OnNotifyEnd_E2033A574C7E4A167E7F9A98A38CB831 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Character_Triggable_Training_C_OnNotifyEnd_E2033A574C7E4A167E7F9A98A38CB831;

}

