#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Destructible_RandomBottle

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Destructible_RandomBottle.BP_Destructible_RandomBottle_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Destructible_RandomBottle_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Destructible_RandomBottle_C_UserConstructionScript;

// Function BP_Destructible_RandomBottle.BP_Destructible_RandomBottle_C.ExecuteUbergraph_BP_Destructible_RandomBottle
// 0x0004 (0x0004 - 0x0000)
struct BP_Destructible_RandomBottle_C_ExecuteUbergraph_BP_Destructible_RandomBottle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Destructible_RandomBottle_C_ExecuteUbergraph_BP_Destructible_RandomBottle;

}

