#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameInstance

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "SGraphicPreset_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameInstance.BP_GameInstance_C
// 0x0088 (0x0F98 - 0x0F10)
class UBP_GameInstance_C final : public UReadyOrNotGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FString>                         StreamedLevels;                                    // 0x0F18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 ModeURL;                                           // 0x0F28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSGraphicPreset                        SteamDeckPreset;                                   // 0x0F38(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSGraphicPreset>                GraphicsPresets;                                   // 0x0F88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddPauseGameCondition(const class FString& PauseCondition);
	void AdjustAccessibilitySettings();
	void AdjustVolume();
	void ApplyAudioPreset();
	void ApplyDeckPreset();
	void ApplyPreset(int32 PresetIndex);
	void Compare_Graphics_Preset(const struct FSGraphicPreset& A, const struct FSGraphicPreset& B, bool* bIsEqual);
	void ExecuteUbergraph_BP_GameInstance(int32 EntryPoint);
	bool IsCustomPreset();
	void OnSettingsSaved();
	void PauseGameWithConditon(const class FString& NewCondition);
	void ReceiveInit();
	void RemovePauseGameCondition(const class FString& PauseCondition);
	void SetGraphicsOption(const struct FSGraphicPreset& SGraphicPreset);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GameInstance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GameInstance_C")
	}
	static class UBP_GameInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GameInstance_C>();
	}
};
DUMPER7_ASSERTS_UBP_GameInstance_C;

}

