#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoSyncPhysic

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NoSyncPhysic.BP_NoSyncPhysic_C.ExecuteUbergraph_BP_NoSyncPhysic
// 0x0018 (0x0018 - 0x0000)
struct BP_NoSyncPhysic_C_ExecuteUbergraph_BP_NoSyncPhysic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_SleepingComponent;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_BoneName;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoSyncPhysic_C_ExecuteUbergraph_BP_NoSyncPhysic;

// Function BP_NoSyncPhysic.BP_NoSyncPhysic_C.BndEvt__BP_NoSyncPhysical_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentSleepSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_NoSyncPhysic_C_BndEvt__BP_NoSyncPhysical_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentSleepSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoSyncPhysic_C_BndEvt__BP_NoSyncPhysical_StaticMesh_K2Node_ComponentBoundEvent_2_ComponentSleepSignature__DelegateSignature;

}

