#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SteelTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SteelTarget.BP_SteelTarget_C
// 0x0048 (0x0300 - 0x02B8)
class ABP_SteelTarget_C final : public ABaseTriggerable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_SteelTarget;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpenClose_Time_03C237724F0B121EBDB4F39F9FDDFF32;   // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenClose__Direction_03C237724F0B121EBDB4F39F9FDDFF32; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenClose;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        PlayRate;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             RotateSound;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             HitSound;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMODParam>                      Params_0;                                          // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ReceiveBeginPlay();
	void Play_SFX_Hit();
	void OpenClose__UpdateFunc();
	void OpenClose__FinishedFunc();
	void ExecuteUbergraph_BP_SteelTarget(int32 EntryPoint);
	void BndEvt__BP_RotatingTarget_SM_HQ_Target_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SteelTarget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SteelTarget_C")
	}
	static class ABP_SteelTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SteelTarget_C>();
	}
};
DUMPER7_ASSERTS_ABP_SteelTarget_C;

}

