#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SteamGas

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SteamGas.BP_SteamGas_C.CanPing
// 0x0001 (0x0001 - 0x0000)
struct BP_SteamGas_C_CanPing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_CanPing;

// Function BP_SteamGas.BP_SteamGas_C.CanShowActionSlot1
// 0x0010 (0x0010 - 0x0000)
struct BP_SteamGas_C_CanShowActionSlot1 final
{
public:
	class AReadyOrNotCharacter*                   PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_CanShowActionSlot1;

// Function BP_SteamGas.BP_SteamGas_C.DoubleTapInteract
// 0x0010 (0x0010 - 0x0000)
struct BP_SteamGas_C_DoubleTapInteract final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_DoubleTapInteract;

// Function BP_SteamGas.BP_SteamGas_C.ExecuteUbergraph_BP_SteamGas
// 0x0050 (0x0050 - 0x0000)
struct BP_SteamGas_C_ExecuteUbergraph_BP_SteamGas final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_Instigator;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_3;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_3;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_2;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_2;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_1;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_1;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_ExecuteUbergraph_BP_SteamGas;

// Function BP_SteamGas.BP_SteamGas_C.Interact
// 0x0010 (0x0010 - 0x0000)
struct BP_SteamGas_C_Interact final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_Interact;

// Function BP_SteamGas.BP_SteamGas_C.OnFocusGain
// 0x0010 (0x0010 - 0x0000)
struct BP_SteamGas_C_OnFocusGain final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_OnFocusGain;

// Function BP_SteamGas.BP_SteamGas_C.OnFocusLost
// 0x0010 (0x0010 - 0x0000)
struct BP_SteamGas_C_OnFocusLost final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_OnFocusLost;

// Function BP_SteamGas.BP_SteamGas_C.Secure
// 0x0008 (0x0008 - 0x0000)
struct BP_SteamGas_C_Secure final
{
public:
	class AReadyOrNotCharacter*                   Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_Secure;

// Function BP_SteamGas.BP_SteamGas_C.CanBeSecured
// 0x0001 (0x0001 - 0x0000)
struct BP_SteamGas_C_CanBeSecured final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_CanBeSecured;

// Function BP_SteamGas.BP_SteamGas_C.CanBeSecuredByTrailers
// 0x0001 (0x0001 - 0x0000)
struct BP_SteamGas_C_CanBeSecuredByTrailers final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_CanBeSecuredByTrailers;

// Function BP_SteamGas.BP_SteamGas_C.CanInteract
// 0x0001 (0x0001 - 0x0000)
struct BP_SteamGas_C_CanInteract final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_CanInteract;

// Function BP_SteamGas.BP_SteamGas_C.CanInteractThroughHitActors
// 0x00F0 (0x00F0 - 0x0000)
struct BP_SteamGas_C_CanInteractThroughHitActors final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_CanInteractThroughHitActors;

// Function BP_SteamGas.BP_SteamGas_C.CanIssueCommand
// 0x0001 (0x0001 - 0x0000)
struct BP_SteamGas_C_CanIssueCommand final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_CanIssueCommand;

// Function BP_SteamGas.BP_SteamGas_C.GetGasRadius
// 0x0004 (0x0004 - 0x0000)
struct BP_SteamGas_C_GetGasRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_GetGasRadius;

// Function BP_SteamGas.BP_SteamGas_C.GetInteractableComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_SteamGas_C_GetInteractableComponent final
{
public:
	class UInteractableComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_GetInteractableComponent;

// Function BP_SteamGas.BP_SteamGas_C.GetScoringComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_SteamGas_C_GetScoringComponent final
{
public:
	class UScoringComponent*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SteamGas_C_GetScoringComponent;

}

