#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShootingRange_0

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ShootingRange.BP_ShootingRange_C.Server_Interact
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRange_C_Server_Interact final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator1;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InteractableComponent1;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_Server_Interact;

// Function BP_ShootingRange.BP_ShootingRange_C.OnFocusLost
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRange_C_OnFocusLost final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_OnFocusLost;

// Function BP_ShootingRange.BP_ShootingRange_C.OnFocusGain
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRange_C_OnFocusGain final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_OnFocusGain;

// Function BP_ShootingRange.BP_ShootingRange_C.MeleeInteract
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRange_C_MeleeInteract final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_MeleeInteract;

// Function BP_ShootingRange.BP_ShootingRange_C.Interact
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRange_C_Interact final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_Interact;

// Function BP_ShootingRange.BP_ShootingRange_C.Fire
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRange_C_Fire final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_Fire;

// Function BP_ShootingRange.BP_ShootingRange_C.ExecuteUbergraph_BP_ShootingRange
// 0x0910 (0x0910 - 0x0000)
struct BP_ShootingRange_C_ExecuteUbergraph_BP_ShootingRange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x01D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x02C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_7;                 // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_7;            // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_6;                 // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_6;            // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_5;                 // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_5;            // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_4;                 // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_4;            // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_3;                 // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_3;            // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_2;                 // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_2;            // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator_1;                 // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent_1;            // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_InteractInstigator;                   // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_InInteractableComponent;              // 0x0420(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABaseItem*                              CallFunc_GetEquippedItem_ReturnValue;              // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsButtonPushAnimationPlaying_ReturnValue; // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0433(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_435[0xB];                                      // 0x0435(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0440(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEventAtLocation_ReturnValue;          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CB[0x5];                                      // 0x04CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x04E8(0x0018)()
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0500(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_5;                              // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x05F0(0x0018)()
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_4;  // 0x0608(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_5;  // 0x06F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_6;  // 0x07D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x08C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x08D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x08E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x08F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_ExecuteUbergraph_BP_ShootingRange;

// Function BP_ShootingRange.BP_ShootingRange_C.EndInteract
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRange_C_EndInteract final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_EndInteract;

// Function BP_ShootingRange.BP_ShootingRange_C.EndFire
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRange_C_EndFire final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_EndFire;

// Function BP_ShootingRange.BP_ShootingRange_C.DoubleTapInteract
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRange_C_DoubleTapInteract final
{
public:
	class AReadyOrNotCharacter*                   InteractInstigator;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InInteractableComponent;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_DoubleTapInteract;

// Function BP_ShootingRange.BP_ShootingRange_C.GetInteractableComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_ShootingRange_C_GetInteractableComponent final
{
public:
	class UInteractableComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_GetInteractableComponent;

// Function BP_ShootingRange.BP_ShootingRange_C.DetermineInteractionDistance
// 0x0004 (0x0004 - 0x0000)
struct BP_ShootingRange_C_DetermineInteractionDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_DetermineInteractionDistance;

// Function BP_ShootingRange.BP_ShootingRange_C.DetermineInputEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_ShootingRange_C_DetermineInputEvent final
{
public:
	EInputEvent                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_DetermineInputEvent;

// Function BP_ShootingRange.BP_ShootingRange_C.DetermineCurrentProgress
// 0x0004 (0x0004 - 0x0000)
struct BP_ShootingRange_C_DetermineCurrentProgress final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_DetermineCurrentProgress;

// Function BP_ShootingRange.BP_ShootingRange_C.DetermineAnimatedIcon
// 0x0008 (0x0008 - 0x0000)
struct BP_ShootingRange_C_DetermineAnimatedIcon final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_DetermineAnimatedIcon;

// Function BP_ShootingRange.BP_ShootingRange_C.DetermineActionText
// 0x0018 (0x0018 - 0x0000)
struct BP_ShootingRange_C_DetermineActionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_DetermineActionText;

// Function BP_ShootingRange.BP_ShootingRange_C.CanInteractThroughHitActors
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ShootingRange_C_CanInteractThroughHitActors final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_CanInteractThroughHitActors;

// Function BP_ShootingRange.BP_ShootingRange_C.CanInteract
// 0x0001 (0x0001 - 0x0000)
struct BP_ShootingRange_C_CanInteract final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShootingRange_C_CanInteract;

}

