#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TableTennisMachine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_TableTennisMachine_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_UserConstructionScript;

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.ExecuteUbergraph_BP_TableTennisMachine
// 0x0110 (0x0110 - 0x0000)
struct BP_TableTennisMachine_C_ExecuteUbergraph_BP_TableTennisMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEventAtLocation_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEventAtLocation_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEventAtLocation_ReturnValue_2;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetParameter_Value_ImplicitCast;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_ExecuteUbergraph_BP_TableTennisMachine;

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.GetInteractableComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_TableTennisMachine_C_GetInteractableComponent final
{
public:
	class UInteractableComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_GetInteractableComponent;

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.DetermineInteractionDistance
// 0x0004 (0x0004 - 0x0000)
struct BP_TableTennisMachine_C_DetermineInteractionDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_DetermineInteractionDistance;

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.DetermineInputEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_TableTennisMachine_C_DetermineInputEvent final
{
public:
	EInputEvent                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_DetermineInputEvent;

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.DetermineCurrentProgress
// 0x0004 (0x0004 - 0x0000)
struct BP_TableTennisMachine_C_DetermineCurrentProgress final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_DetermineCurrentProgress;

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.DetermineAnimatedIcon
// 0x0008 (0x0008 - 0x0000)
struct BP_TableTennisMachine_C_DetermineAnimatedIcon final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_DetermineAnimatedIcon;

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.DetermineActionText
// 0x0018 (0x0018 - 0x0000)
struct BP_TableTennisMachine_C_DetermineActionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_DetermineActionText;

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.CanInteractThroughHitActors
// 0x00F0 (0x00F0 - 0x0000)
struct BP_TableTennisMachine_C_CanInteractThroughHitActors final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_CanInteractThroughHitActors;

// Function BP_TableTennisMachine.BP_TableTennisMachine_C.CanInteract
// 0x0001 (0x0001 - 0x0000)
struct BP_TableTennisMachine_C_CanInteract final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TableTennisMachine_C_CanInteract;

}

