#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Target_Gong

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Target_Gong.BP_Target_Gong_C
// 0x0030 (0x02D0 - 0x02A0)
class ABP_Target_Gong_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SK_Target_Gong;                                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             HitSound;                                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMODParam>                      Params_0;                                          // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Play_SFX_Hit();
	void OnNotifyEnd_DEF696A54FC96AA19B92D1A602F44858(class FName NotifyName);
	void OnNotifyBegin_DEF696A54FC96AA19B92D1A602F44858(class FName NotifyName);
	void OnInterrupted_DEF696A54FC96AA19B92D1A602F44858(class FName NotifyName);
	void OnCompleted_DEF696A54FC96AA19B92D1A602F44858(class FName NotifyName);
	void OnBlendOut_DEF696A54FC96AA19B92D1A602F44858(class FName NotifyName);
	void ExecuteUbergraph_BP_Target_Gong(int32 EntryPoint);
	void BndEvt__BP_Target_Gong_SK_Target_Gong_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Target_Gong_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Target_Gong_C")
	}
	static class ABP_Target_Gong_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Target_Gong_C>();
	}
};
DUMPER7_ASSERTS_ABP_Target_Gong_C;

}

