#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TowerSilentAlarmTrap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TowerSilentAlarmTrap.BP_TowerSilentAlarmTrap_C
// 0x0050 (0x0460 - 0x0410)
class ABP_TowerSilentAlarmTrap_C final : public ATrapActorAttachedToDoor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane3;                                            // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane2;                                            // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Tower_Laser_Trap3;                              // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Tower_Laser_Trap2;                              // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane1;                                            // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Tower_Laser_Trap1;                              // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IR_LaserPointer_P1;                                // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Tower_Laser_Trap;                               // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_TowerSilentAlarmTrap_SM_Tower_Laser_Trap_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_TowerSilentAlarmTrap(int32 EntryPoint);
	void OnTrapDisarmed(class AReadyOrNotCharacter* DisarmedBy);
	void OnTrapTriggered(class AReadyOrNotCharacter* TriggeredBy);
	void triggered();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TowerSilentAlarmTrap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TowerSilentAlarmTrap_C")
	}
	static class ABP_TowerSilentAlarmTrap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TowerSilentAlarmTrap_C>();
	}
};
DUMPER7_ASSERTS_ABP_TowerSilentAlarmTrap_C;

}

