#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: commonButton

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass commonButton.CommonButton_C
// 0x0040 (0x15F0 - 0x15B0)
class UCommonButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonButton;                                      // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x15C0(0x0018)(Edit, BlueprintVisible)
	int32                                         CharacterLimit;                                    // 0x15D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15DC[0x4];                                     // 0x15DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TruncatedCharacters;                               // 0x15E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CommonButton(int32 EntryPoint);
	void OnCurrentTextStyleChanged();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonButton_C")
	}
	static class UCommonButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonButton_C>();
	}
};
DUMPER7_ASSERTS_UCommonButton_C;

}

