#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomAnimNode

#include "Basic.hpp"

#include "CustomAnimNode_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK::Params
{

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.ComputeMatchedPlayRateFromDuration
// 0x0018 (0x0018 - 0x0000)
struct AnimSuiteNodeHelperLibrary_ComputeMatchedPlayRateFromDuration final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_ComputeMatchedPlayRateFromDuration;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.ConvertToMatchedBlendSpacePlayer
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_ConvertToMatchedBlendSpacePlayer final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpaceMatcherReference            ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_ConvertToMatchedBlendSpacePlayer;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.ConvertToMatchedBlendSpacePlayerPure
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_ConvertToMatchedBlendSpacePlayerPure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FBlendSpaceMatcherReference            BlendSpaceMatchedPlayer;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_ConvertToMatchedBlendSpacePlayerPure;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.ConvertToMatchedSequencePlayer
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_ConvertToMatchedSequencePlayer final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequenceMatcherReference              ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_ConvertToMatchedSequencePlayer;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.ConvertToMatchedSequencePlayerPure
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_ConvertToMatchedSequencePlayerPure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bResult;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_ConvertToMatchedSequencePlayerPure;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.GetMatchedAccumulatedTime
// 0x0018 (0x0018 - 0x0000)
struct AnimSuiteNodeHelperLibrary_GetMatchedAccumulatedTime final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_GetMatchedAccumulatedTime;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.GetMatchedScaledAccumulatedTime
// 0x0018 (0x0018 - 0x0000)
struct AnimSuiteNodeHelperLibrary_GetMatchedScaledAccumulatedTime final
{
public:
	struct FBlendSpaceMatcherReference            BlendSpaceMatchedPlayer;                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_GetMatchedScaledAccumulatedTime;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.GetMatchedSequencePure
// 0x0018 (0x0018 - 0x0000)
struct AnimSuiteNodeHelperLibrary_GetMatchedSequencePure final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_GetMatchedSequencePure;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.GetMatchingLoopAnimation
// 0x0018 (0x0018 - 0x0000)
struct AnimSuiteNodeHelperLibrary_GetMatchingLoopAnimation final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_GetMatchingLoopAnimation;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.GetMatchingPlayRate
// 0x0018 (0x0018 - 0x0000)
struct AnimSuiteNodeHelperLibrary_GetMatchingPlayRate final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_GetMatchingPlayRate;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.GetMatchingStartPosition
// 0x0018 (0x0018 - 0x0000)
struct AnimSuiteNodeHelperLibrary_GetMatchingStartPosition final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_GetMatchingStartPosition;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.GetScaledAccumulatedTime
// 0x0018 (0x0018 - 0x0000)
struct AnimSuiteNodeHelperLibrary_GetScaledAccumulatedTime final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_GetScaledAccumulatedTime;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetExplicitTimeByPoseMatching
// 0x0048 (0x0048 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetExplicitTimeByPoseMatching final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSequencePlayerReference               SequencePlayer;                                    // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SampleRate;                                        // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldMatchVelocity;                              // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldInertiallyBlend;                            // 0x0025(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InertialBlendTime;                                 // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReturnValues            ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetExplicitTimeByPoseMatching;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetMatchedAccumulatedTime
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetMatchedAccumulatedTime final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequenceMatcherReference              ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetMatchedAccumulatedTime;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetMatchedBlendSpace
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetMatchedBlendSpace final
{
public:
	struct FBlendSpaceMatcherReference            BlendSpaceMatchedPlayer;                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UBlendSpace*                            BlendSpace;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlendSpaceMatcherReference            ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetMatchedBlendSpace;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetMatchedBlendSpaceWithInertialBlending
// 0x0040 (0x0040 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetMatchedBlendSpaceWithInertialBlending final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlendSpaceMatcherReference            BlendSpaceMatchedPlayer;                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UBlendSpace*                            BlendSpace;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpaceMatcherReference            ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetMatchedBlendSpaceWithInertialBlending;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetMatchedPlayRate
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetMatchedPlayRate final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequenceMatcherReference              ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetMatchedPlayRate;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetMatchedSequence
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetMatchedSequence final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Sequence;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSequenceMatcherReference              ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetMatchedSequence;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetMatchedStartPosition
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetMatchedStartPosition final
{
public:
	struct FSequenceMatcherReference              SequencePlayer;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         StartPosition;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequenceMatcherReference              ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetMatchedStartPosition;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetNormalizedTime
// 0x0028 (0x0028 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetNormalizedTime final
{
public:
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         NormalizedTime;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpacePlayerReference             ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetNormalizedTime;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetNormalizedTimeByDistanceMatching
// 0x0060 (0x0060 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetNormalizedTimeByDistanceMatching final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MatchingDistance;                                  // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PrevNormalizedTime;                                // 0x0024(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PlayRateClamp;                                     // 0x0028(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DistanceCurveName;                                 // 0x0038(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdvanceTimeNaturally;                             // 0x0040(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOnlyHighestWeightedSample;                     // 0x0041(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpacePlayerReturnValues          ReturnValue;                                       // 0x0048(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetNormalizedTimeByDistanceMatching;

// Function CustomAnimNode.AnimSuiteNodeHelperLibrary.SetNormalizedTimeByPoseMatching
// 0x0048 (0x0048 - 0x0000)
struct AnimSuiteNodeHelperLibrary_SetNormalizedTimeByPoseMatching final
{
public:
	struct FAnimUpdateContext                     UpdateContext;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlendSpacePlayerReference             BlendSpacePlayer;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SampleRate;                                        // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldMatchVelocity;                              // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOnlyHighestWeightedSample;                     // 0x0025(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldInertiallyBlend;                            // 0x0026(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InertialBlendTime;                                 // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpacePlayerReturnValues          ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimSuiteNodeHelperLibrary_SetNormalizedTimeByPoseMatching;

}

