#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Device_SuperShorty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Device_SuperShorty.Device_SuperShorty_C
// 0x0030 (0x1950 - 0x1920)
class ADevice_SuperShorty_C final : public AShotgun
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1920(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UShellRackShellComponent*               Shell4;                                            // 0x1928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell3;                                            // 0x1930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell2;                                            // 0x1938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell1;                                            // 0x1940(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell0;                                            // 0x1948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void DoReloadComplete_1();
	void ExecuteUbergraph_Device_SuperShorty(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Device_SuperShorty_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Device_SuperShorty_C")
	}
	static class ADevice_SuperShorty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADevice_SuperShorty_C>();
	}
};
DUMPER7_ASSERTS_ADevice_SuperShorty_C;

}

