#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Faction_USVeterans

#include "Basic.hpp"


namespace SDK::Params
{

// Function Faction_USVeterans.Faction_USVeterans_C.OnAIAdded_Blueprint
// 0x0008 (0x0008 - 0x0000)
struct Faction_USVeterans_C_OnAIAdded_Blueprint final
{
public:
	class ACyberneticCharacter*                   Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Faction_USVeterans_C_OnAIAdded_Blueprint;

// Function Faction_USVeterans.Faction_USVeterans_C.ExecuteUbergraph_Faction_USVeterans
// 0x0028 (0x0028 - 0x0000)
struct Faction_USVeterans_C_ExecuteUbergraph_Faction_USVeterans final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACyberneticCharacter*                   K2Node_Event_Character;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_1;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASuspectCharacter*                      K2Node_Event_Suspect;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_Event_Enemy;                                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Faction_USVeterans_C_ExecuteUbergraph_Faction_USVeterans;

// Function Faction_USVeterans.Faction_USVeterans_C.AlertOtherSuspectsInTeam_Blueprint
// 0x0010 (0x0010 - 0x0000)
struct Faction_USVeterans_C_AlertOtherSuspectsInTeam_Blueprint final
{
public:
	class ASuspectCharacter*                      suspect;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   Enemy;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Faction_USVeterans_C_AlertOtherSuspectsInTeam_Blueprint;

}

