#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Farm_Candle_Stationary_Flicker

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Farm_Candle_Stationary_Flicker.Farm_Candle_Stationary_Flicker_C
// 0x0028 (0x02C8 - 0x02A0)
class AFarm_Candle_Stationary_Flicker_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Candle_Flame1;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Candle_Flame;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candle_one;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Farm_Candle_Stationary_Flicker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Farm_Candle_Stationary_Flicker_C")
	}
	static class AFarm_Candle_Stationary_Flicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFarm_Candle_Stationary_Flicker_C>();
	}
};
DUMPER7_ASSERTS_AFarm_Candle_Stationary_Flicker_C;

}

