#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBasicIconSettings

#include "Basic.hpp"

#include "EIconAnimationStyles_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FBasicIconSettings.FBasicIconSettings
// 0x0028 (0x0028 - 0x0000)
struct FFBasicIconSettings final
{
public:
	EIconAnimationStyles                          AnimationStyle_2_C5857E2F4AC7D5363326C8B5363D9ADD; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HighlightColor_7_FCF133C849CA59F3A456E984F1122433; // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnhighlightColor_9_20CEE6F940EC3C0A462D609528F7D138; // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ColorTransitionSpeed_12_2636B2604C9B6A366DD018A588954C28; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFBasicIconSettings;

}

