#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FleeGas_CombatMove

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function FleeGas_CombatMove.FleeGas_CombatMove_C.StartActivity_Blueprint
// 0x0008 (0x0008 - 0x0000)
struct FleeGas_CombatMove_C_StartActivity_Blueprint final
{
public:
	class AAIController*                          Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FleeGas_CombatMove_C_StartActivity_Blueprint;

// Function FleeGas_CombatMove.FleeGas_CombatMove_C.OnAIPerceptionSense
// 0x0068 (0x0068 - 0x0000)
struct FleeGas_CombatMove_C_OnAIPerceptionSense final
{
public:
	class ACyberneticController*                  InSenseController;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            Stimulus;                                          // 0x0008(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class AActor*                                 OutOverrideSensedActor;                            // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FleeGas_CombatMove_C_OnAIPerceptionSense;

// Function FleeGas_CombatMove.FleeGas_CombatMove_C.ExecuteUbergraph_FleeGas_CombatMove
// 0x0018 (0x0018 - 0x0000)
struct FleeGas_CombatMove_C_ExecuteUbergraph_FleeGas_CombatMove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_Owner;                                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FleeGas_CombatMove_C_ExecuteUbergraph_FleeGas_CombatMove;

// Function FleeGas_CombatMove.FleeGas_CombatMove_C.GetMoveStyleOverride
// 0x0020 (0x0020 - 0x0000)
struct FleeGas_CombatMove_C_GetMoveStyleOverride final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FleeGas_CombatMove_C_GetMoveStyleOverride;

}

