#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMODStudioNiagara

#include "Basic.hpp"

#include "Niagara_classes.hpp"


namespace SDK
{

// Class FMODStudioNiagara.FMODNiagaraEventPlayer
// 0x0028 (0x0060 - 0x0038)
class UFMODNiagaraEventPlayer final : public UNiagaraDataInterface
{
public:
	class UFMODEvent*                             EventToPlay;                                       // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ParameterNames;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NoClear, NativeAccessSpecifierPublic)
	bool                                          bLimitPlaysPerTick;                                // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPlaysPerTick;                                   // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenComponentIsDestroyed;                     // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FMODNiagaraEventPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FMODNiagaraEventPlayer")
	}
	static class UFMODNiagaraEventPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODNiagaraEventPlayer>();
	}
};
DUMPER7_ASSERTS_UFMODNiagaraEventPlayer;

}

