#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalConversationTrigger_Master_Struct

#include "Basic.hpp"

#include "GlobalConversationTrigger_Struct_structs.hpp"


namespace SDK
{

// UserDefinedStruct GlobalConversationTrigger_Master_Struct.GlobalConversationTrigger_Master_Struct
// 0x0030 (0x0030 - 0x0000)
struct FGlobalConversationTrigger_Master_Struct final
{
public:
	class FString                                 ConversationTitle_2_BC74710B4523FD7F42676885482DC275; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FGlobalConversationTrigger_Struct> Conversation_7_B6EA515B4113F43C3F2A2BB0042083B3; // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          ConversationOnlyPlaysOnce_9_BA06C0C64D6264C23B8EED81196ECFAB; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConversationPlaysInSingleplayerOnly_17_27EC46A7469CE0D314BD79BFFAED1774; // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ConversationChance_14_ADC4FCEC47004F65AC37CC9D3E30A6A8; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FGlobalConversationTrigger_Master_Struct;

}

