#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalConversationTrigger_Struct

#include "Basic.hpp"

#include "GlobalConversationTrigger_CharacterType_structs.hpp"
#include "GlobalConversationTrigger_SubtitleSpeakerTag_Enum_structs.hpp"


namespace SDK
{

// UserDefinedStruct GlobalConversationTrigger_Struct.GlobalConversationTrigger_Struct
// 0x00A0 (0x00A0 - 0x0000)
struct FGlobalConversationTrigger_Struct final
{
public:
	EGlobalConversationTrigger_CharacterType      CharacterType_9_8276CE4242A4AB7304656F9B403FC82F;  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotCharacter*                   ReferencetoSpeakingCharacterCharacterselected_22_30D709AF470684AFBB054997E1456E35; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  SoftReferencetoSpeakerLocationStaticselected_51_D6168EE14A3D5E28C1A66EB89CF968D5; // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   TagReferencetoSpeaker_61_533B4513436037709D7446B485895A77; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 SpeakingcharacterCharacterdialoguefoldername_49_4C0221C84219105CA0CAAEB473F098A6; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Specificbarkname_40_2E5DD8714EBC6A5F67B3CF8DC26337DB; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         Randombarkname_48_4CA56A3F404B35AB7B6DAD962CB38E23; // 0x0060(0x0010)(Edit, BlueprintVisible)
	EGlobalConversationTrigger_SubtitleSpeakerTag_Enum SubtitleSpeakerTag_27_249D0DAC4629493369300B8FE1EA605D; // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SubtitleSpeakerName_68_4178ACEF4FAD9B84D5D667AC0E4607EE; // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        SubtitleLength_67_E9EFFDCB4015A3E91B138790B6DEA1AC; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Delaytonextline_33_A8935AA44FEE92A35325E89384EA0D44; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DialogueChance_57_C5FD8A684E51CAE6EC692EB7788559DA; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FGlobalConversationTrigger_Struct;

}

