#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM_FreeMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GM_FreeMode.GM_FreeMode_C
// 0x0320 (0x0CF0 - 0x09D0)
class AGM_FreeMode_C final : public AFreeMode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSavedLoadout                          Loadout;                                           // 0x09E0(0x02E8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasGivenGear_;                                     // 0x0CC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC9[0x7];                                      // 0x0CC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadoutEquipOptions                   Loadout_Equip_Options;                             // 0x0CD0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_GM_FreeMode(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GM_FreeMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GM_FreeMode_C")
	}
	static class AGM_FreeMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGM_FreeMode_C>();
	}
};
DUMPER7_ASSERTS_AGM_FreeMode_C;

}

