#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Grenade_Roadflare

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Grenade_Roadflare.Grenade_Roadflare_C
// 0x0040 (0x12B0 - 0x1270)
class AGrenade_Roadflare_C final : public ABaseGrenade
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   FlareLight;                                        // 0x1278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        TimeoutPeriod;                                     // 0x1280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFadingOut_;                                       // 0x1288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1289[0x7];                                     // 0x1289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IntensityTarget;                                   // 0x1290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LenFlare_RoadFlare_C*               Lens_Flare;                                        // 0x1298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BrightnessDefault;                                 // 0x12A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DetonateBind(class ABaseGrenade* Grenade);
	void ExecuteUbergraph_Grenade_Roadflare(int32 EntryPoint);
	void GrenadeTimedOut();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Grenade_Roadflare_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Grenade_Roadflare_C")
	}
	static class AGrenade_Roadflare_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGrenade_Roadflare_C>();
	}
};
DUMPER7_ASSERTS_AGrenade_Roadflare_C;

}

