#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Helmet_Glasses

#include "Basic.hpp"


namespace SDK::Params
{

// Function Helmet_Glasses.Helmet_Glasses_C.ExecuteUbergraph_Helmet_Glasses
// 0x0018 (0x0018 - 0x0000)
struct Helmet_Glasses_C_ExecuteUbergraph_Helmet_Glasses final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Helmet_Glasses_C_ExecuteUbergraph_Helmet_Glasses;

// Function Helmet_Glasses.Helmet_Glasses_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Helmet_Glasses_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Helmet_Glasses_C_ReceiveTick;

}

