#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputRemapping

#include "Basic.hpp"

#include "InputRemapping_structs.hpp"


namespace SDK::Params
{

// Function InputRemapping.InputRemappingNodes.ActionMappingEqualActionMapping
// 0x0058 (0x0058 - 0x0000)
struct InputRemappingNodes_ActionMappingEqualActionMapping final
{
public:
	struct FActionMappingStruct                   A;                                                 // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FActionMappingStruct                   B;                                                 // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_ActionMappingEqualActionMapping;

// Function InputRemapping.InputRemappingNodes.ActionMappingNotEqualActionMapping
// 0x0058 (0x0058 - 0x0000)
struct InputRemappingNodes_ActionMappingNotEqualActionMapping final
{
public:
	struct FActionMappingStruct                   A;                                                 // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FActionMappingStruct                   B;                                                 // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_ActionMappingNotEqualActionMapping;

// Function InputRemapping.InputRemappingNodes.AxisMappingEqualActionMapping
// 0x0058 (0x0058 - 0x0000)
struct InputRemappingNodes_AxisMappingEqualActionMapping final
{
public:
	struct FAxisMappingStruct                     A;                                                 // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAxisMappingStruct                     B;                                                 // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_AxisMappingEqualActionMapping;

// Function InputRemapping.InputRemappingNodes.AxisMappingNotEqualActionMapping
// 0x0058 (0x0058 - 0x0000)
struct InputRemappingNodes_AxisMappingNotEqualActionMapping final
{
public:
	struct FAxisMappingStruct                     A;                                                 // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAxisMappingStruct                     B;                                                 // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_AxisMappingNotEqualActionMapping;

// Function InputRemapping.InputRemappingNodes.CreateNewActionMapping
// 0x0030 (0x0030 - 0x0000)
struct InputRemappingNodes_CreateNewActionMapping final
{
public:
	struct FActionMappingStruct                   MappingData;                                       // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_CreateNewActionMapping;

// Function InputRemapping.InputRemappingNodes.CreateNewAxisMapping
// 0x0030 (0x0030 - 0x0000)
struct InputRemappingNodes_CreateNewAxisMapping final
{
public:
	struct FAxisMappingStruct                     MappingData;                                       // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_CreateNewAxisMapping;

// Function InputRemapping.InputRemappingNodes.GetAllActionMappings
// 0x0050 (0x0050 - 0x0000)
struct InputRemappingNodes_GetAllActionMappings final
{
public:
	struct FActionMappingStruct                   FilterData;                                        // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	TArray<EActionMappingFilter>                  Filters;                                           // 0x0028(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActionMappingStruct>           ActionMappings;                                    // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputRemappingNodes_GetAllActionMappings;

// Function InputRemapping.InputRemappingNodes.GetAllAxisMappings
// 0x0050 (0x0050 - 0x0000)
struct InputRemappingNodes_GetAllAxisMappings final
{
public:
	struct FAxisMappingStruct                     FilterData;                                        // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	TArray<EAxisMappingFilter>                    Filters;                                           // 0x0028(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAxisMappingStruct>             AxisMappings;                                      // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputRemappingNodes_GetAllAxisMappings;

// Function InputRemapping.InputRemappingNodes.RebindActionMapping
// 0x0058 (0x0058 - 0x0000)
struct InputRemappingNodes_RebindActionMapping final
{
public:
	struct FActionMappingStruct                   ActionMapping;                                     // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	struct FActionMappingStruct                   NewData;                                           // 0x0028(0x0028)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_RebindActionMapping;

// Function InputRemapping.InputRemappingNodes.RebindAxisMapping
// 0x0058 (0x0058 - 0x0000)
struct InputRemappingNodes_RebindAxisMapping final
{
public:
	struct FAxisMappingStruct                     AxisMapping;                                       // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	struct FAxisMappingStruct                     NewData;                                           // 0x0028(0x0028)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_RebindAxisMapping;

// Function InputRemapping.InputRemappingNodes.RemoveActionMapping
// 0x0030 (0x0030 - 0x0000)
struct InputRemappingNodes_RemoveActionMapping final
{
public:
	struct FActionMappingStruct                   MappingData;                                       // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_RemoveActionMapping;

// Function InputRemapping.InputRemappingNodes.RemoveAxisMapping
// 0x0030 (0x0030 - 0x0000)
struct InputRemappingNodes_RemoveAxisMapping final
{
public:
	struct FAxisMappingStruct                     MappingData;                                       // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputRemappingNodes_RemoveAxisMapping;

}

