#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveLinkAnimationCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LiveLinkInterface_structs.hpp"


namespace SDK
{

// ScriptStruct LiveLinkAnimationCore.AnimNode_LiveLinkPose
// 0x0038 (0x0048 - 0x0010)
struct FAnimNode_LiveLinkPose final : public FAnimNode_Base
{
public:
	struct FPoseLink                              InputPose;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FLiveLinkSubjectName                   LiveLinkSubjectName;                               // 0x0020(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULiveLinkRetargetAsset>     RetargetAsset;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULiveLinkRetargetAsset*                 CurrentRetargetAsset;                              // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_LiveLinkPose;

// ScriptStruct LiveLinkAnimationCore.LiveLinkInstanceProxy
// 0x0040 (0x0740 - 0x0700)
struct FLiveLinkInstanceProxy final : public FAnimInstanceProxy
{
public:
	struct FAnimNode_LiveLinkPose                 PoseNode;                                          // 0x06F8(0x0048)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLiveLinkInstanceProxy;

}

