#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutCategory

#include "Basic.hpp"

#include "ReadyOrNot_structs.hpp"
#include "LoadoutScrollBehaviour_structs.hpp"


namespace SDK
{

// UserDefinedStruct LoadoutCategory.LoadoutCategory
// 0x0068 (0x0068 - 0x0000)
struct LoadoutCategory::FLoadoutCategory final
{
public:
	bool                                          Enabled__56_57929C134BE3AF4A5C9507892D5652E6;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LoadoutCategoryName_2_297159FC4C987F7742FCA1808ADFABED; // 0x0008(0x0018)(Edit, BlueprintVisible)
	EItemType                                     ItemType_60_27803F284309426AAC88FA87F43507C9;      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemClass                                    LoadoutClass_5_63C8556E4413D0C7117B57A99EF9D0C9;   // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutScrollBehaviour                       ScrollBehaviour_17_A27C1597429B3D6590C8AA8A6286C7C9; // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CameraTag_26_DEC1E94D47A76905551A97ABCEFCF820;     // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviewAnimation_25_863F4D0541CC198B8FAF4580D5A79C50; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsTactical__54_A54B1F11475811C01916A0989533AE6E;   // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TacticalSlot_10_DF87D74B48F4114F7B5E55A15E7D92A4;  // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMultipleTacticalSlots__57_BADB792147BFFAA77B2387867167C625; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartingTacticalSlot_53_ECD80FCD42BC7033BE63B2BB2865D366; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Tooltip_20_D7AE8D294E32DC8F3E6C92AF4A164C87;       // 0x0050(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_LoadoutCategory__FLoadoutCategory;

}

