#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchStartInformationWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchStartInformationWidget.MatchStartInformationWidget_C
// 0x0038 (0x0300 - 0x02C8)
class UMatchStartInformationWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutEverything;                                 // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInEverything;                                  // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_277;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RoundCount;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_45;                                      // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_359;                                     // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FText GetText_1();
	class FText GetText_0();
	struct FLinearColor GetColorAndOpacity_0();
	ESlateVisibility Get_RoundCount_Visibility_0();
	class FText Get_RoundCount_Text_0();
	void FadeOut();
	void ExecuteUbergraph_MatchStartInformationWidget(int32 EntryPoint);
	void CustomEvent_0();
	void Construct();
	void TryDisplayMatchStart();
	void OnGameStarted();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MatchStartInformationWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchStartInformationWidget_C")
	}
	static class UMatchStartInformationWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchStartInformationWidget_C>();
	}
};
DUMPER7_ASSERTS_UMatchStartInformationWidget_C;

}

