#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModioUICore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Modio_structs.hpp"


namespace SDK
{

// Enum ModioUICore.EModioUILoadState
// NumValues: 0x0005
enum class EModioUILoadState : uint8
{
	NotLoaded                                = 0,
	Loading                                  = 1,
	Loaded                                   = 2,
	Errored                                  = 3,
	EModioUILoadState_MAX                    = 4,
};

// Enum ModioUICore.EModioModInstallationStatus
// NumValues: 0x000D
enum class EModioModInstallationStatus : uint8
{
	NotInstalled                             = 0,
	Error                                    = 1,
	Enabled                                  = 2,
	Disabled                                 = 3,
	Purchased                                = 4,
	SystemInstall                            = 5,
	Queued                                   = 6,
	Initializing                             = 7,
	Downloading                              = 8,
	Extracting                               = 9,
	Uploading                                = 10,
	Uploaded                                 = 11,
	EModioModInstallationStatus_MAX          = 12,
};

// Enum ModioUICore.EModioUIDialogType
// NumValues: 0x0006
enum class EModioUIDialogType : uint8
{
	ModDetails                               = 0,
	ReportMod                                = 1,
	EnableDisableManagement                  = 2,
	PurchaseMod                              = 3,
	StoreUi                                  = 4,
	EModioUIDialogType_MAX                   = 5,
};

// Enum ModioUICore.EModioUIMediaDownloadEventType
// NumValues: 0x0004
enum class EModioUIMediaDownloadEventType : uint8
{
	ModGalleryImages                         = 0,
	ModCreatorAvatarImage                    = 1,
	ModLogo                                  = 2,
	EModioUIMediaDownloadEventType_MAX       = 3,
};

// Enum ModioUICore.EModioUIModInfoEventType
// NumValues: 0x0003
enum class EModioUIModInfoEventType : uint8
{
	ListAllMods                              = 0,
	GetModInfo                               = 1,
	EModioUIModInfoEventType_MAX             = 2,
};

// Enum ModioUICore.EModioTextValidationRule
// NumValues: 0x0009
enum class EModioTextValidationRule : uint8
{
	ETVR_ValidateEmailAddress                = 0,
	ETVR_ValidateAllLetters                  = 1,
	ETVR_ValidateAllNumeric                  = 2,
	ETVR_ValidateAlphanumeric                = 3,
	ETVR_ValidateLength                      = 4,
	ETVR_ValidateNotEmpty                    = 5,
	ETVR_ValidateNoWhitespace                = 6,
	ETVR_ValidateNotBlank                    = 7,
	ETVR_MAX                                 = 8,
};

// Enum ModioUICore.EModioUITokenPackEventType
// NumValues: 0x0003
enum class EModioUITokenPackEventType : uint8
{
	ListAllTokenPacks                        = 0,
	GetTokenPack                             = 1,
	EModioUITokenPackEventType_MAX           = 2,
};

// Enum ModioUICore.EModioModBrowserState
// NumValues: 0x0003
enum class EModioModBrowserState : uint8
{
	ModsView                                 = 0,
	LibraryView                              = 1,
	EModioModBrowserState_MAX                = 2,
};

// Enum ModioUICore.EModioUIComponentID
// NumValues: 0x0016
enum class EModioUIComponentID : uint8
{
	Button                                   = 0,
	StaticText                               = 1,
	EditableText                             = 2,
	MultilineEditableText                    = 3,
	CodeInputText                            = 4,
	EnumSelector                             = 5,
	PresetFilterSelector                     = 6,
	ModTile                                  = 7,
	ModalDialog                              = 8,
	Image                                    = 9,
	ProgressWidget                           = 10,
	CheckBox                                 = 11,
	ModList                                  = 12,
	TagDisplay                               = 13,
	ObjectList                               = 14,
	EnumSelectorEntry                        = 15,
	CommandMenu                              = 16,
	FilterSelectorEntry                      = 17,
	ModPropertyCollection                    = 18,
	UserDisplay                              = 19,
	ObjectSelector                           = 20,
	EModioUIComponentID_MAX                  = 21,
};

// Enum ModioUICore.EModioUIFeatureFlags
// NumValues: 0x0004
enum class EModioUIFeatureFlags : uint8
{
	ModEnableDisable                         = 0,
	Monetization                             = 1,
	ModDownvote                              = 2,
	EModioUIFeatureFlags_MAX                 = 3,
};

// ScriptStruct ModioUICore.ModioUICommandAssetEntry
// 0x00A0 (0x00A8 - 0x0008)
struct FModioUICommandAssetEntry final : public FTableRowBase
{
public:
	TMap<class FName, class FText>                CommandTexts;                                      // 0x0008(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FName, struct FSlateBrush>         CommandIconBrushes;                                // 0x0058(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FModioUICommandAssetEntry;

// ScriptStruct ModioUICore.ModioDefaultCodeInputTextBoxStyle
// 0x02B0 (0x05F0 - 0x0340)
struct FModioDefaultCodeInputTextBoxStyle final : public FTextBlockStyle
{
public:
	struct FSlateBrush                            CharacterBorderBrushBase;                          // 0x0340(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CharacterBorderBrushFocused;                       // 0x0410(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                CharacterBorderPadding;                            // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FakeCaretBrush;                                    // 0x04F0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          FakeCaretHorizontalAlignment;                      // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            FakeCaretVerticalAlignment;                        // 0x05C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C2[0x2];                                      // 0x05C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                CharacterPadding;                                  // 0x05C4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                CharacterSpacing;                                  // 0x05D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MinimumCharacterWidth;                             // 0x05E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E8[0x8];                                      // 0x05E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FModioDefaultCodeInputTextBoxStyle;

// ScriptStruct ModioUICore.ModioTextValidationRule
// 0x0028 (0x0028 - 0x0000)
struct FModioTextValidationRule final
{
public:
	EModioTextValidationRule                      RuleToUse;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ValidationMessage;                                 // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         MinimumLength;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaximumLength;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FModioTextValidationRule;

// ScriptStruct ModioUICore.ModioUIColorEntry
// 0x0010 (0x0018 - 0x0008)
struct FModioUIColorEntry final : public FTableRowBase
{
public:
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FModioUIColorEntry;

// ScriptStruct ModioUICore.LinearColorRef
// 0x0018 (0x0018 - 0x0000)
struct FLinearColorRef final
{
public:
	class FName                                   ReferencedColorName;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FallbackColor;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLinearColorRef;

// ScriptStruct ModioUICore.LinearColorRefOverride
// 0x001C (0x001C - 0x0000)
struct FLinearColorRefOverride final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColorRef                        Color;                                             // 0x0004(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLinearColorRefOverride;

// ScriptStruct ModioUICore.TextOverride
// 0x0020 (0x0020 - 0x0000)
struct FTextOverride final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Value;                                             // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTextOverride;

// ScriptStruct ModioUICore.ClassPathOverride
// 0x0028 (0x0028 - 0x0000)
struct FClassPathOverride final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         Value;                                             // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FClassPathOverride;

// ScriptStruct ModioUICore.ModioCommonButtonParams
// 0x0078 (0x0078 - 0x0000)
struct FModioCommonButtonParams final
{
public:
	bool                                          bIsSpacer;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Width;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextOverride                          ButtonRoleDescription;                             // 0x0010(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         MinWidth;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinHeight;                                         // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClassPathOverride                     Style;                                             // 0x0038(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    TriggeringInputAction;                             // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bConsumePointerInput;                              // 0x0070(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldUseFallbackDefaultInputAction;              // 0x0071(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FModioCommonButtonParams;

// ScriptStruct ModioUICore.InputActionOverride
// 0x0018 (0x0018 - 0x0000)
struct FInputActionOverride final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    Value;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInputActionOverride;

// ScriptStruct ModioUICore.ModioDialogButtonInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FModioDialogButtonInfo final
{
public:
	class FText                                   ButtonLabel;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FClassPathOverride                     StyleOverride;                                     // 0x0018(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FInputActionOverride                   InputActionOverride;                               // 0x0040(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bShowTooltip;                                      // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TooltipTitleText;                                  // 0x0060(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   TooltipInfoText;                                   // 0x0078(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   TooltipTagText;                                    // 0x0090(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bFocusedByDefault;                                 // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FModioDialogButtonInfo;

// ScriptStruct ModioUICore.ModioFeaturedCategoryParams
// 0x0048 (0x0048 - 0x0000)
struct FModioFeaturedCategoryParams final
{
public:
	class FText                                   CategoryName;                                      // 0x0000(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         ExcludedTags;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	EModioSortDirection                           Direction;                                         // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioSortFieldType                           SortField;                                         // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Count;                                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FModioFeaturedCategoryParams;

// ScriptStruct ModioUICore.IntegerOverride
// 0x0008 (0x0008 - 0x0000)
struct FIntegerOverride final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntegerOverride;

// ScriptStruct ModioUICore.FloatOverride
// 0x0008 (0x0008 - 0x0000)
struct FFloatOverride final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFloatOverride;

// ScriptStruct ModioUICore.HAlignOverride
// 0x0002 (0x0002 - 0x0000)
struct FHAlignOverride final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          Value;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHAlignOverride;

// ScriptStruct ModioUICore.SlateFontInfoOverride
// 0x0060 (0x0060 - 0x0000)
struct FSlateFontInfoOverride final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         Value;                                             // 0x0008(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSlateFontInfoOverride;

// ScriptStruct ModioUICore.TextTransformOverride
// 0x0002 (0x0002 - 0x0000)
struct FTextTransformOverride final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          Value;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTextTransformOverride;

// ScriptStruct ModioUICore.ModioRetryCounter
// 0x0004 (0x0004 - 0x0000)
struct FModioRetryCounter final
{
public:
	int32                                         RetriesRemaining;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FModioRetryCounter;

// ScriptStruct ModioUICore.ModioStackedBool
// 0x0010 (0x0010 - 0x0000)
struct FModioStackedBool final
{
public:
	TArray<bool>                                  ValueStack;                                        // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FModioStackedBool;

// ScriptStruct ModioUICore.ModioUIComponentMetadata
// 0x0020 (0x0020 - 0x0000)
struct FModioUIComponentMetadata
{
public:
	TArray<class UClass*>                         RequiredInterfaces;                                // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	EModioUIComponentID                           ComponentID;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ComponentDisplayName;                              // 0x0014(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FModioUIComponentMetadata;

// ScriptStruct ModioUICore.ModioUIButtonComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIButtonComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIButtonComponentMetadata;

// ScriptStruct ModioUICore.ModioUITextComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUITextComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUITextComponentMetadata;

// ScriptStruct ModioUICore.ModioUIEditableTextComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIEditableTextComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIEditableTextComponentMetadata;

// ScriptStruct ModioUICore.ModioUIImageComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIImageComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIImageComponentMetadata;

// ScriptStruct ModioUICore.ModioUIProgressBarComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIProgressBarComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIProgressBarComponentMetadata;

// ScriptStruct ModioUICore.ModioUITagComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUITagComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUITagComponentMetadata;

// ScriptStruct ModioUICore.ModioUIObjectListComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIObjectListComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIObjectListComponentMetadata;

// ScriptStruct ModioUICore.ModioUIModListComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIModListComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIModListComponentMetadata;

// ScriptStruct ModioUICore.ModioUIObjectSelectorComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIObjectSelectorComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIObjectSelectorComponentMetadata;

// ScriptStruct ModioUICore.ModioUIEnumSelectorComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIEnumSelectorComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIEnumSelectorComponentMetadata;

// ScriptStruct ModioUICore.ModioUIEnumSelectorEntryComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIEnumSelectorEntryComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIEnumSelectorEntryComponentMetadata;

// ScriptStruct ModioUICore.ModioUIPresetFilterSelectorComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIPresetFilterSelectorComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIPresetFilterSelectorComponentMetadata;

// ScriptStruct ModioUICore.ModioUIPresetFilterSelectorEntryComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIPresetFilterSelectorEntryComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIPresetFilterSelectorEntryComponentMetadata;

// ScriptStruct ModioUICore.ModioUICommandMenuComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUICommandMenuComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUICommandMenuComponentMetadata;

// ScriptStruct ModioUICore.ModioUIModPropertyCollectionVisualizerComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIModPropertyCollectionVisualizerComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIModPropertyCollectionVisualizerComponentMetadata;

// ScriptStruct ModioUICore.ModioUIModTileComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIModTileComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIModTileComponentMetadata;

// ScriptStruct ModioUICore.ModioUIUserDisplayComponentMetadata
// 0x0000 (0x0020 - 0x0020)
struct FModioUIUserDisplayComponentMetadata final : public FModioUIComponentMetadata
{
};
DUMPER7_ASSERTS_FModioUIUserDisplayComponentMetadata;

}

