#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModioUICore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Modio_structs.hpp"
#include "ModioUICore_structs.hpp"


namespace SDK::Params
{

// Function ModioUICore.ModioModTagSelectorEntry.OnTagEntryClicked
// 0x0008 (0x0008 - 0x0000)
struct ModioModTagSelectorEntry_OnTagEntryClicked final
{
public:
	class UObject*                                ClickedObject;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagSelectorEntry_OnTagEntryClicked;

// Function ModioUICore.ModioModTagSelectorEntry.GetClickableWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelectorEntry_GetClickableWidget final
{
public:
	TScriptInterface<class IModioUIClickableWidget> ReturnValue;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagSelectorEntry_GetClickableWidget;

// Function ModioUICore.ModioModTagSelectorEntry.GetSelectionWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelectorEntry_GetSelectionWidget final
{
public:
	TScriptInterface<class IModioUISelectableWidget> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagSelectorEntry_GetSelectionWidget;

// Function ModioUICore.ModioModTagSelectorEntry.GetTagLabelWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelectorEntry_GetTagLabelWidget final
{
public:
	TScriptInterface<class IModioUIHasTextWidget> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagSelectorEntry_GetTagLabelWidget;

// Function ModioUICore.ModioActivatableWidget.AddActivationChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioActivatableWidget_AddActivationChangedHandler final
{
public:
	TDelegate<void(class UObject* ActivationContext, bool bIsActivated)> Handler;                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioActivatableWidget_AddActivationChangedHandler;

// Function ModioUICore.ModioActivatableWidget.RemoveActivationChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioActivatableWidget_RemoveActivationChangedHandler final
{
public:
	TDelegate<void(class UObject* ActivationContext, bool bIsActivated)> Handler;                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioActivatableWidget_RemoveActivationChangedHandler;

// Function ModioUICore.ModioEnumEntryUIDetails.GetEnumEntryDetails
// 0x0020 (0x0020 - 0x0000)
struct ModioEnumEntryUIDetails_GetEnumEntryDetails final
{
public:
	uint8                                         EnumValue;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   EnumValueDisplayText;                              // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioEnumEntryUIDetails_GetEnumEntryDetails;

// Function ModioUICore.ModioRetryLibrary.CanRetry
// 0x0008 (0x0008 - 0x0000)
struct ModioRetryLibrary_CanRetry final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioRetryLibrary_CanRetry;

// Function ModioUICore.ModioRetryLibrary.CanRetryAsExec
// 0x0008 (0x0008 - 0x0000)
struct ModioRetryLibrary_CanRetryAsExec final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioRetryLibrary_CanRetryAsExec;

// Function ModioUICore.ModioRetryLibrary.ResetRetryCount
// 0x0004 (0x0004 - 0x0000)
struct ModioRetryLibrary_ResetRetryCount final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioRetryLibrary_ResetRetryCount;

// Function ModioUICore.ModioRetryLibrary.ResetRetryCountPure
// 0x0008 (0x0008 - 0x0000)
struct ModioRetryLibrary_ResetRetryCountPure final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FModioRetryCounter                     ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioRetryLibrary_ResetRetryCountPure;

// Function ModioUICore.ModioRetryLibrary.Retry
// 0x0008 (0x0008 - 0x0000)
struct ModioRetryLibrary_Retry final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioRetryLibrary_Retry;

// Function ModioUICore.ModioFocusableWidget.AddFocusPathChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioFocusableWidget_AddFocusPathChangedHandler final
{
public:
	TDelegate<void(class UObject* FocusContext, const struct FFocusEvent& InFocusEvent, bool bIsFocused)> Handler; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFocusableWidget_AddFocusPathChangedHandler;

// Function ModioUICore.ModioFocusableWidget.RemoveFocusPathChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioFocusableWidget_RemoveFocusPathChangedHandler final
{
public:
	TDelegate<void(class UObject* FocusContext, const struct FFocusEvent& InFocusEvent, bool bIsFocused)> Handler; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFocusableWidget_RemoveFocusPathChangedHandler;

// Function ModioUICore.ModioFocusableWidget.GetWidgetToFocus
// 0x0010 (0x0010 - 0x0000)
struct ModioFocusableWidget_GetWidgetToFocus final
{
public:
	EUINavigation                                 NavigationType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFocusableWidget_GetWidgetToFocus;

// Function ModioUICore.ModioGalleryImageUIDetails.GetImage
// 0x0010 (0x0010 - 0x0000)
struct ModioGalleryImageUIDetails_GetImage final
{
public:
	struct FModioImageWrapper                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioGalleryImageUIDetails_GetImage;

// Function ModioUICore.ModioGalleryImageUIDetails.GetIndex
// 0x0004 (0x0004 - 0x0000)
struct ModioGalleryImageUIDetails_GetIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioGalleryImageUIDetails_GetIndex;

// Function ModioUICore.ModioModDependencyUIDetails.GetModDependency
// 0x00F8 (0x00F8 - 0x0000)
struct ModioModDependencyUIDetails_GetModDependency final
{
public:
	struct FModioModDependency                    ReturnValue;                                       // 0x0000(0x00F8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModDependencyUIDetails_GetModDependency;

// Function ModioUICore.ModioModDependencyUIDetails.GetModID
// 0x0008 (0x0008 - 0x0000)
struct ModioModDependencyUIDetails_GetModID final
{
public:
	struct FModioModID                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModDependencyUIDetails_GetModID;

// Function ModioUICore.ModioModFilterUIDetails.GetFilterName
// 0x0020 (0x0020 - 0x0000)
struct ModioModFilterUIDetails_GetFilterName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioModFilterUIDetails_GetFilterName;

// Function ModioUICore.ModioModFilterUIDetails.GetFilterParams
// 0x00B8 (0x00B8 - 0x0000)
struct ModioModFilterUIDetails_GetFilterParams final
{
public:
	struct FModioFilterParams                     ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModFilterUIDetails_GetFilterParams;

// Function ModioUICore.ModioModTagSelector.GetMenuToggleClickableWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelector_GetMenuToggleClickableWidget final
{
public:
	TScriptInterface<class IModioUIClickableWidget> ReturnValue;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagSelector_GetMenuToggleClickableWidget;

// Function ModioUICore.ModioModTagSelector.GetSelectorMenuWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelector_GetSelectorMenuWidget final
{
public:
	TScriptInterface<class IModioUIModTagSelector> ReturnValue;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagSelector_GetSelectorMenuWidget;

// Function ModioUICore.ModioModInfoUIDetails.GetFullModInfo
// 0x01E8 (0x01E8 - 0x0000)
struct ModioModInfoUIDetails_GetFullModInfo final
{
public:
	struct FModioModInfo                          ReturnValue;                                       // 0x0000(0x01E8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModInfoUIDetails_GetFullModInfo;

// Function ModioUICore.ModioModInfoUIDetails.GetModID
// 0x0008 (0x0008 - 0x0000)
struct ModioModInfoUIDetails_GetModID final
{
public:
	struct FModioModID                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModInfoUIDetails_GetModID;

// Function ModioUICore.ModioModTagUIDetails.GetLocalizedText
// 0x0018 (0x0018 - 0x0000)
struct ModioModTagUIDetails_GetLocalizedText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagUIDetails_GetLocalizedText;

// Function ModioUICore.ModioModTagUIDetails.GetRawStringValue
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagUIDetails_GetRawStringValue final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagUIDetails_GetRawStringValue;

// Function ModioUICore.ModioModTagUIDetails.GetSelectionState
// 0x0001 (0x0001 - 0x0000)
struct ModioModTagUIDetails_GetSelectionState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagUIDetails_GetSelectionState;

// Function ModioUICore.ModioModTagUIDetails.SetSelectionState
// 0x0001 (0x0001 - 0x0000)
struct ModioModTagUIDetails_SetSelectionState final
{
public:
	bool                                          bNewSelectionState;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagUIDetails_SetSelectionState;

// Function ModioUICore.PropertyOverridesLibrary.ApplyClassPathOverride
// 0x0068 (0x0068 - 0x0000)
struct PropertyOverridesLibrary_ApplyClassPathOverride final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         DefaultValue;                                      // 0x0028(0x0020)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         ReturnValue;                                       // 0x0048(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ApplyClassPathOverride;

// Function ModioUICore.PropertyOverridesLibrary.ApplyClassPathOverride_Casted
// 0x0040 (0x0040 - 0x0000)
struct PropertyOverridesLibrary_ApplyClassPathOverride_Casted final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    BaseClass;                                         // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 DefaultValue;                                      // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ApplyClassPathOverride_Casted;

// Function ModioUICore.PropertyOverridesLibrary.ApplyFloatOverride
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ApplyFloatOverride final
{
public:
	struct FFloatOverride                         Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DefaultValue;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ApplyFloatOverride;

// Function ModioUICore.PropertyOverridesLibrary.ApplyFontInfoOverride
// 0x0110 (0x0110 - 0x0000)
struct PropertyOverridesLibrary_ApplyFontInfoOverride final
{
public:
	struct FSlateFontInfoOverride                 Target;                                            // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         DefaultValue;                                      // 0x0060(0x0058)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         ReturnValue;                                       // 0x00B8(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ApplyFontInfoOverride;

// Function ModioUICore.PropertyOverridesLibrary.ApplyHAlignOverride
// 0x0004 (0x0004 - 0x0000)
struct PropertyOverridesLibrary_ApplyHAlignOverride final
{
public:
	struct FHAlignOverride                        Target;                                            // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          DefaultValue;                                      // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ApplyHAlignOverride;

// Function ModioUICore.PropertyOverridesLibrary.ApplyInputActionOverride
// 0x0038 (0x0038 - 0x0000)
struct PropertyOverridesLibrary_ApplyInputActionOverride final
{
public:
	struct FInputActionOverride                   Target;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    DefaultValue;                                      // 0x0018(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ApplyInputActionOverride;

// Function ModioUICore.PropertyOverridesLibrary.ApplyIntOverride
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ApplyIntOverride final
{
public:
	struct FIntegerOverride                       Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         DefaultValue;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ApplyIntOverride;

// Function ModioUICore.PropertyOverridesLibrary.ApplyTextOverride
// 0x0050 (0x0050 - 0x0000)
struct PropertyOverridesLibrary_ApplyTextOverride final
{
public:
	struct FTextOverride                          Target;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   DefaultValue;                                      // 0x0020(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ApplyTextOverride;

// Function ModioUICore.PropertyOverridesLibrary.ApplyTextTransformOverride
// 0x0004 (0x0004 - 0x0000)
struct PropertyOverridesLibrary_ApplyTextTransformOverride final
{
public:
	struct FTextTransformOverride                 Target;                                            // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          DefaultValue;                                      // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ApplyTextTransformOverride;

// Function ModioUICore.PropertyOverridesLibrary.ResolveClassPathOverride
// 0x0050 (0x0050 - 0x0000)
struct PropertyOverridesLibrary_ResolveClassPathOverride final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveClassPathOverride;

// Function ModioUICore.PropertyOverridesLibrary.ResolveClassPathOverride_Casted
// 0x0040 (0x0040 - 0x0000)
struct PropertyOverridesLibrary_ResolveClassPathOverride_Casted final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    BaseClass;                                         // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveClassPathOverride_Casted;

// Function ModioUICore.PropertyOverridesLibrary.ResolveClassPathOverrideAsExec
// 0x0050 (0x0050 - 0x0000)
struct PropertyOverridesLibrary_ResolveClassPathOverrideAsExec final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveClassPathOverrideAsExec;

// Function ModioUICore.PropertyOverridesLibrary.ResolveClassPathOverrideAsExec_Casted
// 0x0040 (0x0040 - 0x0000)
struct PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    BaseClass;                                         // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted;

// Function ModioUICore.PropertyOverridesLibrary.ResolveFloatOverride
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ResolveFloatOverride final
{
public:
	struct FFloatOverride                         Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveFloatOverride;

// Function ModioUICore.PropertyOverridesLibrary.ResolveFloatOverrideAsExec
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ResolveFloatOverrideAsExec final
{
public:
	struct FFloatOverride                         Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveFloatOverrideAsExec;

// Function ModioUICore.PropertyOverridesLibrary.ResolveFontInfoOverride
// 0x00C0 (0x00C0 - 0x0000)
struct PropertyOverridesLibrary_ResolveFontInfoOverride final
{
public:
	struct FSlateFontInfoOverride                 Target;                                            // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         ReturnValue;                                       // 0x0068(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveFontInfoOverride;

// Function ModioUICore.PropertyOverridesLibrary.ResolveFontInfoOverrideAsExec
// 0x00C0 (0x00C0 - 0x0000)
struct PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec final
{
public:
	struct FSlateFontInfoOverride                 Target;                                            // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         ReturnValue;                                       // 0x0068(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec;

// Function ModioUICore.PropertyOverridesLibrary.ResolveHAlignOverride
// 0x0004 (0x0004 - 0x0000)
struct PropertyOverridesLibrary_ResolveHAlignOverride final
{
public:
	struct FHAlignOverride                        Target;                                            // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveHAlignOverride;

// Function ModioUICore.PropertyOverridesLibrary.ResolveHAlignOverrideAsExec
// 0x0004 (0x0004 - 0x0000)
struct PropertyOverridesLibrary_ResolveHAlignOverrideAsExec final
{
public:
	struct FHAlignOverride                        Target;                                            // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveHAlignOverrideAsExec;

// Function ModioUICore.PropertyOverridesLibrary.ResolveInputActionOverride
// 0x0030 (0x0030 - 0x0000)
struct PropertyOverridesLibrary_ResolveInputActionOverride final
{
public:
	struct FInputActionOverride                   Target;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveInputActionOverride;

// Function ModioUICore.PropertyOverridesLibrary.ResolveInputActionOverrideAsExec
// 0x0030 (0x0030 - 0x0000)
struct PropertyOverridesLibrary_ResolveInputActionOverrideAsExec final
{
public:
	struct FInputActionOverride                   Target;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveInputActionOverrideAsExec;

// Function ModioUICore.PropertyOverridesLibrary.ResolveIntOverride
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ResolveIntOverride final
{
public:
	struct FIntegerOverride                       Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveIntOverride;

// Function ModioUICore.PropertyOverridesLibrary.ResolveIntOverrideAsExec
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ResolveIntOverrideAsExec final
{
public:
	struct FIntegerOverride                       Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveIntOverrideAsExec;

// Function ModioUICore.PropertyOverridesLibrary.ResolveTextOverride
// 0x0040 (0x0040 - 0x0000)
struct PropertyOverridesLibrary_ResolveTextOverride final
{
public:
	struct FTextOverride                          Target;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveTextOverride;

// Function ModioUICore.PropertyOverridesLibrary.ResolveTextOverrideAsExec
// 0x0040 (0x0040 - 0x0000)
struct PropertyOverridesLibrary_ResolveTextOverrideAsExec final
{
public:
	struct FTextOverride                          Target;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveTextOverrideAsExec;

// Function ModioUICore.PropertyOverridesLibrary.ResolveTextTransformOverride
// 0x0004 (0x0004 - 0x0000)
struct PropertyOverridesLibrary_ResolveTextTransformOverride final
{
public:
	struct FTextTransformOverride                 Target;                                            // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveTextTransformOverride;

// Function ModioUICore.PropertyOverridesLibrary.ResolveTextTransformOverrideAsExec
// 0x0004 (0x0004 - 0x0000)
struct PropertyOverridesLibrary_ResolveTextTransformOverrideAsExec final
{
public:
	struct FTextTransformOverride                 Target;                                            // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyOverridesLibrary_ResolveTextTransformOverrideAsExec;

// Function ModioUICore.ModioModTagCategoryUIDetails.GetAllowMultipleSelection
// 0x0001 (0x0001 - 0x0000)
struct ModioModTagCategoryUIDetails_GetAllowMultipleSelection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagCategoryUIDetails_GetAllowMultipleSelection;

// Function ModioUICore.ModioModTagCategoryUIDetails.GetCategoryTags
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagCategoryUIDetails_GetCategoryTags final
{
public:
	TArray<TScriptInterface<class IModioModTagUIDetails>> ReturnValue;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagCategoryUIDetails_GetCategoryTags;

// Function ModioUICore.ModioModTagCategoryUIDetails.GetIsCategoryHidden
// 0x0001 (0x0001 - 0x0000)
struct ModioModTagCategoryUIDetails_GetIsCategoryHidden final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagCategoryUIDetails_GetIsCategoryHidden;

// Function ModioUICore.ModioModTagCategoryUIDetails.GetIsCategoryLocked
// 0x0001 (0x0001 - 0x0000)
struct ModioModTagCategoryUIDetails_GetIsCategoryLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagCategoryUIDetails_GetIsCategoryLocked;

// Function ModioUICore.ModioModTagCategoryUIDetails.GetLocalizedCategoryName
// 0x0018 (0x0018 - 0x0000)
struct ModioModTagCategoryUIDetails_GetLocalizedCategoryName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagCategoryUIDetails_GetLocalizedCategoryName;

// Function ModioUICore.ModioModTagCategoryUIDetails.GetRawCategoryName
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagCategoryUIDetails_GetRawCategoryName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagCategoryUIDetails_GetRawCategoryName;

// Function ModioUICore.ModioModTagCategoryUIDetails.GetSelectedTags
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagCategoryUIDetails_GetSelectedTags final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagCategoryUIDetails_GetSelectedTags;

// Function ModioUICore.ModioModTagOptionsUIDetails.GetCategories
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagOptionsUIDetails_GetCategories final
{
public:
	TArray<TScriptInterface<class IModioModTagCategoryUIDetails>> ReturnValue;                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagOptionsUIDetails_GetCategories;

// Function ModioUICore.ModioModTagOptionsUIDetails.GetSelectedTags
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagOptionsUIDetails_GetSelectedTags final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioModTagOptionsUIDetails_GetSelectedTags;

// Function ModioUICore.ModioTokenPackBrowser.GetTitleTextWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioTokenPackBrowser_GetTitleTextWidget final
{
public:
	TScriptInterface<class IModioUIHasTextWidget> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioTokenPackBrowser_GetTitleTextWidget;

// Function ModioUICore.ModioTokenPackBrowser.GetTokenTileViewWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioTokenPackBrowser_GetTokenTileViewWidget final
{
public:
	TScriptInterface<class IModioUITokenPackListInterface> ReturnValue;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioTokenPackBrowser_GetTokenTileViewWidget;

// Function ModioUICore.ModioScrollableWidget.SetScrollOffset
// 0x0004 (0x0004 - 0x0000)
struct ModioScrollableWidget_SetScrollOffset final
{
public:
	float                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioScrollableWidget_SetScrollOffset;

// Function ModioUICore.ModioScrollableWidget.GetScrollOffset
// 0x0004 (0x0004 - 0x0000)
struct ModioScrollableWidget_GetScrollOffset final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioScrollableWidget_GetScrollOffset;

// Function ModioUICore.ModioToggleableWidget.AddToggleStateChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioToggleableWidget_AddToggleStateChangedHandler final
{
public:
	TDelegate<void(class UObject* Context, bool bIsOpen)> Handler;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioToggleableWidget_AddToggleStateChangedHandler;

// Function ModioUICore.ModioToggleableWidget.Open
// 0x0002 (0x0002 - 0x0000)
struct ModioToggleableWidget_Open final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFocusMenu;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioToggleableWidget_Open;

// Function ModioUICore.ModioToggleableWidget.RemoveToggleStateChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioToggleableWidget_RemoveToggleStateChangedHandler final
{
public:
	TDelegate<void(class UObject* Context, bool bIsOpen)> Handler;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioToggleableWidget_RemoveToggleStateChangedHandler;

// Function ModioUICore.ModioToggleableWidget.IsOpen
// 0x0001 (0x0001 - 0x0000)
struct ModioToggleableWidget_IsOpen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioToggleableWidget_IsOpen;

// Function ModioUICore.ModioStackedBoolLibrary.PeekBoolValue
// 0x0018 (0x0018 - 0x0000)
struct ModioStackedBoolLibrary_PeekBoolValue final
{
public:
	struct FModioStackedBool                      Target;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bDidPeekSuccessfully;                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioStackedBoolLibrary_PeekBoolValue;

// Function ModioUICore.ModioStackedBoolLibrary.PopBoolValue
// 0x0018 (0x0018 - 0x0000)
struct ModioStackedBoolLibrary_PopBoolValue final
{
public:
	struct FModioStackedBool                      Target;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bDidPopSuccessfully;                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioStackedBoolLibrary_PopBoolValue;

// Function ModioUICore.ModioStackedBoolLibrary.PushBoolValue
// 0x0018 (0x0018 - 0x0000)
struct ModioStackedBoolLibrary_PushBoolValue final
{
public:
	struct FModioStackedBool                      Target;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bNewValue;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioStackedBoolLibrary_PushBoolValue;

// Function ModioUICore.ModioUIClickableWidget.AddClickedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioUIClickableWidget_AddClickedHandler final
{
public:
	TDelegate<void(class UObject* ClickContext)>  Handler;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUIClickableWidget_AddClickedHandler;

// Function ModioUICore.ModioUIClickableWidget.RemoveClickedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioUIClickableWidget_RemoveClickedHandler final
{
public:
	TDelegate<void(class UObject* ClickContext)>  Handler;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUIClickableWidget_RemoveClickedHandler;

// Function ModioUICore.ModioUIBoundActionWidget.AddActionCompletedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioUIBoundActionWidget_AddActionCompletedHandler final
{
public:
	TDelegate<void(const struct FDataTableRowHandle& BoundAction)> Handler;                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUIBoundActionWidget_AddActionCompletedHandler;

// Function ModioUICore.ModioUIBoundActionWidget.AddActionProgressHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioUIBoundActionWidget_AddActionProgressHandler final
{
public:
	TDelegate<void(const struct FDataTableRowHandle& BoundAction, float Progress)> Handler;          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUIBoundActionWidget_AddActionProgressHandler;

// Function ModioUICore.ModioUIBoundActionWidget.RemoveActionCompletedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioUIBoundActionWidget_RemoveActionCompletedHandler final
{
public:
	TDelegate<void(const struct FDataTableRowHandle& BoundAction)> Handler;                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUIBoundActionWidget_RemoveActionCompletedHandler;

// Function ModioUICore.ModioUIBoundActionWidget.RemoveActionProgressHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioUIBoundActionWidget_RemoveActionProgressHandler final
{
public:
	TDelegate<void(const struct FDataTableRowHandle& BoundAction, float Progress)> Handler;          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUIBoundActionWidget_RemoveActionProgressHandler;

// Function ModioUICore.ModioUIBoundActionWidget.SetBoundAction
// 0x0010 (0x0010 - 0x0000)
struct ModioUIBoundActionWidget_SetBoundAction final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUIBoundActionWidget_SetBoundAction;

// Function ModioUICore.ModioUIBoundActionWidget.TryGetBoundAction
// 0x0018 (0x0018 - 0x0000)
struct ModioUIBoundActionWidget_TryGetBoundAction final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioUIBoundActionWidget_TryGetBoundAction;

// Function ModioUICore.ModioPresetFilterEntryWidget.GetLabelWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioPresetFilterEntryWidget_GetLabelWidget final
{
public:
	TScriptInterface<class IModioUIHasTextWidget> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioPresetFilterEntryWidget_GetLabelWidget;

// Function ModioUICore.ModioUICommandMenu.AddCommandListBuilder
// 0x0010 (0x0010 - 0x0000)
struct ModioUICommandMenu_AddCommandListBuilder final
{
public:
	TDelegate<void(TArray<class UObject*>* CommandList, class UObject* Context)> Builder;            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUICommandMenu_AddCommandListBuilder;

// Function ModioUICore.ModioUICommandMenu.RemoveCommandListBuilder
// 0x0010 (0x0010 - 0x0000)
struct ModioUICommandMenu_RemoveCommandListBuilder final
{
public:
	TDelegate<void(TArray<class UObject*>* CommandList, class UObject* Context)> Builder;            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUICommandMenu_RemoveCommandListBuilder;

// Function ModioUICore.ModioUICommandObject.CanExecute
// 0x0010 (0x0010 - 0x0000)
struct ModioUICommandObject_CanExecute final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioUICommandObject_CanExecute;

// Function ModioUICore.ModioUICommandObject.Execute
// 0x0008 (0x0008 - 0x0000)
struct ModioUICommandObject_Execute final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUICommandObject_Execute;

// Function ModioUICore.ModioUICommandObject.GetCommandBrush
// 0x00D0 (0x00D0 - 0x0000)
struct ModioUICommandObject_GetCommandBrush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUICommandObject_GetCommandBrush;

// Function ModioUICore.ModioUICommandObject.GetCommandDisplayString
// 0x0018 (0x0018 - 0x0000)
struct ModioUICommandObject_GetCommandDisplayString final
{
public:
