#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modio

#include "Basic.hpp"

#include "Modio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Modio.ModioCommonTypesLibrary.Conv_ApiKeyToString
// 0x0020 (0x0020 - 0x0000)
struct ModioCommonTypesLibrary_Conv_ApiKeyToString final
{
public:
	struct FModioApiKey                           ApiKey;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_Conv_ApiKeyToString;

// Function Modio.ModioCommonTypesLibrary.Conv_EmailAddressToString
// 0x0020 (0x0020 - 0x0000)
struct ModioCommonTypesLibrary_Conv_EmailAddressToString final
{
public:
	struct FModioEmailAddress                     EmailAddress;                                      // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_Conv_EmailAddressToString;

// Function Modio.ModioCommonTypesLibrary.Conv_EmailAuthCodeToString
// 0x0020 (0x0020 - 0x0000)
struct ModioCommonTypesLibrary_Conv_EmailAuthCodeToString final
{
public:
	struct FModioEmailAuthCode                    EmailAuthCode;                                     // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_Conv_EmailAuthCodeToString;

// Function Modio.ModioCommonTypesLibrary.Conv_FileMetadataIDToString
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonTypesLibrary_Conv_FileMetadataIDToString final
{
public:
	struct FModioFileMetadataID                   FileMetadataID;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_Conv_FileMetadataIDToString;

// Function Modio.ModioCommonTypesLibrary.Conv_GameIDToString
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonTypesLibrary_Conv_GameIDToString final
{
public:
	struct FModioGameID                           GameId;                                            // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_Conv_GameIDToString;

// Function Modio.ModioCommonTypesLibrary.Conv_ModIDToString
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonTypesLibrary_Conv_ModIDToString final
{
public:
	struct FModioModID                            ModId;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_Conv_ModIDToString;

// Function Modio.ModioCommonTypesLibrary.Conv_StringToEmailAddress
// 0x0020 (0x0020 - 0x0000)
struct ModioCommonTypesLibrary_Conv_StringToEmailAddress final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioEmailAddress                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_Conv_StringToEmailAddress;

// Function Modio.ModioCommonTypesLibrary.Conv_StringToEmailAuthCode
// 0x0020 (0x0020 - 0x0000)
struct ModioCommonTypesLibrary_Conv_StringToEmailAuthCode final
{
public:
	class FString                                 AuthCode;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioEmailAuthCode                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_Conv_StringToEmailAuthCode;

// Function Modio.ModioCommonTypesLibrary.Conv_UserIDToString
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonTypesLibrary_Conv_UserIDToString final
{
public:
	struct FModioUserID                           UserId;                                            // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_Conv_UserIDToString;

// Function Modio.ModioCommonTypesLibrary.EqualTo
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonTypesLibrary_EqualTo final
{
public:
	struct FModioModID                            A;                                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioModID                            B;                                                 // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_EqualTo;

// Function Modio.ModioCommonTypesLibrary.GetRawValueFromModID
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonTypesLibrary_GetRawValueFromModID final
{
public:
	struct FModioModID                            In;                                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_GetRawValueFromModID;

// Function Modio.ModioCommonTypesLibrary.MakeApiKey
// 0x0020 (0x0020 - 0x0000)
struct ModioCommonTypesLibrary_MakeApiKey final
{
public:
	class FString                                 ApiKey;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioApiKey                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_MakeApiKey;

// Function Modio.ModioCommonTypesLibrary.MakeAuthParams
// 0x00A0 (0x00A0 - 0x0000)
struct ModioCommonTypesLibrary_MakeAuthParams final
{
public:
	class FString                                 AuthToken;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EmailAddress;                                      // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasAcceptedTOS;                                   // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioAuthenticationParams             ReturnValue;                                       // 0x0028(0x0078)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_MakeAuthParams;

// Function Modio.ModioCommonTypesLibrary.MakeEntitlementParams
// 0x00A0 (0x00A0 - 0x0000)
struct ModioCommonTypesLibrary_MakeEntitlementParams final
{
public:
	TMap<class FString, class FString>            ExtendedParameters;                                // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioEntitlementParams                ReturnValue;                                       // 0x0050(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_MakeEntitlementParams;

// Function Modio.ModioCommonTypesLibrary.MakeGameId
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonTypesLibrary_MakeGameId final
{
public:
	int64                                         GameId;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioGameID                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_MakeGameId;

// Function Modio.ModioCommonTypesLibrary.MakeGuid
// 0x0020 (0x0020 - 0x0000)
struct ModioCommonTypesLibrary_MakeGuid final
{
public:
	class FString                                 Guid;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioGuid                             ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_MakeGuid;

// Function Modio.ModioCommonTypesLibrary.MakeInitializeOptions
// 0x00B0 (0x00B0 - 0x0000)
struct ModioCommonTypesLibrary_MakeInitializeOptions final
{
public:
	int64                                         GameId;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ApiKey;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioEnvironment                             GameEnvironment;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioPortal                                  PortalInUse;                                       // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBackgroundThread;                              // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioInitializeOptions                ReturnValue;                                       // 0x0020(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_MakeInitializeOptions;

// Function Modio.ModioCommonTypesLibrary.MakeMetricsSessionParams
// 0x0038 (0x0038 - 0x0000)
struct ModioCommonTypesLibrary_MakeMetricsSessionParams final
{
public:
	TArray<struct FModioModID>                    IDs;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioMetricsSessionParams             ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_MakeMetricsSessionParams;

// Function Modio.ModioCommonTypesLibrary.NotEqualTo
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonTypesLibrary_NotEqualTo final
{
public:
	struct FModioModID                            A;                                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioModID                            B;                                                 // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_NotEqualTo;

// Function Modio.ModioCommonTypesLibrary.SetAPIKey
// 0x0130 (0x0130 - 0x0000)
struct ModioCommonTypesLibrary_SetAPIKey final
{
public:
	struct FModioInitializeOptions                Options;                                           // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ApiKey;                                            // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioInitializeOptions                ReturnValue;                                       // 0x00A0(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_SetAPIKey;

// Function Modio.ModioCommonTypesLibrary.SetBackgroundThread
// 0x0128 (0x0128 - 0x0000)
struct ModioCommonTypesLibrary_SetBackgroundThread final
{
public:
	struct FModioInitializeOptions                Options;                                           // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bUseBackgroundThread;                              // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioInitializeOptions                ReturnValue;                                       // 0x0098(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_SetBackgroundThread;

// Function Modio.ModioCommonTypesLibrary.SetExtendedInitializationParameters
// 0x0170 (0x0170 - 0x0000)
struct ModioCommonTypesLibrary_SetExtendedInitializationParameters final
{
public:
	struct FModioInitializeOptions                Options;                                           // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ExtendedParameters;                                // 0x0090(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioInitializeOptions                ReturnValue;                                       // 0x00E0(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_SetExtendedInitializationParameters;

// Function Modio.ModioCommonTypesLibrary.SetGameEnvironment
// 0x0128 (0x0128 - 0x0000)
struct ModioCommonTypesLibrary_SetGameEnvironment final
{
public:
	struct FModioInitializeOptions                Options;                                           // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EModioEnvironment                             GameEnvironment;                                   // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioInitializeOptions                ReturnValue;                                       // 0x0098(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_SetGameEnvironment;

// Function Modio.ModioCommonTypesLibrary.SetGameId
// 0x0128 (0x0128 - 0x0000)
struct ModioCommonTypesLibrary_SetGameId final
{
public:
	struct FModioInitializeOptions                Options;                                           // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         GameId;                                            // 0x0090(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioInitializeOptions                ReturnValue;                                       // 0x0098(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_SetGameId;

// Function Modio.ModioCommonTypesLibrary.SetPortal
// 0x0128 (0x0128 - 0x0000)
struct ModioCommonTypesLibrary_SetPortal final
{
public:
	struct FModioInitializeOptions                Options;                                           // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EModioPortal                                  PortalToUse;                                       // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioInitializeOptions                ReturnValue;                                       // 0x0098(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_SetPortal;

// Function Modio.ModioCommonTypesLibrary.SetSessionId
// 0x0060 (0x0060 - 0x0000)
struct ModioCommonTypesLibrary_SetSessionId final
{
public:
	struct FModioMetricsSessionParams             Params_0;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioGuid                             ID;                                                // 0x0028(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioMetricsSessionParams             ReturnValue;                                       // 0x0038(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_SetSessionId;

// Function Modio.ModioCommonTypesLibrary.SetSessionIdentifier
// 0x0130 (0x0130 - 0x0000)
struct ModioCommonTypesLibrary_SetSessionIdentifier final
{
public:
	struct FModioInitializeOptions                Options;                                           // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 SessionIdentifier;                                 // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioInitializeOptions                ReturnValue;                                       // 0x00A0(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCommonTypesLibrary_SetSessionIdentifier;

// Function Modio.ModioCreateModLibrary.SetChangelogString
// 0x0088 (0x0088 - 0x0000)
struct ModioCreateModLibrary_SetChangelogString final
{
public:
	struct FModioCreateModFileParams              In;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Changelog;                                         // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetChangelogString;

// Function Modio.ModioCreateModLibrary.SetDescription
// 0x00D8 (0x00D8 - 0x0000)
struct ModioCreateModLibrary_SetDescription final
{
public:
	struct FModioCreateModParams                  In;                                                // 0x0000(0x00C8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x00C8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetDescription;

// Function Modio.ModioCreateModLibrary.SetHomepageURL
// 0x00D8 (0x00D8 - 0x0000)
struct ModioCreateModLibrary_SetHomepageURL final
{
public:
	struct FModioCreateModParams                  In;                                                // 0x0000(0x00C8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 HomepageURL;                                       // 0x00C8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetHomepageURL;

// Function Modio.ModioCreateModLibrary.SetInitialVisibility
// 0x00D0 (0x00D0 - 0x0000)
struct ModioCreateModLibrary_SetInitialVisibility final
{
public:
	struct FModioCreateModParams                  In;                                                // 0x0000(0x00C8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EModioObjectVisibilityFlags                   InitialVisibility;                                 // 0x00C8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetInitialVisibility;

// Function Modio.ModioCreateModLibrary.SetInitialVisibility_DEPRECATED
// 0x00D0 (0x00D0 - 0x0000)
struct ModioCreateModLibrary_SetInitialVisibility_DEPRECATED final
{
public:
	struct FModioCreateModParams                  In;                                                // 0x0000(0x00C8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          InitialVisibility;                                 // 0x00C8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetInitialVisibility_DEPRECATED;

// Function Modio.ModioCreateModLibrary.SetMarkAsActiveRelease
// 0x0080 (0x0080 - 0x0000)
struct ModioCreateModLibrary_SetMarkAsActiveRelease final
{
public:
	struct FModioCreateModFileParams              In;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bMarkAsActiveRelease;                              // 0x0078(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetMarkAsActiveRelease;

// Function Modio.ModioCreateModLibrary.SetMetadataBlob
// 0x00D8 (0x00D8 - 0x0000)
struct ModioCreateModLibrary_SetMetadataBlob final
{
public:
	struct FModioCreateModParams                  In;                                                // 0x0000(0x00C8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 MetadataBlob;                                      // 0x00C8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetMetadataBlob;

// Function Modio.ModioCreateModLibrary.SetModFileMetadataBlob
// 0x0088 (0x0088 - 0x0000)
struct ModioCreateModLibrary_SetModFileMetadataBlob final
{
public:
	struct FModioCreateModFileParams              In;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 MetadataBlob;                                      // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetModFileMetadataBlob;

// Function Modio.ModioCreateModLibrary.SetModfilePlatforms
// 0x0088 (0x0088 - 0x0000)
struct ModioCreateModLibrary_SetModfilePlatforms final
{
public:
	struct FModioCreateModFileParams              In;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EModioModfilePlatform>                 Platforms;                                         // 0x0078(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetModfilePlatforms;

// Function Modio.ModioCreateModLibrary.SetTags
// 0x00D8 (0x00D8 - 0x0000)
struct ModioCreateModLibrary_SetTags final
{
public:
	struct FModioCreateModParams                  In;                                                // 0x0000(0x00C8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x00C8(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetTags;

// Function Modio.ModioCreateModLibrary.SetVersionString
// 0x0088 (0x0088 - 0x0000)
struct ModioCreateModLibrary_SetVersionString final
{
public:
	struct FModioCreateModFileParams              In;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioCreateModLibrary_SetVersionString;

// Function Modio.ModioEditModLibrary.SetDescription
// 0x00E0 (0x00E0 - 0x0000)
struct ModioEditModLibrary_SetDescription final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x00D0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetDescription;

// Function Modio.ModioEditModLibrary.SetHomepageURL
// 0x00E0 (0x00E0 - 0x0000)
struct ModioEditModLibrary_SetHomepageURL final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 HomepageURL;                                       // 0x00D0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetHomepageURL;

// Function Modio.ModioEditModLibrary.SetLogoPath
// 0x00E0 (0x00E0 - 0x0000)
struct ModioEditModLibrary_SetLogoPath final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 LogoPath;                                          // 0x00D0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetLogoPath;

// Function Modio.ModioEditModLibrary.SetMaturityFlags
// 0x00D8 (0x00D8 - 0x0000)
struct ModioEditModLibrary_SetMaturityFlags final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EModioMaturityFlags                           MaturityFlags;                                     // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetMaturityFlags;

// Function Modio.ModioEditModLibrary.SetMetadataBlob
// 0x00E0 (0x00E0 - 0x0000)
struct ModioEditModLibrary_SetMetadataBlob final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 MetadataBlob;                                      // 0x00D0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetMetadataBlob;

// Function Modio.ModioEditModLibrary.SetName
// 0x00E0 (0x00E0 - 0x0000)
struct ModioEditModLibrary_SetName final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x00D0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetName;

// Function Modio.ModioEditModLibrary.SetNamePath
// 0x00E0 (0x00E0 - 0x0000)
struct ModioEditModLibrary_SetNamePath final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 NamePath;                                          // 0x00D0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetNamePath;

// Function Modio.ModioEditModLibrary.SetSummary
// 0x00E0 (0x00E0 - 0x0000)
struct ModioEditModLibrary_SetSummary final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Summary;                                           // 0x00D0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetSummary;

// Function Modio.ModioEditModLibrary.SetTags
// 0x00E0 (0x00E0 - 0x0000)
struct ModioEditModLibrary_SetTags final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x00D0(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetTags;

// Function Modio.ModioEditModLibrary.SetVisibility
// 0x00D8 (0x00D8 - 0x0000)
struct ModioEditModLibrary_SetVisibility final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EModioObjectVisibilityFlags                   Visibility;                                        // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetVisibility;

// Function Modio.ModioEditModLibrary.SetVisibility_DEPRECATED
// 0x00D8 (0x00D8 - 0x0000)
struct ModioEditModLibrary_SetVisibility_DEPRECATED final
{
public:
	struct FModioEditModParams                    In;                                                // 0x0000(0x00D0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Visibility;                                        // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioEditModLibrary_SetVisibility_DEPRECATED;

// Function Modio.ModioUIEnumLocalizationLibrary.FileSizeUnsigned64_ToText
// 0x0030 (0x0030 - 0x0000)
struct ModioUIEnumLocalizationLibrary_FileSizeUnsigned64_ToText final
{
public:
	struct FModioUnsigned64                       Filesize;                                          // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         MinDecimals;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDecimals;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFileSizeUnit                                 Unit;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeUnitName;                                  // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUIEnumLocalizationLibrary_FileSizeUnsigned64_ToText;

// Function Modio.ModioUIEnumLocalizationLibrary.GetLocalizedTextForEnumByName
// 0x0020 (0x0020 - 0x0000)
struct ModioUIEnumLocalizationLibrary_GetLocalizedTextForEnumByName final
{
public:
	class FName                                   EnumName;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUIEnumLocalizationLibrary_GetLocalizedTextForEnumByName;

// Function Modio.ModioUILocalizationLibrary.GetLocalizedTextFromDefaultTableByKey
// 0x0028 (0x0028 - 0x0000)
struct ModioUILocalizationLibrary_GetLocalizedTextFromDefaultTableByKey final
{
public:
	class FString                                 StringKey;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioUILocalizationLibrary_GetLocalizedTextFromDefaultTableByKey;

// Function Modio.ModioErrorCodeLibrary.GetMessage
// 0x0018 (0x0018 - 0x0000)
struct ModioErrorCodeLibrary_GetMessage final
{
public:
	struct FModioErrorCode                        Error;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioErrorCodeLibrary_GetMessage;

// Function Modio.ModioErrorCodeLibrary.GetValue
// 0x0010 (0x0010 - 0x0000)
struct ModioErrorCodeLibrary_GetValue final
{
public:
	struct FModioErrorCode                        Error;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioErrorCodeLibrary_GetValue;

// Function Modio.ModioErrorCodeLibrary.IsError
// 0x0010 (0x0010 - 0x0000)
struct ModioErrorCodeLibrary_IsError final
{
public:
	struct FModioErrorCode                        Error;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioErrorCodeLibrary_IsError;

// Function Modio.ModioErrorCodeLibrary.IsErrorAsExec
// 0x0010 (0x0010 - 0x0000)
struct ModioErrorCodeLibrary_IsErrorAsExec final
{
public:
	struct FModioErrorCode                        Error;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioErrorCodeLibrary_IsErrorAsExec;

// Function Modio.ModioErrorCodeLibrary.ReconstructError
// 0x0010 (0x0010 - 0x0000)
struct ModioErrorCodeLibrary_ReconstructError final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Category;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioErrorCode                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioErrorCodeLibrary_ReconstructError;

// Function Modio.ModioErrorConditionLibrary.ErrorCodeMatches
// 0x0010 (0x0010 - 0x0000)
struct ModioErrorConditionLibrary_ErrorCodeMatches final
{
public:
	struct FModioErrorCode                        ErrorCode;                                         // 0x0000(0x0008)(Parm, NativeAccessSpecifierPublic)
	EModioErrorCondition                          Condition;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioErrorConditionLibrary_ErrorCodeMatches;

// Function Modio.ModioExampleLibrary.GetAvatarThumbnailSize
// 0x0001 (0x0001 - 0x0000)
struct ModioExampleLibrary_GetAvatarThumbnailSize final
{
public:
	EModioAvatarSize                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioExampleLibrary_GetAvatarThumbnailSize;

// Function Modio.ModioExampleLibrary.GetLogoFullSize
// 0x0001 (0x0001 - 0x0000)
struct ModioExampleLibrary_GetLogoFullSize final
{
public:
	EModioLogoSize                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioExampleLibrary_GetLogoFullSize;

// Function Modio.ModioExampleLibrary.GetLogoThumbnailSize
// 0x0001 (0x0001 - 0x0000)
struct ModioExampleLibrary_GetLogoThumbnailSize final
{
public:
	EModioLogoSize                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioExampleLibrary_GetLogoThumbnailSize;

// Function Modio.ModioExampleLibrary.ListUserSubscriptionAsync
// 0x00C8 (0x00C8 - 0x0000)
struct ModioExampleLibrary_ListUserSubscriptionAsync final
{
public:
	struct FModioFilterParams                     FilterParams;                                      // 0x0000(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FModioErrorCode& ErrorCode, const struct FModioOptionalModInfoList& Result)> Callback; // 0x00B8(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioExampleLibrary_ListUserSubscriptionAsync;

// Function Modio.ModioPresetFilterParamsLibrary.ToFilterParams
// 0x0100 (0x0100 - 0x0000)
struct ModioPresetFilterParamsLibrary_ToFilterParams final
{
public:
	struct FModioPresetFilterParams               Preset;                                            // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x0048(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioPresetFilterParamsLibrary_ToFilterParams;

// Function Modio.ModioFilterParamsLibrary.DisallowMatureContent
// 0x0170 (0x0170 - 0x0000)
struct ModioFilterParamsLibrary_DisallowMatureContent final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00B8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_DisallowMatureContent;

// Function Modio.ModioFilterParamsLibrary.ExcludingIDs
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_ExcludingIDs final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FModioModID>                    IDs;                                               // 0x00B8(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_ExcludingIDs;

// Function Modio.ModioFilterParamsLibrary.IndexedResults
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_IndexedResults final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         StartIndex;                                        // 0x00B8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ResultCount;                                       // 0x00C0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_IndexedResults;

// Function Modio.ModioFilterParamsLibrary.MarkedLiveAfter
// 0x0178 (0x0178 - 0x0000)
struct ModioFilterParamsLibrary_MarkedLiveAfter final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDateTime                              LiveAfter;                                         // 0x00B8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C0(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_MarkedLiveAfter;

// Function Modio.ModioFilterParamsLibrary.MarkedLiveBefore
// 0x0178 (0x0178 - 0x0000)
struct ModioFilterParamsLibrary_MarkedLiveBefore final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDateTime                              LiveBefore;                                        // 0x00B8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C0(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_MarkedLiveBefore;

// Function Modio.ModioFilterParamsLibrary.MatchingAuthor
// 0x0178 (0x0178 - 0x0000)
struct ModioFilterParamsLibrary_MatchingAuthor final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioUserID                           ID;                                                // 0x00B8(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C0(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_MatchingAuthor;

// Function Modio.ModioFilterParamsLibrary.MatchingAuthors
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_MatchingAuthors final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FModioUserID>                   IDs;                                               // 0x00B8(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_MatchingAuthors;

// Function Modio.ModioFilterParamsLibrary.MatchingIDs
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_MatchingIDs final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FModioModID>                    IDs;                                               // 0x00B8(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_MatchingIDs;

// Function Modio.ModioFilterParamsLibrary.MetadataLike
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_MetadataLike final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 SearchString;                                      // 0x00B8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_MetadataLike;

// Function Modio.ModioFilterParamsLibrary.NameContains
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_NameContains final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 SearchString;                                      // 0x00B8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_NameContains;

// Function Modio.ModioFilterParamsLibrary.NameContainsStrings
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_NameContainsStrings final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         SearchStrings;                                     // 0x00B8(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_NameContainsStrings;

// Function Modio.ModioFilterParamsLibrary.PagedResults
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_PagedResults final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         PageNumber;                                        // 0x00B8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         PageSize;                                          // 0x00C0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_PagedResults;

// Function Modio.ModioFilterParamsLibrary.RevenueType
// 0x0178 (0x0178 - 0x0000)
struct ModioFilterParamsLibrary_RevenueType final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EModioRevenueFilterType                       RevenueType_0;                                     // 0x00B8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C0(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_RevenueType;

// Function Modio.ModioFilterParamsLibrary.SortBy
// 0x0178 (0x0178 - 0x0000)
struct ModioFilterParamsLibrary_SortBy final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EModioSortFieldType                           ByField;                                           // 0x00B8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioSortDirection                           ByDirection;                                       // 0x00B9(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C0(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_SortBy;

// Function Modio.ModioFilterParamsLibrary.WithMatureContentFlags
// 0x0178 (0x0178 - 0x0000)
struct ModioFilterParamsLibrary_WithMatureContentFlags final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ByMaturity;                                        // 0x00B8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C0(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_WithMatureContentFlags;

// Function Modio.ModioFilterParamsLibrary.WithoutTag
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_WithoutTag final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Tag;                                               // 0x00B8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_WithoutTag;

// Function Modio.ModioFilterParamsLibrary.WithoutTags
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_WithoutTags final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         NewTags;                                           // 0x00B8(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_WithoutTags;

// Function Modio.ModioFilterParamsLibrary.WithTag
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_WithTag final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Tag;                                               // 0x00B8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFilterParams                     ReturnValue;                                       // 0x00C8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioFilterParamsLibrary_WithTag;

// Function Modio.ModioFilterParamsLibrary.WithTags
// 0x0180 (0x0180 - 0x0000)
struct ModioFilterParamsLibrary_WithTags final
{
public:
	struct FModioFilterParams                     Filter;                                            // 0x0000(0x00B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
