#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModioEx

#include "Basic.hpp"

#include "Modio_structs.hpp"
#include "ModioEx_structs.hpp"


namespace SDK::Params
{

// Function ModioEx.ModioSubmissionExtensionLibrary.K2_LoadModFileToMemory
// 0x0028 (0x0028 - 0x0000)
struct ModioSubmissionExtensionLibrary_K2_LoadModFileToMemory final
{
public:
	class UModioSubsystem*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioModID                            ModId;                                             // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ModData;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ModioSubmissionExtensionLibrary_K2_LoadModFileToMemory;

// Function ModioEx.ModioSubmissionExtensionLibrary.K2_SubmitNewModFileForModFromMemory
// 0x0070 (0x0070 - 0x0000)
struct ModioSubmissionExtensionLibrary_K2_SubmitNewModFileForModFromMemory final
{
public:
	class UModioSubsystem*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioModID                            Mod;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioCreateModFileMemoryParams        Params_0;                                          // 0x0010(0x0060)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioSubmissionExtensionLibrary_K2_SubmitNewModFileForModFromMemory;

// Function ModioEx.ModioSubmissionExtensionLibrary.K2_SubmitNewModFromMemoryAsync
// 0x00F0 (0x00F0 - 0x0000)
struct ModioSubmissionExtensionLibrary_K2_SubmitNewModFromMemoryAsync final
{
public:
	struct FModioModCreationHandle                Handle;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FModioCreateModParams                  Params_0;                                          // 0x0008(0x00C8)(Parm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 PngData;                                           // 0x00D0(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FModioErrorCode& ErrorCode, const struct FModioOptionalModID& NewModID)> Callback; // 0x00E0(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioSubmissionExtensionLibrary_K2_SubmitNewModFromMemoryAsync;

// Function ModioEx.ModioSubmissionExtensionLibrary.K2_SubmitModChangesFromMemoryAsync
// 0x00F8 (0x00F8 - 0x0000)
struct ModioSubmissionExtensionLibrary_K2_SubmitModChangesFromMemoryAsync final
{
public:
	struct FModioModID                            Mod;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioEditModParams                    Params_0;                                          // 0x0008(0x00D0)(Parm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 PngData;                                           // 0x00D8(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FModioErrorCode& ErrorCode, const struct FModioOptionalModInfo& ModInfo)> Callback; // 0x00E8(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ModioSubmissionExtensionLibrary_K2_SubmitModChangesFromMemoryAsync;

}

