#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"
#include "MovieRenderPipelineCore_structs.hpp"
#include "StructUtils_structs.hpp"
#include "OpenColorIO_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class MovieRenderPipelineCore.MovieGraphBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FFrameRate GetEffectiveFrameRate(class UMovieGraphOutputSettingNode* InNode, const struct FFrameRate& InDefaultRate);
	static struct FIntPoint GetEffectiveOutputResolution(class UMovieGraphEvaluatedConfig* InEvaluatedGraph, const class FName& InBranchName);
	static class FString ResolveFilenameFormatArguments(const class FString& InFormatString, const struct FMovieGraphFilenameResolveParams& InParams, struct FMovieGraphResolveArgs* OutMergedFormatArgs);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphBlueprintLibrary")
	}
	static class UMovieGraphBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UMovieGraphBlueprintLibrary;

// Class MovieRenderPipelineCore.MovieGraphNode
// 0x0068 (0x0090 - 0x0028)
class UMovieGraphNode : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieGraphPin*>                 InputPins;                                         // 0x0040(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UMovieGraphPin*>                 OutputPins;                                        // 0x0050(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FInstancedPropertyBag                  DynamicProperties;                                 // 0x0060(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMovieGraphPropertyInfo>        ExposedPropertyInfo;                               // 0x0070(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphNode")
	}
	static class UMovieGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphNode;

// Class MovieRenderPipelineCore.MovieGraphBranchNode
// 0x0000 (0x0090 - 0x0090)
class UMovieGraphBranchNode final : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphBranchNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphBranchNode")
	}
	static class UMovieGraphBranchNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBranchNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphBranchNode;

// Class MovieRenderPipelineCore.MoviePipelineQueue
// 0x0040 (0x0068 - 0x0028)
class UMoviePipelineQueue final : public UObject
{
public:
	TArray<class UMoviePipelineExecutorJob*>      Jobs;                                              // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMoviePipelineQueue>     QueueOrigin;                                       // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMoviePipelineExecutorJob* AllocateNewJob(TSubclassOf<class UMoviePipelineExecutorJob> InJobType);
	void CopyFrom(class UMoviePipelineQueue* InQueue);
	void DeleteAllJobs();
	void DeleteJob(class UMoviePipelineExecutorJob* InJob);
	class UMoviePipelineExecutorJob* DuplicateJob(class UMoviePipelineExecutorJob* InJob);
	void SetJobIndex(class UMoviePipelineExecutorJob* InJob, int32 Index_0);
	void SetQueueOrigin(class UMoviePipelineQueue* InConfig);

	TArray<class UMoviePipelineExecutorJob*> GetJobs() const;
	class UMoviePipelineQueue* GetQueueOrigin() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoviePipelineQueue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoviePipelineQueue")
	}
	static class UMoviePipelineQueue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineQueue>();
	}
};
DUMPER7_ASSERTS_UMoviePipelineQueue;

// Class MovieRenderPipelineCore.MovieGraphSettingNode
// 0x0000 (0x0090 - 0x0090)
class UMovieGraphSettingNode : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphSettingNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphSettingNode")
	}
	static class UMovieGraphSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSettingNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphSettingNode;

// Class MovieRenderPipelineCore.MovieGraphRenderPassNode
// 0x0000 (0x0090 - 0x0090)
class UMovieGraphRenderPassNode : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphRenderPassNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphRenderPassNode")
	}
	static class UMovieGraphRenderPassNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRenderPassNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphRenderPassNode;

// Class MovieRenderPipelineCore.MovieGraphBurnInNode
// 0x00F0 (0x0180 - 0x0090)
class UMovieGraphBurnInNode final : public UMovieGraphRenderPassNode
{
public:
	uint8                                         bOverride_BurnInClass : 1;                         // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bCompositeOntoFinalImage : 1;            // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         BurnInClass;                                       // 0x0098(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompositeOntoFinalImage;                          // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x67];                                      // 0x00B9(0x0067)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UClass*, class UMovieGraphBurnInWidget*> BurnInWidgetInstances;                       // 0x0120(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_170[0x10];                                     // 0x0170(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphBurnInNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphBurnInNode")
	}
	static class UMovieGraphBurnInNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphBurnInNode;

// Class MovieRenderPipelineCore.MovieGraphBurnInWidget
// 0x0000 (0x02C8 - 0x02C8)
class UMovieGraphBurnInWidget final : public UUserWidget
{
public:
	void UpdateForGraph(class UMovieGraphPipeline* InGraphPipeline);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphBurnInWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphBurnInWidget")
	}
	static class UMovieGraphBurnInWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInWidget>();
	}
};
DUMPER7_ASSERTS_UMovieGraphBurnInWidget;

// Class MovieRenderPipelineCore.MoviePipelineSetting
// 0x0020 (0x0048 - 0x0028)
class UMoviePipelineSetting : public UObject
{
public:
	TWeakObjectPtr<class UMoviePipeline>          CachedPipeline;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x17];                                      // 0x0031(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIsEnabled(bool bInEnabled);

	void BuildNewProcessCommandLine(class FString& InOutUnrealURLParams, class FString& InOutCommandLineArgs) const;
	void BuildNewProcessCommandLineArgs(TArray<class FString>& InOutUnrealURLParams, TArray<class FString>& InOutCommandLineArgs, TArray<class FString>& InOutDeviceProfileCvars, TArray<class FString>& InOutExecCmds) const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoviePipelineSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoviePipelineSetting")
	}
	static class UMoviePipelineSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineSetting>();
	}
};
DUMPER7_ASSERTS_UMoviePipelineSetting;

// Class MovieRenderPipelineCore.MoviePipelineOutputBase
// 0x0000 (0x0048 - 0x0048)
class UMoviePipelineOutputBase : public UMoviePipelineSetting
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoviePipelineOutputBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoviePipelineOutputBase")
	}
	static class UMoviePipelineOutputBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineOutputBase>();
	}
};
DUMPER7_ASSERTS_UMoviePipelineOutputBase;

// Class MovieRenderPipelineCore.MoviePipelineVideoOutputBase
// 0x0048 (0x0090 - 0x0048)
class UMoviePipelineVideoOutputBase final : public UMoviePipelineOutputBase
{
public:
	uint8                                         Pad_48[0x48];                                      // 0x0048(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoviePipelineVideoOutputBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoviePipelineVideoOutputBase")
	}
	static class UMoviePipelineVideoOutputBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineVideoOutputBase>();
	}
};
DUMPER7_ASSERTS_UMoviePipelineVideoOutputBase;

// Class MovieRenderPipelineCore.MovieGraphCollectionNode
// 0x0020 (0x00B0 - 0x0090)
class UMovieGraphCollectionNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_CollectionName : 1;                      // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_QueryClass : 1;                          // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CollectionName;                                    // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineCollectionQuery*          QueryClass;                                        // 0x00A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphCollectionNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphCollectionNode")
	}
	static class UMovieGraphCollectionNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCollectionNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphCollectionNode;

// Class MovieRenderPipelineCore.MovieGraphValueContainer
// 0x0010 (0x0038 - 0x0028)
class UMovieGraphValueContainer : public UObject
{
public:
	struct FInstancedPropertyBag                  Value;                                             // 0x0028(0x0010)(Edit, NativeAccessSpecifierPrivate)

public:
	class FString GetValueSerializedString();
	bool SetValueBool(const bool bInValue);
	bool SetValueByte(const uint8 InValue);
	bool SetValueClass(class UClass* InValue);
	void SetValueContainerType(EMovieGraphContainerType ContainerType);
	bool SetValueDouble(const double InValue);
	bool SetValueEnum(const uint8 InValue, const class UEnum* Enum);
	bool SetValueFloat(const float InValue);
	bool SetValueInt32(const int32 InValue);
	bool SetValueInt64(const int64 InValue);
	bool SetValueName(const class FName InValue);
	bool SetValueObject(class UObject* InValue);
	bool SetValueSerializedString(const class FString& NewValue);
	bool SetValueString(const class FString& InValue);
	bool SetValueText(const class FText& InValue);
	void SetValueType(EMovieGraphValueType ValueType);
	void SetValueTypeObject(const class UObject* ValueTypeObject);

	bool GetValueBool(bool* bOutValue) const;
	bool GetValueByte(uint8* OutValue) const;
	bool GetValueClass(class UClass* OutValue) const;
	EMovieGraphContainerType GetValueContainerType() const;
	bool GetValueDouble(double* OutValue) const;
	bool GetValueEnum(uint8* OutValue, const class UEnum* RequestedEnum) const;
	bool GetValueFloat(float* OutValue) const;
	bool GetValueInt32(int32* OutValue) const;
	bool GetValueInt64(int64* OutValue) const;
	bool GetValueName(class FName* OutValue) const;
	bool GetValueObject(class UObject* OutValue, const class UClass* RequestedClass) const;
	bool GetValueString(class FString* OutValue) const;
	bool GetValueText(class FText* OutValue) const;
	EMovieGraphValueType GetValueType() const;
	const class UObject* GetValueTypeObject() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphValueContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphValueContainer")
	}
	static class UMovieGraphValueContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphValueContainer>();
	}
};
DUMPER7_ASSERTS_UMovieGraphValueContainer;

// Class MovieRenderPipelineCore.MovieGraphMember
// 0x0038 (0x0070 - 0x0038)
class UMovieGraphMember : public UMovieGraphValueContainer
{
public:
	class FString                                 Description;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0048(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEditable;                                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphMember")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphMember")
	}
	static class UMovieGraphMember* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphMember>();
	}
};
DUMPER7_ASSERTS_UMovieGraphMember;

// Class MovieRenderPipelineCore.MovieGraphVariable
// 0x0008 (0x0078 - 0x0070)
class UMovieGraphVariable final : public UMovieGraphMember
{
public:
	bool                                          bIsGlobal;                                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphVariable")
	}
	static class UMovieGraphVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphVariable>();
	}
};
DUMPER7_ASSERTS_UMovieGraphVariable;

// Class MovieRenderPipelineCore.MovieGraphInterfaceBase
// 0x0008 (0x0078 - 0x0070)
class UMovieGraphInterfaceBase : public UMovieGraphMember
{
public:
	bool                                          bIsBranch;                                         // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphInterfaceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphInterfaceBase")
	}
	static class UMovieGraphInterfaceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInterfaceBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphInterfaceBase;

// Class MovieRenderPipelineCore.MovieGraphInput
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphInput final : public UMovieGraphInterfaceBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphInput")
	}
	static class UMovieGraphInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInput>();
	}
};
DUMPER7_ASSERTS_UMovieGraphInput;

// Class MovieRenderPipelineCore.MovieGraphOutput
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphOutput final : public UMovieGraphInterfaceBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphOutput")
	}
	static class UMovieGraphOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphOutput>();
	}
};
DUMPER7_ASSERTS_UMovieGraphOutput;

// Class MovieRenderPipelineCore.MovieGraphEvaluatedConfig
// 0x0050 (0x0078 - 0x0028)
class UMovieGraphEvaluatedConfig final : public UObject
{
public:
	TMap<class FName, struct FMovieGraphEvaluatedBranchConfig> BranchConfigMapping;                  // 0x0028(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphEvaluatedConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphEvaluatedConfig")
	}
	static class UMovieGraphEvaluatedConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEvaluatedConfig>();
	}
};
DUMPER7_ASSERTS_UMovieGraphEvaluatedConfig;

// Class MovieRenderPipelineCore.MovieGraphConfig
// 0x0050 (0x0078 - 0x0028)
class UMovieGraphConfig final : public UObject
{
public:
	TArray<class UMovieGraphNode*>                AllNodes;                                          // 0x0028(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UMovieGraphNode*                        InputNode;                                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphNode*                        OutputNode;                                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMovieGraphVariable*>            Variables;                                         // 0x0048(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphInput*>               Inputs;                                            // 0x0058(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphOutput*>              Outputs;                                           // 0x0068(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	class UMovieGraphVariable* AddVariable(const class FName InCustomBaseName);
	class UMovieGraphEvaluatedConfig* CreateFlattenedGraph(const struct FMovieGraphTraversalContext& InContext);

	TArray<class UMovieGraphVariable*> GetVariables(const bool bIncludeGlobal) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphConfig")
	}
	static class UMovieGraphConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConfig>();
	}
};
DUMPER7_ASSERTS_UMovieGraphConfig;

// Class MovieRenderPipelineCore.MovieGraphTimeStepBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphTimeStepBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphTimeStepBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphTimeStepBase")
	}
	static class UMovieGraphTimeStepBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphTimeStepBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphTimeStepBase;

// Class MovieRenderPipelineCore.MovieGraphRendererBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphRendererBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphRendererBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphRendererBase")
	}
	static class UMovieGraphRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRendererBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphRendererBase;

// Class MovieRenderPipelineCore.MovieGraphDataSourceBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphDataSourceBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphDataSourceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphDataSourceBase")
	}
	static class UMovieGraphDataSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDataSourceBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphDataSourceBase;

// Class MovieRenderPipelineCore.MovieGraphDefaultRenderer
// 0x0188 (0x01B0 - 0x0028)
class UMovieGraphDefaultRenderer final : public UMovieGraphRendererBase
{
public:
	TArray<class UMovieGraphRenderPassNode*>      RenderPassesInUse;                                 // 0x0028(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x178];                                     // 0x0038(0x0178)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphDefaultRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphDefaultRenderer")
	}
	static class UMovieGraphDefaultRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDefaultRenderer>();
	}
};
DUMPER7_ASSERTS_UMovieGraphDefaultRenderer;

// Class MovieRenderPipelineCore.MovieGraphDeferredRenderPassNode
// 0x0010 (0x00A0 - 0x0090)
class UMovieGraphDeferredRenderPassNode final : public UMovieGraphRenderPassNode
{
public:
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphDeferredRenderPassNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphDeferredRenderPassNode")
	}
	static class UMovieGraphDeferredRenderPassNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDeferredRenderPassNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphDeferredRenderPassNode;

// Class MovieRenderPipelineCore.MovieGraphEdge
// 0x0010 (0x0038 - 0x0028)
class UMovieGraphEdge final : public UObject
{
public:
	class UMovieGraphPin*                         InputPin;                                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieGraphPin*                         OutputPin;                                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphEdge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphEdge")
	}
	static class UMovieGraphEdge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEdge>();
	}
};
DUMPER7_ASSERTS_UMovieGraphEdge;

// Class MovieRenderPipelineCore.MovieGraphFileOutputNode
// 0x0000 (0x0090 - 0x0090)
class UMovieGraphFileOutputNode : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphFileOutputNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphFileOutputNode")
	}
	static class UMovieGraphFileOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphFileOutputNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphFileOutputNode;

// Class MovieRenderPipelineCore.MovieGraphGetCVarValueNode
// 0x0018 (0x00A8 - 0x0090)
class UMovieGraphGetCVarValueNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_Name : 1;                                // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphGetCVarValueNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphGetCVarValueNode")
	}
	static class UMovieGraphGetCVarValueNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGetCVarValueNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphGetCVarValueNode;

// Class MovieRenderPipelineCore.MovieGraphGlobalGameOverridesNode
// 0x0030 (0x00C0 - 0x0090)
class UMovieGraphGlobalGameOverridesNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_GameModeOverride : 1;                    // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CinematicQualitySettings : 1;            // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_TextureStreaming : 1;                    // 0x0090(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UseLODZero : 1;                          // 0x0090(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DisableHLODs : 1;                        // 0x0090(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UseHighQualityShadows : 1;               // 0x0090(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ShadowDistanceScale : 1;                 // 0x0090(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ShadowRadiusThreshold : 1;               // 0x0090(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OverrideViewDistanceScale : 1;           // 0x0091(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ViewDistanceScale : 1;                   // 0x0091(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FlushGrassStreaming : 1;                 // 0x0091(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FlushStreamingManagers : 1;              // 0x0091(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VirtualTextureFeedbackFactor : 1;        // 0x0091(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DisableGPUTimeout : 1;                   // 0x0091(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AGameModeBase>              GameModeOverride;                                  // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCinematicQualitySettings;                         // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePipelineTextureStreamingMethod          TextureStreaming;                                  // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLODZero;                                       // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableHLODs;                                     // 0x00A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighQualityShadows;                            // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ShadowDistanceScale;                               // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowRadiusThreshold;                             // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ViewDistanceScale;                                 // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlushGrassStreaming;                              // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlushStreamingManagers;                           // 0x00B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VirtualTextureFeedbackFactor;                      // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphGlobalGameOverridesNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphGlobalGameOverridesNode")
	}
	static class UMovieGraphGlobalGameOverridesNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalGameOverridesNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphGlobalGameOverridesNode;

// Class MovieRenderPipelineCore.MovieGraphImageSequenceOutputNode
// 0x0020 (0x00B0 - 0x0090)
class UMovieGraphImageSequenceOutputNode : public UMovieGraphFileOutputNode
{
public:
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphImageSequenceOutputNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphImageSequenceOutputNode")
	}
	static class UMovieGraphImageSequenceOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphImageSequenceOutputNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphImageSequenceOutputNode;

// Class MovieRenderPipelineCore.MovieGraphImageSequenceOutputNode_BMP
// 0x0000 (0x00B0 - 0x00B0)
class UMovieGraphImageSequenceOutputNode_BMP final : public UMovieGraphImageSequenceOutputNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphImageSequenceOutputNode_BMP")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphImageSequenceOutputNode_BMP")
	}
	static class UMovieGraphImageSequenceOutputNode_BMP* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphImageSequenceOutputNode_BMP>();
	}
};
DUMPER7_ASSERTS_UMovieGraphImageSequenceOutputNode_BMP;

// Class MovieRenderPipelineCore.MovieGraphImageSequenceOutputNode_JPG
// 0x0000 (0x00B0 - 0x00B0)
class UMovieGraphImageSequenceOutputNode_JPG final : public UMovieGraphImageSequenceOutputNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphImageSequenceOutputNode_JPG")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphImageSequenceOutputNode_JPG")
	}
	static class UMovieGraphImageSequenceOutputNode_JPG* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphImageSequenceOutputNode_JPG>();
	}
};
DUMPER7_ASSERTS_UMovieGraphImageSequenceOutputNode_JPG;

// Class MovieRenderPipelineCore.MovieGraphImageSequenceOutputNode_PNG
// 0x0000 (0x00B0 - 0x00B0)
class UMovieGraphImageSequenceOutputNode_PNG final : public UMovieGraphImageSequenceOutputNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphImageSequenceOutputNode_PNG")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphImageSequenceOutputNode_PNG")
	}
	static class UMovieGraphImageSequenceOutputNode_PNG* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphImageSequenceOutputNode_PNG>();
	}
};
DUMPER7_ASSERTS_UMovieGraphImageSequenceOutputNode_PNG;

// Class MovieRenderPipelineCore.MovieGraphInputNode
// 0x0000 (0x0090 - 0x0090)
class UMovieGraphInputNode final : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphInputNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphInputNode")
	}
	static class UMovieGraphInputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInputNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphInputNode;

// Class MovieRenderPipelineCore.MovieGraphLinearTimeStep
// 0x0118 (0x0140 - 0x0028)
class UMovieGraphLinearTimeStep final : public UMovieGraphTimeStepBase
{
public:
	struct FMovieGraphTimeStepData                CurrentTimeStepData;                               // 0x0028(0x0020)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0xE8];                                      // 0x0048(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieGraphEngineTimeStep*              CustomTimeStep;                                    // 0x0130(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEngineCustomTimeStep*                  PrevCustomTimeStep;                                // 0x0138(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphLinearTimeStep")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphLinearTimeStep")
	}
	static class UMovieGraphLinearTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphLinearTimeStep>();
	}
};
DUMPER7_ASSERTS_UMovieGraphLinearTimeStep;

// Class MovieRenderPipelineCore.MovieGraphEngineTimeStep
// 0x0010 (0x0038 - 0x0028)
class UMovieGraphEngineTimeStep final : public UEngineCustomTimeStep
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphEngineTimeStep")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphEngineTimeStep")
	}
	static class UMovieGraphEngineTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEngineTimeStep>();
	}
};
DUMPER7_ASSERTS_UMovieGraphEngineTimeStep;

// Class MovieRenderPipelineCore.MovieGraphModifierNode
// 0x0030 (0x00C0 - 0x0090)
class UMovieGraphModifierNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_ModifierName : 1;                        // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ModifiedCollectionName : 1;              // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ModifierClass : 1;                       // 0x0090(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ModifierName;                                      // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ModifiedCollectionName;                            // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineCollectionModifier*       ModifierClass;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphModifierNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphModifierNode")
	}
	static class UMovieGraphModifierNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphModifierNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphModifierNode;

// Class MovieRenderPipelineCore.MovieGraphOutputNode
// 0x0000 (0x0090 - 0x0090)
class UMovieGraphOutputNode final : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphOutputNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphOutputNode")
	}
	static class UMovieGraphOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphOutputNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphOutputNode;

// Class MovieRenderPipelineCore.MovieGraphOutputSettingNode
// 0x0048 (0x00D8 - 0x0090)
class UMovieGraphOutputSettingNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_OutputDirectory : 1;                     // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FileNameFormat : 1;                      // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OutputResolution : 1;                    // 0x0090(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OutputFrameRate : 1;                     // 0x0090(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bOverwriteExistingOutput : 1;            // 0x0090(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ZeroPadFrameNumbers : 1;                 // 0x0090(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FrameNumberOffset : 1;                   // 0x0090(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         OutputDirectory;                                   // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileNameFormat;                                    // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              OutputResolution;                                  // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             OutputFrameRate;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverwriteExistingOutput;                          // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ZeroPadFrameNumbers;                               // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameNumberOffset;                                 // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphOutputSettingNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphOutputSettingNode")
	}
	static class UMovieGraphOutputSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphOutputSettingNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphOutputSettingNode;

// Class MovieRenderPipelineCore.MovieGraphPin
// 0x0028 (0x0050 - 0x0028)
class UMovieGraphPin final : public UObject
{
public:
	class UMovieGraphNode*                        Node;                                              // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieGraphPinProperties               Properties;                                        // 0x0030(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieGraphEdge*>                Edges;                                             // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphPin")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphPin")
	}
	static class UMovieGraphPin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphPin>();
	}
};
DUMPER7_ASSERTS_UMovieGraphPin;

// Class MovieRenderPipelineCore.MoviePipelineBase
// 0x0030 (0x0058 - 0x0028)
class UMoviePipelineBase : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RequestShutdown(bool bIsError);
	void Shutdown(bool bIsError);

	EMovieRenderPipelineState GetPipelineState() const;
	bool IsShutdownRequested() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoviePipelineBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoviePipelineBase")
	}
	static class UMoviePipelineBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineBase>();
	}
};
DUMPER7_ASSERTS_UMoviePipelineBase;

// Class MovieRenderPipelineCore.MovieGraphPipeline
// 0x00D8 (0x0130 - 0x0058)
class UMovieGraphPipeline final : public UMoviePipelineBase
{
public:
	class UMovieGraphTimeStepBase*                GraphTimeStepInstance;                             // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphRendererBase*                GraphRendererInstance;                             // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphDataSourceBase*              GraphDataSourceInstance;                           // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoviePipelineExecutorJob*              CurrentJob;                                        // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMoviePipelineExecutorShot*>     ActiveShotList;                                    // 0x0078(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<class UMovieGraphFileOutputNode*>        OutputNodesDataSentTo;                             // 0x0088(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x58];                                      // 0x00D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize(class UMoviePipelineExecutorJob* InJob, const struct FMovieGraphInitConfig& InitConfig);
	void OnMoviePipelineFinishedImpl();
	void SetInitializationTime(const struct FDateTime& InDateTime);

	class UMoviePipelineExecutorJob* GetCurrentJob() const;
	struct FDateTime GetInitializationTime() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphPipeline")
	}
	static class UMovieGraphPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphPipeline>();
	}
};
DUMPER7_ASSERTS_UMovieGraphPipeline;

// Class MovieRenderPipelineCore.MovieGraphPathTracedRendererNode
// 0x0000 (0x0090 - 0x0090)
class UMovieGraphPathTracedRendererNode final : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphPathTracedRendererNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphPathTracedRendererNode")
	}
	static class UMovieGraphPathTracedRendererNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphPathTracedRendererNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphPathTracedRendererNode;

// Class MovieRenderPipelineCore.MovieGraphEXRSequenceNode
// 0x0000 (0x0090 - 0x0090)
class UMovieGraphEXRSequenceNode final : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphEXRSequenceNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphEXRSequenceNode")
	}
	static class UMovieGraphEXRSequenceNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEXRSequenceNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphEXRSequenceNode;

// Class MovieRenderPipelineCore.MovieGraphAntiAliasingNode
// 0x0000 (0x0090 - 0x0090)
class UMovieGraphAntiAliasingNode final : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphAntiAliasingNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphAntiAliasingNode")
	}
	static class UMovieGraphAntiAliasingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphAntiAliasingNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphAntiAliasingNode;

// Class MovieRenderPipelineCore.MovieGraphRenderLayerNode
// 0x0018 (0x00A8 - 0x0090)
class UMovieGraphRenderLayerNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_LayerName : 1;                           // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LayerName;                                         // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphRenderLayerNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphRenderLayerNode")
	}
	static class UMovieGraphRenderLayerNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRenderLayerNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphRenderLayerNode;

// Class MovieRenderPipelineCore.MovieGraphSelectNode
// 0x0030 (0x00C0 - 0x0090)
class UMovieGraphSelectNode final : public UMovieGraphNode
{
public:
	TArray<class FString>                         SelectOptions;                                     // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SelectedOption;                                    // 0x00A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphSelectNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphSelectNode")
	}
	static class UMovieGraphSelectNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSelectNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphSelectNode;

// Class MovieRenderPipelineCore.MovieGraphSequenceDataSource
// 0x0018 (0x0040 - 0x0028)
class UMovieGraphSequenceDataSource final : public UMovieGraphDataSourceBase
{
public:
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphSequenceDataSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphSequenceDataSource")
	}
	static class UMovieGraphSequenceDataSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSequenceDataSource>();
	}
};
DUMPER7_ASSERTS_UMovieGraphSequenceDataSource;

// Class MovieRenderPipelineCore.MovieGraphSetCVarValueNode
// 0x0028 (0x00B8 - 0x0090)
class UMovieGraphSetCVarValueNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_Name : 1;                                // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_Value : 1;                               // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphSetCVarValueNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphSetCVarValueNode")
	}
	static class UMovieGraphSetCVarValueNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSetCVarValueNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphSetCVarValueNode;

// Class MovieRenderPipelineCore.MovieGraphSubgraphNode
// 0x0028 (0x00B8 - 0x0090)
class UMovieGraphSubgraphNode final : public UMovieGraphNode
{
public:
	TSoftObjectPtr<class UMovieGraphConfig>       SubgraphAsset;                                     // 0x0090(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetSubGraphAsset(const TSoftObjectPtr<class UMovieGraphConfig>& InSubgraphAsset);

	class UMovieGraphConfig* GetSubgraphAsset() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphSubgraphNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphSubgraphNode")
	}
	static class UMovieGraphSubgraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSubgraphNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphSubgraphNode;

// Class MovieRenderPipelineCore.MovieGraphVariableNode
// 0x0018 (0x00A8 - 0x0090)
class UMovieGraphVariableNode final : public UMovieGraphNode
{
public:
	class UMovieGraphVariable*                    GraphVariable;                                     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieGraphPinProperties               OutputPin;                                         // 0x0098(0x000C)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphVariableNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphVariableNode")
	}
	static class UMovieGraphVariableNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphVariableNode>();
	}
