#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectPooler

#include "Basic.hpp"


namespace SDK
{

// Enum ObjectPooler.EObjectPoolRetrieveActorResult
// NumValues: 0x0003
enum class EObjectPoolRetrieveActorResult : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	EObjectPoolRetrieveActorResult_MAX       = 2,
};

// Enum ObjectPooler.EObjectPoolReuseSetting
// NumValues: 0x0004
enum class EObjectPoolReuseSetting : uint8
{
	Reuse                                    = 0,
	DoNotReuse                               = 1,
	CreateNewActor                           = 2,
	EObjectPoolReuseSetting_MAX              = 3,
};

// ScriptStruct ObjectPooler.PlatformPoolSettings
// 0x000C (0x000C - 0x0000)
struct FPlatformPoolSettings final
{
public:
	int32                                         PoolSize;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActorMaxLifetime;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectPoolReuseSetting                       ReuseSetting;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReturnToPoolAfterPhysicsHit;                      // 0x0009(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPlatformPoolSettings;

// ScriptStruct ObjectPooler.ObjectPoolWarmUpSetting
// 0x0008 (0x0008 - 0x0000)
struct FObjectPoolWarmUpSetting final
{
public:
	uint8                                         bEnabled : 1;                                      // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        WarmUpAcross;                                      // 0x0002(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FObjectPoolWarmUpSetting;

// ScriptStruct ObjectPooler.ObjectPoolManager
// 0x0038 (0x0038 - 0x0000)
struct FObjectPoolManager final
{
public:
	uint8                                         bEnabled : 1;                                      // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ManagerName;                                       // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UObjectPoolBase>>    ObjectPools;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class FText                                   Note;                                              // 0x0020(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FObjectPoolManager;

}

