#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectPooler

#include "Basic.hpp"

#include "ObjectPooler_structs.hpp"


namespace SDK::Params
{

// Function ObjectPooler.AsyncRetrieveActorFromPool.AsyncRetrieveActorFromPool
// 0x0018 (0x0018 - 0x0000)
struct AsyncRetrieveActorFromPool_AsyncRetrieveActorFromPool final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObjectPoolBase*                        InObjectPool;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncRetrieveActorFromPool*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncRetrieveActorFromPool_AsyncRetrieveActorFromPool;

// Function ObjectPooler.AsyncRetrieveActorFromPool_Comp.AsyncRetrieveActorFromPool_Component
// 0x0018 (0x0018 - 0x0000)
struct AsyncRetrieveActorFromPool_Comp_AsyncRetrieveActorFromPool_Component final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObjectPoolComponent*                   InObjectPoolComponent;                             // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncRetrieveActorFromPool_Comp*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncRetrieveActorFromPool_Comp_AsyncRetrieveActorFromPool_Component;

// Function ObjectPooler.ObjectPoolBase.AddActorToPool
// 0x0008 (0x0008 - 0x0000)
struct ObjectPoolBase_AddActorToPool final
{
public:
	class APooledActor*                           NewPooledActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolBase_AddActorToPool;

// Function ObjectPooler.ObjectPoolBase.GetActorFromPool
// 0x0010 (0x0010 - 0x0000)
struct ObjectPoolBase_GetActorFromPool final
{
public:
	EObjectPoolRetrieveActorResult                Results;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APooledActor*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolBase_GetActorFromPool;

// Function ObjectPooler.ObjectPoolBase.AreAllActorsInUse
// 0x0001 (0x0001 - 0x0000)
struct ObjectPoolBase_AreAllActorsInUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolBase_AreAllActorsInUse;

// Function ObjectPooler.ObjectPoolBase.GetPooledActors
// 0x0010 (0x0010 - 0x0000)
struct ObjectPoolBase_GetPooledActors final
{
public:
	TArray<class APooledActor*>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolBase_GetPooledActors;

// Function ObjectPooler.ObjectPoolBase.GetPoolName
// 0x0008 (0x0008 - 0x0000)
struct ObjectPoolBase_GetPoolName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolBase_GetPoolName;

// Function ObjectPooler.ObjectPoolBase.GetPoolSize
// 0x0004 (0x0004 - 0x0000)
struct ObjectPoolBase_GetPoolSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolBase_GetPoolSize;

// Function ObjectPooler.ObjectPoolBase.GetReuseSetting
// 0x0001 (0x0001 - 0x0000)
struct ObjectPoolBase_GetReuseSetting final
{
public:
	EObjectPoolReuseSetting                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolBase_GetReuseSetting;

// Function ObjectPooler.ObjectPoolBase.IsPoolEmpty
// 0x0001 (0x0001 - 0x0000)
struct ObjectPoolBase_IsPoolEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolBase_IsPoolEmpty;

// Function ObjectPooler.ObjectPoolBase.IsWarmUpComplete
// 0x0001 (0x0001 - 0x0000)
struct ObjectPoolBase_IsWarmUpComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolBase_IsWarmUpComplete;

// Function ObjectPooler.ObjectPoolComponent.AddActorToPool
// 0x0008 (0x0008 - 0x0000)
struct ObjectPoolComponent_AddActorToPool final
{
public:
	class APooledActor*                           NewPooledActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolComponent_AddActorToPool;

// Function ObjectPooler.ObjectPoolComponent.GetActorFromPool
// 0x0010 (0x0010 - 0x0000)
struct ObjectPoolComponent_GetActorFromPool final
{
public:
	EObjectPoolRetrieveActorResult                Results;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APooledActor*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolComponent_GetActorFromPool;

// Function ObjectPooler.ObjectPoolComponent.AreAllActorsInUse
// 0x0001 (0x0001 - 0x0000)
struct ObjectPoolComponent_AreAllActorsInUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolComponent_AreAllActorsInUse;

// Function ObjectPooler.ObjectPoolComponent.GetPoolName
// 0x0008 (0x0008 - 0x0000)
struct ObjectPoolComponent_GetPoolName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolComponent_GetPoolName;

// Function ObjectPooler.ObjectPoolComponent.GetPoolSize
// 0x0004 (0x0004 - 0x0000)
struct ObjectPoolComponent_GetPoolSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolComponent_GetPoolSize;

// Function ObjectPooler.ObjectPoolComponent.IsPoolEmpty
// 0x0001 (0x0001 - 0x0000)
struct ObjectPoolComponent_IsPoolEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolComponent_IsPoolEmpty;

// Function ObjectPooler.ObjectPoolComponent.IsWarmUpComplete
// 0x0001 (0x0001 - 0x0000)
struct ObjectPoolComponent_IsWarmUpComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolComponent_IsWarmUpComplete;

// Function ObjectPooler.ObjectPoolFunctionLibrary.DoesObjectPoolExist
// 0x000C (0x000C - 0x0000)
struct ObjectPoolFunctionLibrary_DoesObjectPoolExist final
{
public:
	class FName                                   PoolName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_DoesObjectPoolExist;

// Function ObjectPooler.ObjectPoolFunctionLibrary.GetActivePooledActorCount
// 0x0010 (0x0010 - 0x0000)
struct ObjectPoolFunctionLibrary_GetActivePooledActorCount final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_GetActivePooledActorCount;

// Function ObjectPooler.ObjectPoolFunctionLibrary.GetAllObjectPoolClassesFromManager
// 0x0018 (0x0018 - 0x0000)
struct ObjectPoolFunctionLibrary_GetAllObjectPoolClassesFromManager final
{
public:
	class FName                                   ManagerName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UObjectPoolBase>>    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_GetAllObjectPoolClassesFromManager;

// Function ObjectPooler.ObjectPoolFunctionLibrary.GetAllObjectPools
// 0x0018 (0x0018 - 0x0000)
struct ObjectPoolFunctionLibrary_GetAllObjectPools final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObjectPoolBase*>                ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_GetAllObjectPools;

// Function ObjectPooler.ObjectPoolFunctionLibrary.GetNumOfObjectPoolsInWorld
// 0x0010 (0x0010 - 0x0000)
struct ObjectPoolFunctionLibrary_GetNumOfObjectPoolsInWorld final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_GetNumOfObjectPoolsInWorld;

// Function ObjectPooler.ObjectPoolFunctionLibrary.GetObjectPool
// 0x0018 (0x0018 - 0x0000)
struct ObjectPoolFunctionLibrary_GetObjectPool final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PoolName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObjectPoolBase*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_GetObjectPool;

// Function ObjectPooler.ObjectPoolFunctionLibrary.GetPooledActorCount
// 0x0010 (0x0010 - 0x0000)
struct ObjectPoolFunctionLibrary_GetPooledActorCount final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_GetPooledActorCount;

// Function ObjectPooler.ObjectPoolFunctionLibrary.GetUnactivePooledActorCount
// 0x0010 (0x0010 - 0x0000)
struct ObjectPoolFunctionLibrary_GetUnactivePooledActorCount final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_GetUnactivePooledActorCount;

// Function ObjectPooler.ObjectPoolFunctionLibrary.IsActorInUse
// 0x0010 (0x0010 - 0x0000)
struct ObjectPoolFunctionLibrary_IsActorInUse final
{
public:
	class APooledActor*                           InPooledActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_IsActorInUse;

// Function ObjectPooler.ObjectPoolFunctionLibrary.MarkActorInUse
// 0x0008 (0x0008 - 0x0000)
struct ObjectPoolFunctionLibrary_MarkActorInUse final
{
public:
	class APooledActor*                           InPooledActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_MarkActorInUse;

// Function ObjectPooler.ObjectPoolFunctionLibrary.MarkActorNotInUse
// 0x0008 (0x0008 - 0x0000)
struct ObjectPoolFunctionLibrary_MarkActorNotInUse final
{
public:
	class APooledActor*                           InPooledActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ObjectPoolFunctionLibrary_MarkActorNotInUse;

// Function ObjectPooler.PooledActor.MarkInUse
// 0x0001 (0x0001 - 0x0000)
struct PooledActor_MarkInUse final
{
public:
	bool                                          bBroadcast;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PooledActor_MarkInUse;

// Function ObjectPooler.PooledActor.MarkNotInUse
// 0x0001 (0x0001 - 0x0000)
struct PooledActor_MarkNotInUse final
{
public:
	bool                                          bBroadcast;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PooledActor_MarkNotInUse;

// Function ObjectPooler.PooledActor.SetActive
// 0x0001 (0x0001 - 0x0000)
struct PooledActor_SetActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PooledActor_SetActive;

// Function ObjectPooler.PooledActor.IsInUse
// 0x0001 (0x0001 - 0x0000)
struct PooledActor_IsInUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PooledActor_IsInUse;

// Function ObjectPooler.PooledActor.IsNotInUse
// 0x0001 (0x0001 - 0x0000)
struct PooledActor_IsNotInUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PooledActor_IsNotInUse;

}

