#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectPooler

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ObjectPooler_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ObjectPooler.AsyncRetrieveActorFromPool
// 0x0020 (0x0050 - 0x0030)
class UAsyncRetrieveActorFromPool final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UObjectPoolBase* ObjectPool, class APooledActor* RetrievedActor, bool bSuccess)> Completed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObjectPoolBase*                        ObjectPool;                                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APooledActor*                           RetrievedActor;                                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAsyncRetrieveActorFromPool* AsyncRetrieveActorFromPool(class UObject* WorldContextObject, class UObjectPoolBase* InObjectPool);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncRetrieveActorFromPool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncRetrieveActorFromPool")
	}
	static class UAsyncRetrieveActorFromPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncRetrieveActorFromPool>();
	}
};
DUMPER7_ASSERTS_UAsyncRetrieveActorFromPool;

// Class ObjectPooler.AsyncRetrieveActorFromPool_Comp
// 0x0020 (0x0050 - 0x0030)
class UAsyncRetrieveActorFromPool_Comp final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UObjectPoolComponent* ObjectPool, class APooledActor* RetrievedActor, bool bSuccess)> Completed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObjectPoolComponent*                   ObjectPoolComponent;                               // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APooledActor*                           RetrievedActor;                                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAsyncRetrieveActorFromPool_Comp* AsyncRetrieveActorFromPool_Component(class UObject* WorldContextObject, class UObjectPoolComponent* InObjectPoolComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncRetrieveActorFromPool_Comp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncRetrieveActorFromPool_Comp")
	}
	static class UAsyncRetrieveActorFromPool_Comp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncRetrieveActorFromPool_Comp>();
	}
};
DUMPER7_ASSERTS_UAsyncRetrieveActorFromPool_Comp;

// Class ObjectPooler.ObjectPoolBase
// 0x00A8 (0x00D0 - 0x0028)
class UObjectPoolBase : public UObject
{
public:
	TMulticastInlineDelegate<void(class UObjectPoolBase* PoolOwner, class APooledActor* Actor)> OnActorRetrievedFromPool; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObjectPoolBase* PoolOwner, class APooledActor* Actor)> OnActorReturnedToPool; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                   OwningManagerName;                                 // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PoolName;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PoolSize;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EObjectPoolReuseSetting                       ReuseSetting;                                      // 0x005C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class APooledActor>               ObjectClassToPool;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bFillPoolOnBeginPlay : 1;                          // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_69[0x1];                                       // 0x0069(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FObjectPoolWarmUpSetting               WarmUp;                                            // 0x006A(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlatformPoolSettings                  PS4;                                               // 0x0074(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FPlatformPoolSettings                  PS5;                                               // 0x0080(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FPlatformPoolSettings                  XBoxOne;                                           // 0x008C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FPlatformPoolSettings                  XboxSeries;                                        // 0x0098(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APooledActor*>                   PooledActors;                                      // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddActorToPool(class APooledActor* NewPooledActor);
	void EmptyPool();
	void FillPool();
	class APooledActor* GetActorFromPool(EObjectPoolRetrieveActorResult* Results);

	bool AreAllActorsInUse() const;
	TArray<class APooledActor*> GetPooledActors() const;
	class FName GetPoolName() const;
	int32 GetPoolSize() const;
	EObjectPoolReuseSetting GetReuseSetting() const;
	bool IsPoolEmpty() const;
	bool IsWarmUpComplete() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectPoolBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectPoolBase")
	}
	static class UObjectPoolBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectPoolBase>();
	}
};
DUMPER7_ASSERTS_UObjectPoolBase;

// Class ObjectPooler.ObjectPoolComponent
// 0x0070 (0x0110 - 0x00A0)
class UObjectPoolComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(class UObjectPoolComponent* PoolOwner, class APooledActor* Actor)> OnActorRetrievedFromPool; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObjectPoolComponent* PoolOwner, class APooledActor* Actor)> OnActorReturnedToPool; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                   PoolName;                                          // 0x00C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PoolSize;                                          // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectPoolReuseSetting                       ReuseSetting;                                      // 0x00CC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class APooledActor>               ObjectClassToPool;                                 // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bFillPoolOnBeginPlay : 1;                          // 0x00D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_D9[0x1];                                       // 0x00D9(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FObjectPoolWarmUpSetting               WarmUp;                                            // 0x00DA(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APooledActor*>                   PooledActors;                                      // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x18];                                      // 0x00F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddActorToPool(class APooledActor* NewPooledActor);
	void EmptyPool();
	void FillPool();
	class APooledActor* GetActorFromPool(EObjectPoolRetrieveActorResult* Results);

	bool AreAllActorsInUse() const;
	class FName GetPoolName() const;
	int32 GetPoolSize() const;
	bool IsPoolEmpty() const;
	bool IsWarmUpComplete() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectPoolComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectPoolComponent")
	}
	static class UObjectPoolComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectPoolComponent>();
	}
};
DUMPER7_ASSERTS_UObjectPoolComponent;

// Class ObjectPooler.ObjectPoolerSettings
// 0x0010 (0x0038 - 0x0028)
class UObjectPoolerSettings final : public UObject
{
public:
	TArray<struct FObjectPoolManager>             ObjectPoolManagers;                                // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectPoolerSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectPoolerSettings")
	}
	static class UObjectPoolerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectPoolerSettings>();
	}
};
DUMPER7_ASSERTS_UObjectPoolerSettings;

// Class ObjectPooler.ObjectPoolerWorldSubsystem
// 0x0028 (0x0058 - 0x0030)
class UObjectPoolerWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnObjectPoolsInitialized;                          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UObjectPoolBase*>                ObjectPools;                                       // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void DestroyObjectPools();
	void InitializeObjectPools();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectPoolerWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectPoolerWorldSubsystem")
	}
	static class UObjectPoolerWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectPoolerWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UObjectPoolerWorldSubsystem;

// Class ObjectPooler.ObjectPoolFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UObjectPoolFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DestroyAllObjectPools();
	static bool DoesObjectPoolExist(class FName PoolName);
	static int32 GetActivePooledActorCount(class UObject* WorldContext);
	static TArray<TSubclassOf<class UObjectPoolBase>> GetAllObjectPoolClassesFromManager(class FName ManagerName);
	static TArray<class UObjectPoolBase*> GetAllObjectPools(class UObject* WorldContext);
	static int32 GetNumOfObjectPoolsInWorld(class UObject* WorldContext);
	static class UObjectPoolBase* GetObjectPool(class UObject* WorldContext, class FName PoolName);
	static int32 GetPooledActorCount(class UObject* WorldContext);
	static int32 GetUnactivePooledActorCount(class UObject* WorldContext);
	static bool IsActorInUse(class APooledActor* InPooledActor);
	static void MarkActorInUse(class APooledActor* InPooledActor);
	static void MarkActorNotInUse(class APooledActor* InPooledActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectPoolFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectPoolFunctionLibrary")
	}
	static class UObjectPoolFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectPoolFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UObjectPoolFunctionLibrary;

// Class ObjectPooler.PooledActor
// 0x0048 (0x02E0 - 0x0298)
class APooledActor : public AActor
{
public:
	TMulticastInlineDelegate<void(class APooledActor* PooledActor)> InUse;                           // 0x0298(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APooledActor* PooledActor)> NotInUse;                        // 0x02A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         MaxLifespan;                                       // 0x02B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEverAllowTick : 1;                                // 0x02BC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEverAllowCollisions : 1;                          // 0x02BC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReturnToPoolAfterPhysicsHit : 1;                  // 0x02BC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bInUse : 1;                                        // 0x02BC(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedTime;                                       // 0x02C0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectPoolBase*                        PoolOwner;                                         // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObjectPoolComponent*                   PoolOwner_Component;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateAllComponents();
	void DeactivateAllComponents();
	void MarkInUse(bool bBroadcast);
	void MarkNotInUse(bool bBroadcast);
	void OnLifeSpanExpired();
	void PooledActor_BeginPlay();
	void PooledActor_EndPlay();
	void SetActive(bool bActive);

	bool IsInUse() const;
	bool IsNotInUse() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PooledActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PooledActor")
	}
	static class APooledActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APooledActor>();
	}
};
DUMPER7_ASSERTS_APooledActor;

}

