#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptitrackNatnet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum OptitrackNatnet.EOptitrackTimestampType
// NumValues: 0x0005
enum class EOptitrackTimestampType : uint8
{
	Unknown                                  = 0,
	LocalArrivalTime                         = 1,
	ServerAggregationTime                    = 2,
	ServerExposureTime                       = 3,
	EOptitrackTimestampType_MAX              = 4,
};

// Enum OptitrackNatnet.EOptitrackClientConnectionType
// NumValues: 0x0003
enum class EOptitrackClientConnectionType : uint8
{
	Multicast                                = 0,
	Unicast                                  = 1,
	EOptitrackClientConnectionType_MAX       = 2,
};

// Enum OptitrackNatnet.EOptitrackForwardAxisType
// NumValues: 0x0003
enum class EOptitrackForwardAxisType : uint8
{
	Z_Positive                               = 0,
	X_Positive                               = 1,
	EOptitrackForwardAxisType_MAX            = 2,
};

// Enum OptitrackNatnet.EOptitrackBoneNamingConvention
// NumValues: 0x0004
enum class EOptitrackBoneNamingConvention : uint8
{
	Motive                                   = 0,
	FBX                                      = 1,
	BVH                                      = 2,
	EOptitrackBoneNamingConvention_MAX       = 3,
};

// Enum OptitrackNatnet.EOptitrackBone
// NumValues: 0x0036
enum class EOptitrackBone : uint8
{
	Root                                     = 0,
	Hip                                      = 1,
	Ab                                       = 2,
	Chest                                    = 3,
	Neck                                     = 4,
	Head                                     = 5,
	LShoulder                                = 6,
	LUArm                                    = 7,
	LFArm                                    = 8,
	LHand                                    = 9,
	RShoulder                                = 10,
	RUArm                                    = 11,
	RFArm                                    = 12,
	RHand                                    = 13,
	LThigh                                   = 14,
	LShin                                    = 15,
	LFoot                                    = 16,
	LToe                                     = 17,
	RThigh                                   = 18,
	RShin                                    = 19,
	RFoot                                    = 20,
	RToe                                     = 21,
	LThumb1                                  = 22,
	LThumb2                                  = 23,
	LThumb3                                  = 24,
	LIndex1                                  = 25,
	LIndex2                                  = 26,
	LIndex3                                  = 27,
	LMiddle1                                 = 28,
	LMiddle2                                 = 29,
	LMiddle3                                 = 30,
	LRing1                                   = 31,
	LRing2                                   = 32,
	LRing3                                   = 33,
	LPinky1                                  = 34,
	LPinky2                                  = 35,
	LPinky3                                  = 36,
	RThumb1                                  = 37,
	RThumb2                                  = 38,
	RThumb3                                  = 39,
	RIndex1                                  = 40,
	RIndex2                                  = 41,
	RIndex3                                  = 42,
	RMiddle1                                 = 43,
	RMiddle2                                 = 44,
	RMiddle3                                 = 45,
	RRing1                                   = 46,
	RRing2                                   = 47,
	RRing3                                   = 48,
	RPinky1                                  = 49,
	RPinky2                                  = 50,
	RPinky3                                  = 51,
	NumBones                                 = 52,
	EOptitrackBone_MAX                       = 53,
};

// ScriptStruct OptitrackNatnet.AnimNode_OptitrackSkeleton
// 0x0A80 (0x0A90 - 0x0010)
struct alignas(0x10) FAnimNode_OptitrackSkeleton final : public FAnimNode_Base
{
public:
	class USkeletalMesh*                          RetargetBaseMesh;                                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBoneSocketTarget>              BoneSockets;                                       // 0x0018(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SourceSkeletonAssetName;                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOptitrackClientOrigin*                 StreamingClientOrigin;                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ScaleBones;                                        // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PoseCorrection;                                    // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RollBoneInterpolation;                             // 0x004A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RollBoneBlending;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FingerRotationOnly;                                // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               SkeletonBaseRotation;                              // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          UseTranslationCorrection;                          // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSpineInterpolation;                             // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThumbBaseRotation;                                 // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0xA00];                                     // 0x0078(0x0A00)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     RetargetBasePose;                                  // 0x0A78(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A88[0x8];                                      // 0x0A88(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_OptitrackSkeleton;

// ScriptStruct OptitrackNatnet.OptitrackRigidBodyState
// 0x0040 (0x0040 - 0x0000)
struct FOptitrackRigidBodyState final
{
public:
	double                                        TimestampPlatformSeconds;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  Orientation;                                       // 0x0020(0x0020)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOptitrackRigidBodyState;

// ScriptStruct OptitrackNatnet.OptitrackMarkerState
// 0x0028 (0x0028 - 0x0000)
struct FOptitrackMarkerState final
{
public:
	double                                        TimestampPlatformSeconds;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOptitrackMarkerState;

// ScriptStruct OptitrackNatnet.OptitrackCamera
// 0x0040 (0x0040 - 0x0000)
struct FOptitrackCamera final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  Orientation;                                       // 0x0020(0x0020)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOptitrackCamera;

// ScriptStruct OptitrackNatnet.OptitrackPose
// 0x0040 (0x0040 - 0x0000)
struct FOptitrackPose final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Orientation;                                       // 0x0020(0x0020)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOptitrackPose;

// ScriptStruct OptitrackNatnet.OptitrackBoneDefinition
// 0x0028 (0x0028 - 0x0000)
struct FOptitrackBoneDefinition final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParentID;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalOffset;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOptitrackBoneDefinition;

// ScriptStruct OptitrackNatnet.OptitrackSkeletonDefinition
// 0x0060 (0x0060 - 0x0000)
struct FOptitrackSkeletonDefinition final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FOptitrackBoneDefinition>  Bones;                                             // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOptitrackSkeletonDefinition;

// ScriptStruct OptitrackNatnet.OptitrackSkeletonState
// 0x00F0 (0x00F0 - 0x0000)
struct FOptitrackSkeletonState final
{
public:
	TMap<int32, struct FOptitrackPose>            BonePoses;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, struct FTransform>                WorldSpaceBoneTransforms;                          // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, struct FTransform>                LocalBoneSpaceTransforms;                          // 0x00A0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOptitrackSkeletonState;

}

