#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptitrackNatnet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OptitrackNatnet_structs.hpp"


namespace SDK::Params
{

// Function OptitrackNatnet.OptitrackClientOrigin.FindDefaultClientOrigin
// 0x0010 (0x0010 - 0x0000)
struct OptitrackClientOrigin_FindDefaultClientOrigin final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOptitrackClientOrigin*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OptitrackClientOrigin_FindDefaultClientOrigin;

// Function OptitrackNatnet.OptitrackClientOrigin.FindHmdClientOrigin
// 0x0010 (0x0010 - 0x0000)
struct OptitrackClientOrigin_FindHmdClientOrigin final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOptitrackClientOrigin*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OptitrackClientOrigin_FindHmdClientOrigin;

// Function OptitrackNatnet.OptitrackClientOrigin.GetDataDescription
// 0x0001 (0x0001 - 0x0000)
struct OptitrackClientOrigin_GetDataDescription final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OptitrackClientOrigin_GetDataDescription;

// Function OptitrackNatnet.OptitrackClientOrigin.GetLatestMarkerState
// 0x0038 (0x0038 - 0x0000)
struct OptitrackClientOrigin_GetLatestMarkerState final
{
public:
	int32                                         markerId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOptitrackMarkerState                  OutMarkerState;                                    // 0x0008(0x0028)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OptitrackClientOrigin_GetLatestMarkerState;

// Function OptitrackNatnet.OptitrackClientOrigin.GetLatestMarkerStateUntransformed
// 0x0038 (0x0038 - 0x0000)
struct OptitrackClientOrigin_GetLatestMarkerStateUntransformed final
{
public:
	int32                                         markerId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOptitrackMarkerState                  OutMarkerState;                                    // 0x0008(0x0028)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OptitrackClientOrigin_GetLatestMarkerStateUntransformed;

// Function OptitrackNatnet.OptitrackClientOrigin.GetLatestRigidBodyState
// 0x0060 (0x0060 - 0x0000)
struct OptitrackClientOrigin_GetLatestRigidBodyState final
{
public:
	int32                                         RbId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOptitrackRigidBodyState               OutRbState;                                        // 0x0010(0x0040)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          networkCompensation;                               // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0051(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0xE];                                       // 0x0052(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OptitrackClientOrigin_GetLatestRigidBodyState;

// Function OptitrackNatnet.OptitrackClientOrigin.GetLatestRigidBodyStateUntransformed
// 0x0060 (0x0060 - 0x0000)
struct OptitrackClientOrigin_GetLatestRigidBodyStateUntransformed final
{
public:
	int32                                         RbId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOptitrackRigidBodyState               OutRbStat;                                         // 0x0010(0x0040)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          networkCompensation;                               // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0051(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0xE];                                       // 0x0052(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OptitrackClientOrigin_GetLatestRigidBodyStateUntransformed;

// Function OptitrackNatnet.OptitrackClientOrigin.GetLatestSkeletonState
// 0x0100 (0x0100 - 0x0000)
struct OptitrackClientOrigin_GetLatestSkeletonState final
{
public:
	int32                                         SkelId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOptitrackSkeletonState                OutSkelState;                                      // 0x0008(0x00F0)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OptitrackClientOrigin_GetLatestSkeletonState;

// Function OptitrackNatnet.OptitrackClientOrigin.GetLatestSkeletonStateByName
// 0x0100 (0x0100 - 0x0000)
struct OptitrackClientOrigin_GetLatestSkeletonStateByName final
{
public:
	class FName                                   SkelName;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptitrackSkeletonState                OutSkelState;                                      // 0x0008(0x00F0)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OptitrackClientOrigin_GetLatestSkeletonStateByName;

// Function OptitrackNatnet.OptitrackClientOrigin.InitializeClient
// 0x0001 (0x0001 - 0x0000)
struct OptitrackClientOrigin_InitializeClient final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OptitrackClientOrigin_InitializeClient;

// Function OptitrackNatnet.OptitrackClientOrigin.ShutdownClient
// 0x0001 (0x0001 - 0x0000)
struct OptitrackClientOrigin_ShutdownClient final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OptitrackClientOrigin_ShutdownClient;

// Function OptitrackNatnet.OptitrackClientOrigin.FindSkeletonDefinition
// 0x0070 (0x0070 - 0x0000)
struct OptitrackClientOrigin_FindSkeletonDefinition final
{
public:
	class FName                                   SkeletonName;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptitrackSkeletonDefinition           OutSkelDef;                                        // 0x0008(0x0060)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OptitrackClientOrigin_FindSkeletonDefinition;

// Function OptitrackNatnet.OptitrackClientOrigin.GetLatestTimecode
// 0x0018 (0x0018 - 0x0000)
struct OptitrackClientOrigin_GetLatestTimecode final
{
public:
	struct FTimecode                              OutTimecode;                                       // 0x0000(0x0014)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OptitrackClientOrigin_GetLatestTimecode;

// Function OptitrackNatnet.OptitrackClientOrigin.GetTimestampType
// 0x0001 (0x0001 - 0x0000)
struct OptitrackClientOrigin_GetTimestampType final
{
public:
	EOptitrackTimestampType                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OptitrackClientOrigin_GetTimestampType;

// Function OptitrackNatnet.OptitrackClientOrigin.IsClientConnected
// 0x0001 (0x0001 - 0x0000)
struct OptitrackClientOrigin_IsClientConnected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OptitrackClientOrigin_IsClientConnected;

// Function OptitrackNatnet.OptitrackClientOrigin.IsClientInitialized
// 0x0001 (0x0001 - 0x0000)
struct OptitrackClientOrigin_IsClientInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OptitrackClientOrigin_IsClientInitialized;

}

