#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Primary_B1301

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Primary_B1301.Primary_B1301_C
// 0x0050 (0x1A60 - 0x1A10)
class APrimary_B1301_C final : public AShotgun
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UShellRackShellComponent*               Shell6;                                            // 0x1A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell5;                                            // 0x1A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell4;                                            // 0x1A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell3;                                            // 0x1A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell2;                                            // 0x1A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell1;                                            // 0x1A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell0;                                            // 0x1A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           LightToggle1P;                                     // 0x1A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Primary_B1301(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Primary_B1301_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Primary_B1301_C")
	}
	static class APrimary_B1301_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrimary_B1301_C>();
	}
};
DUMPER7_ASSERTS_APrimary_B1301_C;

}

