#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Primary_Benelli_M4

#include "Basic.hpp"

#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Primary_Benelli_M4.Primary_Benelli_M4_C
// 0x0040 (0x1960 - 0x1920)
class APrimary_Benelli_M4_C final : public AShotgun
{
public:
	class UShellRackShellComponent*               Shell6;                                            // 0x1920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell5;                                            // 0x1928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell4;                                            // 0x1930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell3;                                            // 0x1938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell2;                                            // 0x1940(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell1;                                            // 0x1948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UShellRackShellComponent*               Shell0;                                            // 0x1950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           LightToggle1P;                                     // 0x1958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Primary_Benelli_M4_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Primary_Benelli_M4_C")
	}
	static class APrimary_Benelli_M4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrimary_Benelli_M4_C>();
	}
};
DUMPER7_ASSERTS_APrimary_Benelli_M4_C;

}

