#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Primary_S_MK18_VAR3_CMAG

#include "Basic.hpp"

#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Primary_S_MK18_VAR3_CMAG.Primary_S_MK18_VAR3_CMAG_C
// 0x0020 (0x19C0 - 0x19A0)
class APrimary_S_MK18_VAR3_CMAG_C final : public ABaseMagazineWeapon
{
public:
	uint8                                         Pad_1998[0x8];                                     // 0x1998(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USpotLightComponent*                    SpotLight;                                         // 0x19A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Light;                                             // 0x19A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Grip;                                              // 0x19B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Optic;                                             // 0x19B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Primary_S_MK18_VAR3_CMAG_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Primary_S_MK18_VAR3_CMAG_C")
	}
	static class APrimary_S_MK18_VAR3_CMAG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrimary_S_MK18_VAR3_CMAG_C>();
	}
};
DUMPER7_ASSERTS_APrimary_S_MK18_VAR3_CMAG_C;

}

