#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Projectile_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Projectile_Base.Projectile_Base_C.ExecuteUbergraph_Projectile_Base
// 0x00F8 (0x00F8 - 0x0000)
struct Projectile_Base_C_ExecuteUbergraph_Projectile_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_PlayEventAttached_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_DeflectionHit;                        // 0x0010(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Projectile_Base_C_ExecuteUbergraph_Projectile_Base;

// Function Projectile_Base.Projectile_Base_C.OnDeflect
// 0x00E8 (0x00E8 - 0x0000)
struct Projectile_Base_C_OnDeflect final
{
public:
	struct FHitResult                             DeflectionHit;                                     // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Projectile_Base_C_OnDeflect;

}

