#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReadyOrNotUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function ReadyOrNotUI.ReadyOrNotUI_C.BackPage
// 0x0001 (0x0001 - 0x0000)
struct ReadyOrNotUI_C_BackPage final
{
public:
	bool                                          Handled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ReadyOrNotUI_C_BackPage;

// Function ReadyOrNotUI.ReadyOrNotUI_C.ChangePage
// 0x0008 (0x0008 - 0x0000)
struct ReadyOrNotUI_C_ChangePage final
{
public:
	class FName                                   PageName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ReadyOrNotUI_C_ChangePage;

// Function ReadyOrNotUI.ReadyOrNotUI_C.Hide
// 0x0010 (0x0010 - 0x0000)
struct ReadyOrNotUI_C_Hide final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Collapse;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ReadyOrNotUI_C_Hide;

// Function ReadyOrNotUI.ReadyOrNotUI_C.Reveal
// 0x0008 (0x0008 - 0x0000)
struct ReadyOrNotUI_C_Reveal final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ReadyOrNotUI_C_Reveal;

// Function ReadyOrNotUI.ReadyOrNotUI_C.SetInputMode
// 0x0001 (0x0001 - 0x0000)
struct ReadyOrNotUI_C_SetInputMode final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ReadyOrNotUI_C_SetInputMode;

// Function ReadyOrNotUI.ReadyOrNotUI_C.GetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct ReadyOrNotUI_C_GetFocusTarget final
{
public:
	class UWidget*                                Focus;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ReadyOrNotUI_C_GetFocusTarget;

}

