#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSAuth

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "RedpointEOSAuth_structs.hpp"


namespace SDK
{

// Class RedpointEOSAuth.EOSDefaultUserInterface_EnterDevicePinCode
// 0x04D8 (0x07A0 - 0x02C8)
class alignas(0x10) UEOSDefaultUserInterface_EnterDevicePinCode final : public UUserWidget
{
public:
	uint8                                         Pad_2C8[0x418];                                    // 0x02C8(0x0418)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         TitleFont;                                         // 0x06E0(0x0058)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         RegularFont;                                       // 0x0738(0x0058)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEOSUserInterface_EnterDevicePinCode_Context* Context;                                     // 0x0790(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_798[0x8];                                      // 0x0798(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSDefaultUserInterface_EnterDevicePinCode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSDefaultUserInterface_EnterDevicePinCode")
	}
	static class UEOSDefaultUserInterface_EnterDevicePinCode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSDefaultUserInterface_EnterDevicePinCode>();
	}
};
DUMPER7_ASSERTS_UEOSDefaultUserInterface_EnterDevicePinCode;

// Class RedpointEOSAuth.EOSDefaultUserInterface_SignInOrCreateAccount
// 0x04B8 (0x0780 - 0x02C8)
class alignas(0x10) UEOSDefaultUserInterface_SignInOrCreateAccount final : public UUserWidget
{
public:
	uint8                                         Pad_2C8[0x3F8];                                    // 0x02C8(0x03F8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         TitleFont;                                         // 0x06C0(0x0058)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         RegularFont;                                       // 0x0718(0x0058)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEOSUserInterface_SignInOrCreateAccount_Context* Context;                                  // 0x0770(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_778[0x8];                                      // 0x0778(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSDefaultUserInterface_SignInOrCreateAccount")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSDefaultUserInterface_SignInOrCreateAccount")
	}
	static class UEOSDefaultUserInterface_SignInOrCreateAccount* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSDefaultUserInterface_SignInOrCreateAccount>();
	}
};
DUMPER7_ASSERTS_UEOSDefaultUserInterface_SignInOrCreateAccount;

// Class RedpointEOSAuth.EOSUserInterface_EnterDevicePinCode
// 0x0000 (0x0000 - 0x0000)
class IEOSUserInterface_EnterDevicePinCode final
{
public:
	void SetupUserInterface(class UEOSUserInterface_EnterDevicePinCode_Context* Context, const class FString& VerificationUrl, const class FString& PinCode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSUserInterface_EnterDevicePinCode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSUserInterface_EnterDevicePinCode")
	}
	static class IEOSUserInterface_EnterDevicePinCode* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEOSUserInterface_EnterDevicePinCode>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IEOSUserInterface_EnterDevicePinCode;

// Class RedpointEOSAuth.EOSUserInterface_EnterDevicePinCode_Context
// 0x0010 (0x0038 - 0x0028)
class UEOSUserInterface_EnterDevicePinCode_Context final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelLogin();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSUserInterface_EnterDevicePinCode_Context")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSUserInterface_EnterDevicePinCode_Context")
	}
	static class UEOSUserInterface_EnterDevicePinCode_Context* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSUserInterface_EnterDevicePinCode_Context>();
	}
};
DUMPER7_ASSERTS_UEOSUserInterface_EnterDevicePinCode_Context;

// Class RedpointEOSAuth.EOSUserInterface_SignInOrCreateAccount
// 0x0000 (0x0000 - 0x0000)
class IEOSUserInterface_SignInOrCreateAccount final
{
public:
	void SetupUserInterface(class UEOSUserInterface_SignInOrCreateAccount_Context* Context);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSUserInterface_SignInOrCreateAccount")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSUserInterface_SignInOrCreateAccount")
	}
	static class IEOSUserInterface_SignInOrCreateAccount* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEOSUserInterface_SignInOrCreateAccount>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IEOSUserInterface_SignInOrCreateAccount;

// Class RedpointEOSAuth.EOSUserInterface_SignInOrCreateAccount_Context
// 0x0010 (0x0038 - 0x0028)
class UEOSUserInterface_SignInOrCreateAccount_Context final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SelectChoice(EEOSUserInterface_SignInOrCreateAccount_Choice SelectedChoice);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSUserInterface_SignInOrCreateAccount_Context")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSUserInterface_SignInOrCreateAccount_Context")
	}
	static class UEOSUserInterface_SignInOrCreateAccount_Context* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSUserInterface_SignInOrCreateAccount_Context>();
	}
};
DUMPER7_ASSERTS_UEOSUserInterface_SignInOrCreateAccount_Context;

}

