#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSFramework

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "EnhancedInput_classes.hpp"


namespace SDK
{

// Class RedpointEOSFramework.RedpointEOSPartyMember
// 0x0040 (0x02D8 - 0x0298)
class ARedpointEOSPartyMember final : public AActor
{
public:
	uint8                                         Pad_298[0x38];                                     // 0x0298(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PartyMemberSlot;                                   // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PartyMemberChanged(const struct FRedpointEOSPartyMemberInfo& PartyMember);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointEOSPartyMember")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointEOSPartyMember")
	}
	static class ARedpointEOSPartyMember* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointEOSPartyMember>();
	}
};
DUMPER7_ASSERTS_ARedpointEOSPartyMember;

// Class RedpointEOSFramework.RedpointEOSStarterCharacter
// 0x0010 (0x0690 - 0x0680)
class ARedpointEOSStarterCharacter final : public ACharacter
{
public:
	class UStaticMeshComponent*                   Sphere;                                            // 0x0678(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       Camera;                                            // 0x0680(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointEOSStarterCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointEOSStarterCharacter")
	}
	static class ARedpointEOSStarterCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointEOSStarterCharacter>();
	}
};
DUMPER7_ASSERTS_ARedpointEOSStarterCharacter;

// Class RedpointEOSFramework.RedpointEOSStarterGameMode
// 0x0000 (0x0338 - 0x0338)
class ARedpointEOSStarterGameMode final : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointEOSStarterGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointEOSStarterGameMode")
	}
	static class ARedpointEOSStarterGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointEOSStarterGameMode>();
	}
};
DUMPER7_ASSERTS_ARedpointEOSStarterGameMode;

// Class RedpointEOSFramework.RedpointEOSStarterInputMappingContext
// 0x0000 (0x0058 - 0x0058)
class URedpointEOSStarterInputMappingContext final : public UInputMappingContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointEOSStarterInputMappingContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointEOSStarterInputMappingContext")
	}
	static class URedpointEOSStarterInputMappingContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointEOSStarterInputMappingContext>();
	}
};
DUMPER7_ASSERTS_URedpointEOSStarterInputMappingContext;

// Class RedpointEOSFramework.RedpointEOSStarterJumpAction
// 0x0000 (0x0080 - 0x0080)
class URedpointEOSStarterJumpAction final : public UInputAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointEOSStarterJumpAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointEOSStarterJumpAction")
	}
	static class URedpointEOSStarterJumpAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointEOSStarterJumpAction>();
	}
};
DUMPER7_ASSERTS_URedpointEOSStarterJumpAction;

// Class RedpointEOSFramework.RedpointEOSStarterMoveAction
// 0x0000 (0x0080 - 0x0080)
class URedpointEOSStarterMoveAction final : public UInputAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointEOSStarterMoveAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointEOSStarterMoveAction")
	}
	static class URedpointEOSStarterMoveAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointEOSStarterMoveAction>();
	}
};
DUMPER7_ASSERTS_URedpointEOSStarterMoveAction;

// Class RedpointEOSFramework.RedpointEOSStarterPlayerController
// 0x0080 (0x08D8 - 0x0858)
class ARedpointEOSStarterPlayerController final : public APlayerController
{
public:
	TSoftObjectPtr<class UInputAction>            MoveAction;                                        // 0x0858(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            JumpAction;                                        // 0x0880(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputMappingContext>    InputMappingContext;                               // 0x08A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipInputMappingContext;                          // 0x08D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D1[0x7];                                      // 0x08D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointEOSStarterPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointEOSStarterPlayerController")
	}
	static class ARedpointEOSStarterPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointEOSStarterPlayerController>();
	}
};
DUMPER7_ASSERTS_ARedpointEOSStarterPlayerController;

}

