#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSFramework

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum RedpointEOSFramework.ERedpointEOSPartyAttributeType
// NumValues: 0x0005
enum class ERedpointEOSPartyAttributeType : uint8
{
	String                                   = 0,
	Int64                                    = 1,
	Double                                   = 2,
	Bool                                     = 3,
	ERedpointEOSPartyAttributeType_MAX       = 4,
};

// ScriptStruct RedpointEOSFramework.RedpointEOSPartyAttributeValue
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FRedpointEOSPartyAttributeValue final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRedpointEOSPartyAttributeValue;

// ScriptStruct RedpointEOSFramework.RedpointEOSPartyMemberInfo
// 0x00E8 (0x00E8 - 0x0000)
struct FRedpointEOSPartyMemberInfo final
{
public:
	bool                                          bHasPartyMember;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerName;                                        // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            PlayerUserAttributes;                              // 0x0048(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FString, struct FRedpointEOSPartyAttributeValue> PartyMemberAttributes;               // 0x0098(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRedpointEOSPartyMemberInfo;

}

