#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoN_Station_LobbyGameMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RoN_Station_LobbyGameMode.RoN_Station_LobbyGameMode_C
// 0x0030 (0x1158 - 0x1128)
class ARoN_Station_LobbyGameMode_C final : public AReadyOrNotLevelScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<EObjectTypeQuery>                      Volume;                                            // 0x1130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          InsideArena;                                       // 0x1140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1141[0x7];                                     // 0x1141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFMODAmbientSound*                      Buzzer_End_ExecuteUbergraph_RoN_Station_LobbyGameMode_RefProperty; // 0x1148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFMODAmbientSound*                      Buzzer_End2_ExecuteUbergraph_RoN_Station_LobbyGameMode_RefProperty; // 0x1150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Is_Observable(class ABasePlayer_C* Base_Player, bool* Is_Observable_0);
	void ExecuteUbergraph_RoN_Station_LobbyGameMode(int32 EntryPoint);
	void BndEvt__RoN_Station_LobbyGameMode_Trigger_Safety02_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__RoN_Station_LobbyGameMode_Trigger_Safety01_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RoN_Station_LobbyGameMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoN_Station_LobbyGameMode_C")
	}
	static class ARoN_Station_LobbyGameMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoN_Station_LobbyGameMode_C>();
	}
};
DUMPER7_ASSERTS_ARoN_Station_LobbyGameMode_C;

}

