#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Secondary_Python_V2

#include "Basic.hpp"

#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Secondary_Python_V2.Secondary_Python_V2_C
// 0x0030 (0x18E0 - 0x18B0)
class ASecondary_Python_V2_C final : public ABaseMagazineWeapon
{
public:
	int32                                         BarrelIndex;                                       // 0x18B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B4[0x4];                                     // 0x18B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   FireMontagesEmpty;                                 // 0x18B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   FireMontages;                                      // 0x18C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCocked;                                           // 0x18D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Secondary_Python_V2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Secondary_Python_V2_C")
	}
	static class ASecondary_Python_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASecondary_Python_V2_C>();
	}
};
DUMPER7_ASSERTS_ASecondary_Python_V2_C;

}

