#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkinnedDecalComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SkinnedDecalComponent_structs.hpp"


namespace SDK
{

// Class SkinnedDecalComponent.SkinnedDecalInstance
// 0x0010 (0x02B0 - 0x02A0)
class USkinnedDecalInstance final : public USceneComponent
{
public:
	int32                                         Index_0;                                           // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubUV;                                             // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Size;                                              // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class USkinnedDecalSampler* GetSampler();
	void UpdateDecal();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SkinnedDecalInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkinnedDecalInstance")
	}
	static class USkinnedDecalInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkinnedDecalInstance>();
	}
};
DUMPER7_ASSERTS_USkinnedDecalInstance;

// Class SkinnedDecalComponent.SkinnedDecalSamplerSave
// 0x0078 (0x00A0 - 0x0028)
class USkinnedDecalSamplerSave final : public USaveGame
{
public:
	struct FSkinnedDecalSamplerState              SamplerState;                                      // 0x0028(0x0078)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SkinnedDecalSamplerSave")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkinnedDecalSamplerSave")
	}
	static class USkinnedDecalSamplerSave* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkinnedDecalSamplerSave>();
	}
};
DUMPER7_ASSERTS_USkinnedDecalSamplerSave;

// Class SkinnedDecalComponent.SkinnedDecalSampler
// 0x0148 (0x01E8 - 0x00A0)
class USkinnedDecalSampler final : public UActorComponent
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x00A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDecals;                                         // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDecalDistance;                                  // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkinnedDecalBlendMode                        BlendMode;                                         // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      OverlayBlendMaterial;                              // 0x00B8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerIndex;                                        // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialParameterAssociation                 Association;                                       // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkinnedDecalAdditionalData                   AdditionalData;                                    // 0x00E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       Materials;                                         // 0x00E8(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          EnableSaveGame;                                    // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USkinnedDecalInstance*, int32>     InstanceMap;                                       // 0x0100(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               OverlayBlendMaterialDynamic;                       // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMeshComponent*>         RenderMeshes;                                      // 0x0158(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 DataTarget;                                        // 0x0168(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSkinnedDecalSamplerState              SamplerState;                                      // 0x0170(0x0078)(NativeAccessSpecifierPrivate)

public:
	void AutoSetup();
	void ClearAllDecals();
	void CloneDecals(class USkinnedDecalSampler* Source);
	class UTextureRenderTarget2D* GetDataTarget();
	struct FSkinnedDecalSamplerState GetSamplerState();
	void LoadSampler(const class FString& SlotName, const int32 UserIndex);
	void RemoveDecal(const int32 Index_0);
	void SaveSampler(const class FString& SlotName, const int32 UserIndex);
	void SetMeshComponent(class USkeletalMeshComponent* MeshComponent, bool Child);
	void SetSamplerState(const struct FSkinnedDecalSamplerState& State);
	void SetupComponentMaterials(class USkeletalMeshComponent* Component);
	void SetupMaterials();
	int32 SpawnDecal(const struct FVector& Location, const struct FQuat& Rotation, class FName BoneName, float Size, int32 SubUV, int32 Index_0, bool bEnableDisplacement);
	void SpawnDecalFromData(const struct FSkinnedDecalData& Data);
	void UpdateAllDecals();
	void UpdateInstance(class USkinnedDecalInstance* Instance);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SkinnedDecalSampler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkinnedDecalSampler")
	}
	static class USkinnedDecalSampler* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkinnedDecalSampler>();
	}
};
DUMPER7_ASSERTS_USkinnedDecalSampler;

}

