#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkinnedDecalComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SkinnedDecalComponent.ESkinnedDecalAdditionalData
// NumValues: 0x0004
enum class ESkinnedDecalAdditionalData : uint8
{
	NoAdditionalData                         = 0,
	SpawnTime                                = 1,
	DecalBoneID                              = 2,
	ESkinnedDecalAdditionalData_MAX          = 3,
};

// Enum SkinnedDecalComponent.ESkinnedDecalBlendMode
// NumValues: 0x0003
enum class ESkinnedDecalBlendMode : uint8
{
	Overlay                                  = 0,
	Material                                 = 1,
	ESkinnedDecalBlendMode_MAX               = 2,
};

// ScriptStruct SkinnedDecalComponent.SkinnedDecalData
// 0x0090 (0x0090 - 0x0000)
struct FSkinnedDecalData final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DecalLocation;                                     // 0x0008(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BasisX;                                            // 0x0020(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BasisY;                                            // 0x0038(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BasisZ;                                            // 0x0050(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Info;                                              // 0x0070(0x0020)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSkinnedDecalData;

// ScriptStruct SkinnedDecalComponent.SkinnedDecalSamplerState
// 0x0078 (0x0078 - 0x0000)
struct FSkinnedDecalSamplerState final
{
public:
	TMap<int32, struct FSkinnedDecalData>         Decals;                                            // 0x0000(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        DecalLocations;                                    // 0x0050(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TArray<int32>                                 EmptyIndexes;                                      // 0x0060(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	int32                                         LastDecalIndex;                                    // 0x0070(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSkinnedDecalSamplerState;

}

