#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkinnedDecalComponent

#include "Basic.hpp"

#include "SkinnedDecalComponent_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SkinnedDecalComponent.SkinnedDecalInstance.GetSampler
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalInstance_GetSampler final
{
public:
	class USkinnedDecalSampler*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalInstance_GetSampler;

// Function SkinnedDecalComponent.SkinnedDecalSampler.CloneDecals
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalSampler_CloneDecals final
{
public:
	class USkinnedDecalSampler*                   Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_CloneDecals;

// Function SkinnedDecalComponent.SkinnedDecalSampler.GetDataTarget
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalSampler_GetDataTarget final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_GetDataTarget;

// Function SkinnedDecalComponent.SkinnedDecalSampler.GetSamplerState
// 0x0078 (0x0078 - 0x0000)
struct SkinnedDecalSampler_GetSamplerState final
{
public:
	struct FSkinnedDecalSamplerState              ReturnValue;                                       // 0x0000(0x0078)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_GetSamplerState;

// Function SkinnedDecalComponent.SkinnedDecalSampler.LoadSampler
// 0x0018 (0x0018 - 0x0000)
struct SkinnedDecalSampler_LoadSampler final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_LoadSampler;

// Function SkinnedDecalComponent.SkinnedDecalSampler.RemoveDecal
// 0x0004 (0x0004 - 0x0000)
struct SkinnedDecalSampler_RemoveDecal final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_RemoveDecal;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SaveSampler
// 0x0018 (0x0018 - 0x0000)
struct SkinnedDecalSampler_SaveSampler final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SaveSampler;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SetMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct SkinnedDecalSampler_SetMeshComponent final
{
public:
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Child;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SetMeshComponent;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SetSamplerState
// 0x0078 (0x0078 - 0x0000)
struct SkinnedDecalSampler_SetSamplerState final
{
public:
	struct FSkinnedDecalSamplerState              State;                                             // 0x0000(0x0078)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SetSamplerState;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SetupComponentMaterials
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalSampler_SetupComponentMaterials final
{
public:
	class USkeletalMeshComponent*                 Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SetupComponentMaterials;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SpawnDecal
// 0x0060 (0x0060 - 0x0000)
struct SkinnedDecalSampler_SpawnDecal final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0020(0x0020)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Size;                                              // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubUV;                                             // 0x004C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDisplacement;                               // 0x0054(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SpawnDecal;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SpawnDecalFromData
// 0x0090 (0x0090 - 0x0000)
struct SkinnedDecalSampler_SpawnDecalFromData final
{
public:
	struct FSkinnedDecalData                      Data;                                              // 0x0000(0x0090)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SpawnDecalFromData;

// Function SkinnedDecalComponent.SkinnedDecalSampler.UpdateInstance
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalSampler_UpdateInstance final
{
public:
	class USkinnedDecalInstance*                  Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_UpdateInstance;

}

