#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sound_GlobalConversationTrigger_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GlobalConversationTrigger_Master_Struct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Sound_GlobalConversationTrigger_BP.Sound_GlobalConversationTrigger_BP_C
// 0x01C0 (0x0460 - 0x02A0)
class ASound_GlobalConversationTrigger_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       SubtitleCollision;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TriggerZone;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    BillBoard;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        First_Trigger_Delay;                               // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Only_SWAT_Team_Can_Trigger;                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Specific_Character;                                // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Is_Triggered_On_Enter;                             // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Collision;                                         // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimatedConversation;                             // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class AActor>>          AnimatedCharactersToTrigger;                       // 0x02E8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FGlobalConversationTrigger_Master_Struct> Conversations_Master;                    // 0x02F8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          Can_Trigger_Additional_Conversations_After_Report; // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Conversation_Starter;                              // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Conversation_Delay_Time;                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Random_Conversation_;                              // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Max_Conversations;                                 // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ConversationSection;                               // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ConversationPreset;                                // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ConversationCounter;                               // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Current_Character;                                 // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   Current_Character_Speaker_Tag;                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGlobalConversationTrigger_Master_Struct Current_Conversation_Preset;                     // 0x0358(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class FString                                 Random_Bark;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   Character_Conversation_Trigger;                    // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Current_Conversation_Ended;                        // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AReadyOrNotCharacter*>           AllOverlappedCharacters;                           // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSoftObjectPtr<class AActor>                  Reportable_Soft_Pointer;                           // 0x03B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UFMODAudioComponent*                    StaticAudioComponent;                              // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bDialogueChanceBool;                               // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bConversationChanceBool;                           // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanPlaySubtitles;                                 // 0x03EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bConversationInProgress;                           // 0x03EB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bConversationQueued;                               // 0x03EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_Triggable_Base_C*         TargetTriggable;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APreviewCharacterTemplate_C*            TargetPreviewCh;                                   // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFMODAmbientSound*                      TargetFMODAmbient;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UAnimMontage*, class AActor*>      Actor_MontageRefs;                                 // 0x0408(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ConversationAbruptlyStopped;                       // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AdditionalConvoAfterReport();
	void Animated_Conversation_Initialize();
	void AnimationConversationFinished();
	void AnimCaster(class AActor* Actor_Ref, class UAnimMontage** Montage_Ref, class USkeletalMeshComponent** Skel_Ref);
	void BndEvt__Sound_GlobalConversationTrigger_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Sound_GlobalConversationTrigger_BP_SubtitleCollision_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Sound_GlobalConversationTrigger_BP_SubtitleCollision_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Sound_GlobalConversationTrigger_Prototype_BP_TriggerZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CharacterChecker(const class FString& Character_Name, const class FString& Character_Team);
	void CharacterInterrupted();
	void CharacterNotInterrupted();
	void Conversation_Abrupt_Stop();
	void Conversation_End_Check();
	void ConversationManager();
	void ConversationManagerReported();
	void DialogueFinished_5A84D96249EF5F03044C7997442B8880();
	void DialogueFinished_C1A1666F4855D7F04D246DAE78C78922();
	void DialogueFinished_CA234E0443A7D8273AD5EA842F13A024();
	void DialogueFinished_D607AE474C497EF5B5BA8CB8A3473612();
	void EvidenceReported(class AEvidenceActor* CollectedEvidence, class AReadyOrNotCharacter* Collector);
	void ExecuteUbergraph_Sound_GlobalConversationTrigger_BP(int32 EntryPoint);
	void GetConversationSection(TArray<struct FGlobalConversationTrigger_Master_Struct>* Master_Conversation_Array, struct FGlobalConversationTrigger_Master_Struct* Conversation_Preset, struct FGlobalConversationTrigger_Struct* Conversation_Section);
	void IncapReported(class AIncapacitatedHuman* ReportedIncapacitatedHuman, class AReadyOrNotCharacter* Reporter);
	void LineFinished();
	void Multicast_Play_Self_Dialogue(const class FString& Speaker, const class FString& Voice_Line, class FName Speaker_Tag);
	void Multicast_PlayAnimation(class UAnimMontage* Montage_Ref, class USkeletalMeshComponent* Skel_Ref);
	void Multicast_PlayStaticDialogue(class AActor* TargetActor, const class FString& Speaker, const class FString& Bark_Name, const class FString& SubtitleSpeakerNameOverride, class FName SubtitleSpeakerTag, double SubtitleLength);
	void NotifyTriggered(int32 Convo_Preset, int32 Convo_Section);
	void OnBlendOut_CE30D76B4D93A7477560BC8935942447(class FName NotifyName);
	void OnCompleted_CE30D76B4D93A7477560BC8935942447(class FName NotifyName);
	void OnInterrupted_CE30D76B4D93A7477560BC8935942447(class FName NotifyName);
	void OnNotifyBegin_CE30D76B4D93A7477560BC8935942447(class FName NotifyName);
	void OnNotifyEnd_CE30D76B4D93A7477560BC8935942447(class FName NotifyName);
	void PlayStaticDialogue(class AActor* TargetActor, const class FString& Speaker, const class FString& Subtitle_Speaker_Name_Override, class FName Subtitle_Speaker_Tag, double Subtitle_Length, const class FString& Path_of_Audio, const class FString& VoiceLine, bool Can_Play_Subtitle);
	void ReceiveBeginPlay();
	void ReportableConversation(class AReadyOrNotCharacter* Character_Reported);
	void ReportableReported(class AReportableActor* ReportableActor, class AReadyOrNotCharacter* Reporter);
	void Self_Character_Dialogue_Player();
	void SoundCaster(TSoftObjectPtr<class AActor> Actor_Soft_Object, class FName Tag_Reference_To_Speaker);
	void Static_Character_Dialogue_Player();

	void GetTargetActor(class AActor** ActorTarget) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Sound_GlobalConversationTrigger_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Sound_GlobalConversationTrigger_BP_C")
	}
	static class ASound_GlobalConversationTrigger_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASound_GlobalConversationTrigger_BP_C>();
	}
};
DUMPER7_ASSERTS_ASound_GlobalConversationTrigger_BP_C;

}

