#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sound_StarterAmbience_V2_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SoundStarterStruct_structs.hpp"
#include "ParameterTransition_Reverb_Enum_structs.hpp"
#include "ParameterTransition_Reverb_Material_Enum_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Sound_StarterAmbience_V2_BP.Sound_StarterAmbience_V2_BP_C
// 0x00A0 (0x0340 - 0x02A0)
class ASound_StarterAmbience_V2_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    BillBoard;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSoundStarterStruct>            _Music_Events;                                     // 0x02B8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class FName                                   Starting_Global_Parameter;                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Starting_Global_Parameter_Value;                   // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                     Starting_Global_Parameters;                        // 0x02D8(0x0050)(Edit, BlueprintVisible)
	EParameterTransition_Reverb_Enum              Starting_Reverb;                                   // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EParameterTransition_Reverb_Material_Enum     Starting_Reverb_Material;                          // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODEvent*                             Starting_Reverb_Event;                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Starting_Reverb_Material_Event;                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Sound_StarterAmbience_V2_BP(int32 EntryPoint);
	void FMODInitializer();
	void InitialOverlap();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Sound_StarterAmbience_V2_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Sound_StarterAmbience_V2_BP_C")
	}
	static class ASound_StarterAmbience_V2_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASound_StarterAmbience_V2_BP_C>();
	}
};
DUMPER7_ASSERTS_ASound_StarterAmbience_V2_BP_C;

}

