#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineTrigger_OutOfBounds_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SplineTrigger_OutOfBounds_Base.SplineTrigger_OutOfBounds_Base_C
// 0x0070 (0x03A0 - 0x0330)
class ASplineTrigger_OutOfBounds_Base_C final : public ASplineTrigger
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Greyscale_Timeline_Scalar_E06E2F124CDF28DBC436D7B5B4D0178A; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Greyscale_Timeline__Direction_E06E2F124CDF28DBC436D7B5B4D0178A; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Greyscale_Timeline;                                // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       PlayerCharacter;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UW_OutOfBounds_C*                       OutOfBoundsWidget;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MI_PostProcessGreyScale;                           // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_PostProcessGreyScale;                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             VoiceLineToPlayOnExit;                             // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        VoiceLineCooldown;                                 // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VoiceLineCooldown_MinDeviation;                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VoiceLineCooldown_MaxDeviation;                    // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVoiceLineCooldownStarted;                         // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VoiceLineExitPlayCount;                            // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TH_VoiceLineExit;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TH_VoiceLineCooldownExpiry;                        // 0x0398(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void StopCountdown_Event_0();
	void StartCountdown_Event_0();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void PlaySplineExitVoiceLine();
	void OnSplineEnclosureExited(class APlayerCharacter* PlayerCharacter_0);
	void OnSplineEnclosureEntered(class APlayerCharacter* PlayerCharacter_0);
	void OnAnimFinished();
	void HideOutOfBoundsWidget();
	void Greyscale_Timeline__UpdateFunc();
	void Greyscale_Timeline__FinishedFunc();
	void ExecuteUbergraph_SplineTrigger_OutOfBounds_Base(int32 EntryPoint);
	void DestroyOutOfBoundsWidget();
	void Delegate_OnOutOfBoundsTimeLimitEnded_Event_0();
	void CustomEvent_1();
	void CustomEvent_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SplineTrigger_OutOfBounds_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SplineTrigger_OutOfBounds_Base_C")
	}
	static class ASplineTrigger_OutOfBounds_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASplineTrigger_OutOfBounds_Base_C>();
	}
};
DUMPER7_ASSERTS_ASplineTrigger_OutOfBounds_Base_C;

}

