#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_BkBldBorder

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_BkBldBorder.ST_BkBldBorder
// 0x0010 (0x0010 - 0x0000)
struct FST_BkBldBorder final
{
public:
	bool                                          BorderOn_1_E2CAF67F4EA7B3B254D03E9EB20D1387;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BorderHeight_8_5FC1FBC147F922DBD5D270AF1D536BC0;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BorderTypeUV_9_BE37B4F74D930D161BB7BF822699EE0B;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BorderVariation_10_8456C26D444FCDE7DDF55091325EB5C1; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_BkBldBorder;

}

