#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_Credit

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_Credit.ST_Credit
// 0x0098 (0x0098 - 0x0000)
struct FST_Credit final
{
public:
	class FText                                   CreditsTitle_24_ACA8DB534B0EA2162DC703AD4DC70480;  // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CreditHeader_10_0A6BB51141DAC82AE14909AF62A66996;  // 0x0018(0x0018)(Edit, BlueprintVisible)
	class FText                                   FullName_6_B1B4D35A49E3D2B65F94DFB7C91161F9;       // 0x0030(0x0018)(Edit, BlueprintVisible)
	TArray<class FText>                           Roles_5_A38C02744E1DB316CD9909AF1A4D27DB;          // 0x0048(0x0010)(Edit, BlueprintVisible)
	class FText                                   NameOnly_20_332D58EE43BDF71AF879D9889F6B91B3;      // 0x0058(0x0018)(Edit, BlueprintVisible)
	class FText                                   Legal_15_8318B45C44D4DC75D15890BE98035801;         // 0x0070(0x0018)(Edit, BlueprintVisible)
	TArray<class FText>                           SupporterCredits_30_8BF79F954067FB0FEAD4C6A3C2C44280; // 0x0088(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FST_Credit;

}

