#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_GroundSection

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_GroundSection.ST_GroundSection
// 0x0010 (0x0010 - 0x0000)
struct FST_GroundSection final
{
public:
	bool                                          On_39_1712582447AC26E38F9377A106F7D73C;            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Type_32_BE0F35A14D9304C0601883A3E490FE90;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Variation_33_644892B44EA85705610C42909C4F35F1;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LateralOffsetUV_23_95D775DE4B056493E0746FB9CF43A6E1; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_GroundSection;

}

