#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: st_HotkeySettings

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct st_HotkeySettings.st_HotkeySettings
// 0x0058 (0x0058 - 0x0000)
struct Fst_HotkeySettings final
{
public:
	struct FKey                                   Key_13_7D5A72EF475EAE550DE823BD2FD80730;           // 0x0000(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                 ID_3_76C4772F4662598118912F981874ADE6;             // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Text_6_F55AF6CE418979B1B14680A3FF46E9D3;           // 0x0028(0x0018)(Edit, BlueprintVisible)
	bool                                          IsButton_10_ADF5F2D44316600C07F3619BDABFCB39;      // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    InputAction_20_BDBF351742AAC44909AEDCB550AFACC3;   // 0x0048(0x0010)(Edit, BlueprintVisible, NoDestructor)
};
DUMPER7_ASSERTS_Fst_HotkeySettings;

}

