#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_Style_Buttons

#include "Basic.hpp"

#include "ST_Style_Buttons_Fonts_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_Style_Buttons_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_Style_Buttons.ST_Style_Buttons
// 0x0720 (0x0720 - 0x0000)
struct FST_Style_Buttons final
{
public:
	struct FButtonStyle                           ButtonStyleold_22_BBBACEBF467720A57D9D1B8E5B4F4F1F; // 0x0000(0x03F0)(Edit, BlueprintVisible)
	struct FST_Style_Buttons_Fonts                ButtonFontStyle_16_A0777E5A4EE2AFA1C5E16B84B437061B; // 0x03F0(0x0320)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_Style_Buttons                               ActiveButtonStyle_19_D1243A474270481757C35484BED22F09; // 0x0710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ButtonStyle_28_AB1D963C4B3152E7E683D8B326A6AE9D;   // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_Style_Buttons;

}

