#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsIntegration

#include "Basic.hpp"


namespace SDK
{

// Enum StatsIntegration.EAchievementDisplayAttributeUE4
// NumValues: 0x0004
enum class EAchievementDisplayAttributeUE4 : uint8
{
	ADA_EAttributeName                       = 0,
	ADA_EAttributeDescription                = 1,
	ADA_EAttributeHidden                     = 2,
	ADA_MAX                                  = 3,
};

// Enum StatsIntegration.ESteamStatType
// NumValues: 0x0004
enum class ESteamStatType : uint8
{
	STAT_INT                                 = 0,
	STAT_FLOAT                               = 1,
	STAT_AVGRATE                             = 2,
	STAT_MAX                                 = 3,
};

// ScriptStruct StatsIntegration.SteamStat
// 0x0030 (0x0030 - 0x0000)
struct FSteamStat final
{
public:
	class FString                                 FriendlyStatName;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 APIStatName;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamStatType                                StatType;                                          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntegerValue;                                      // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSteamStat;

}

