#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsIntegration

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StatsIntegration_structs.hpp"


namespace SDK::Params
{

// Function StatsIntegration.GetAchievementData.GetAchievementAPIName
// 0x0018 (0x0018 - 0x0000)
struct GetAchievementData_GetAchievementAPIName final
{
public:
	int32                                         AchievementIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GetAchievementData_GetAchievementAPIName;

// Function StatsIntegration.GetAchievementData.GetAchievementDisplayAttribute
// 0x0028 (0x0028 - 0x0000)
struct GetAchievementData_GetAchievementDisplayAttribute final
{
public:
	class FString                                 AchievementAPIName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAchievementDisplayAttributeUE4               Attribute;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GetAchievementData_GetAchievementDisplayAttribute;

// Function StatsIntegration.GetAchievementData.GetAchievementIcon
// 0x0018 (0x0018 - 0x0000)
struct GetAchievementData_GetAchievementIcon final
{
public:
	class FString                                 AchievementAPIName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GetAchievementData_GetAchievementIcon;

// Function StatsIntegration.GetAchievementData.GetAchievementUnlockStatusAndUnlockTime
// 0x0020 (0x0020 - 0x0000)
struct GetAchievementData_GetAchievementUnlockStatusAndUnlockTime final
{
public:
	class FString                                 AchievementAPIName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AchievementUnlocked;                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              UnlockTime;                                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GetAchievementData_GetAchievementUnlockStatusAndUnlockTime;

// Function StatsIntegration.GetAchievementData.GetGlobalAchievementAchievedPercent
// 0x0018 (0x0018 - 0x0000)
struct GetAchievementData_GetGlobalAchievementAchievedPercent final
{
public:
	class FString                                 AchievementAPIName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GetAchievementData_GetGlobalAchievementAchievedPercent;

// Function StatsIntegration.GetAchievementData.GetNumAchievements
// 0x0004 (0x0004 - 0x0000)
struct GetAchievementData_GetNumAchievements final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GetAchievementData_GetNumAchievements;

// Function StatsIntegration.GetStoredStats.GetUserStoredStat
// 0x0020 (0x0020 - 0x0000)
struct GetStoredStats_GetUserStoredStat final
{
public:
	class FString                                 APIStatName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamStatType                                StatType;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntegerValue;                                      // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GetStoredStats_GetUserStoredStat;

// Function StatsIntegration.GetStoredStats.GetUserStoredStats
// 0x0020 (0x0020 - 0x0000)
struct GetStoredStats_GetUserStoredStats final
{
public:
	TArray<struct FSteamStat>                     StatsToGet;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSteamStat>                     StatsOut;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GetStoredStats_GetUserStoredStats;

// Function StatsIntegration.IndicateAchievementProgress.IndicateUserAchievementProgress
// 0x0020 (0x0020 - 0x0000)
struct IndicateAchievementProgress_IndicateUserAchievementProgress final
{
public:
	class FString                                 AchievementAPIName_0;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentProgress_0;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxProgress_0;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UIndicateAchievementProgress*           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IndicateAchievementProgress_IndicateUserAchievementProgress;

// Function StatsIntegration.RequestStatsAndAchievements.RequestUserStatsAndAchievements
// 0x0008 (0x0008 - 0x0000)
struct RequestStatsAndAchievements_RequestUserStatsAndAchievements final
{
public:
	class URequestStatsAndAchievements*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RequestStatsAndAchievements_RequestUserStatsAndAchievements;

// Function StatsIntegration.ResetAllStatsAndAchievements.ResetUserStatsAndAchievements
// 0x0010 (0x0010 - 0x0000)
struct ResetAllStatsAndAchievements_ResetUserStatsAndAchievements final
{
public:
	bool                                          bAchievementsToo;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UResetAllStatsAndAchievements*          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ResetAllStatsAndAchievements_ResetUserStatsAndAchievements;

// Function StatsIntegration.SetAchievementData.ClearAchievement
// 0x0018 (0x0018 - 0x0000)
struct SetAchievementData_ClearAchievement final
{
public:
	class FString                                 AchievementAPIName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SetAchievementData_ClearAchievement;

// Function StatsIntegration.SetAchievementData.SetAchievement
// 0x0018 (0x0018 - 0x0000)
struct SetAchievementData_SetAchievement final
{
public:
	class FString                                 AchievementAPIName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SetAchievementData_SetAchievement;

// Function StatsIntegration.SetStoredStats.SetStoredStat
// 0x0028 (0x0028 - 0x0000)
struct SetStoredStats_SetStoredStat final
{
public:
	class FString                                 APIStatName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamStatType                                StatType;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatValue;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntegerValue;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SessionLength;                                     // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SetStoredStats_SetStoredStat;

// Function StatsIntegration.SetStoredStats.SetStoredStats
// 0x0018 (0x0018 - 0x0000)
struct SetStoredStats_SetStoredStats final
{
public:
	TArray<struct FSteamStat>                     SteamStatsIn;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         SessionLength;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SetStoredStats_SetStoredStats;

// Function StatsIntegration.StoreStatsAndAchievements.StoreUserStatsAndAchievements
// 0x0008 (0x0008 - 0x0000)
struct StoreStatsAndAchievements_StoreUserStatsAndAchievements final
{
public:
	class UStoreStatsAndAchievements*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreStatsAndAchievements_StoreUserStatsAndAchievements;

}

