#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsIntegration

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "StatsIntegration_structs.hpp"


namespace SDK
{

// Class StatsIntegration.GetAchievementData
// 0x0000 (0x0028 - 0x0028)
class UGetAchievementData final : public UBlueprintFunctionLibrary
{
public:
	static class FString GetAchievementAPIName(int32 AchievementIndex);
	static class FString GetAchievementDisplayAttribute(const class FString& AchievementAPIName, EAchievementDisplayAttributeUE4 Attribute);
	static class UTexture2D* GetAchievementIcon(const class FString& AchievementAPIName);
	static void GetAchievementUnlockStatusAndUnlockTime(const class FString& AchievementAPIName, bool* AchievementUnlocked, struct FDateTime* UnlockTime);
	static float GetGlobalAchievementAchievedPercent(const class FString& AchievementAPIName);
	static int32 GetNumAchievements();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GetAchievementData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GetAchievementData")
	}
	static class UGetAchievementData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGetAchievementData>();
	}
};
DUMPER7_ASSERTS_UGetAchievementData;

// Class StatsIntegration.GetStoredStats
// 0x0000 (0x0028 - 0x0028)
class UGetStoredStats final : public UBlueprintFunctionLibrary
{
public:
	static void GetUserStoredStat(const class FString& APIStatName, ESteamStatType StatType, int32* IntegerValue, float* FloatValue);
	static void GetUserStoredStats(const TArray<struct FSteamStat>& StatsToGet, TArray<struct FSteamStat>* StatsOut);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GetStoredStats")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GetStoredStats")
	}
	static class UGetStoredStats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGetStoredStats>();
	}
};
DUMPER7_ASSERTS_UGetStoredStats;

// Class StatsIntegration.IndicateAchievementProgress
// 0x0088 (0x00B8 - 0x0030)
class UIndicateAchievementProgress final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 SteamErrorOutput)> OnSuccess;                                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 SteamErrorOutput)> OnFailure;                                // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 AchievementAPIName;                                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentProgress;                                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxProgress;                                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x50];                                      // 0x0068(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UIndicateAchievementProgress* IndicateUserAchievementProgress(const class FString& AchievementAPIName_0, int32 CurrentProgress_0, int32 MaxProgress_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IndicateAchievementProgress")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IndicateAchievementProgress")
	}
	static class UIndicateAchievementProgress* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIndicateAchievementProgress>();
	}
};
DUMPER7_ASSERTS_UIndicateAchievementProgress;

// Class StatsIntegration.RequestStatsAndAchievements
// 0x0078 (0x00A8 - 0x0030)
class URequestStatsAndAchievements final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 SteamErrorOutput)> OnSuccess;                                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 SteamErrorOutput)> OnFailure;                                // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x58];                                      // 0x0050(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class URequestStatsAndAchievements* RequestUserStatsAndAchievements();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RequestStatsAndAchievements")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RequestStatsAndAchievements")
	}
	static class URequestStatsAndAchievements* GetDefaultObj()
	{
		return GetDefaultObjImpl<URequestStatsAndAchievements>();
	}
};
DUMPER7_ASSERTS_URequestStatsAndAchievements;

// Class StatsIntegration.ResetAllStatsAndAchievements
// 0x00B8 (0x00E8 - 0x0030)
class UResetAllStatsAndAchievements final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 SteamErrorOutput)> OnSuccess;                                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 SteamErrorOutput)> OnFailure;                                // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bresetAchievementsToo;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x97];                                      // 0x0051(0x0097)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UResetAllStatsAndAchievements* ResetUserStatsAndAchievements(bool bAchievementsToo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResetAllStatsAndAchievements")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResetAllStatsAndAchievements")
	}
	static class UResetAllStatsAndAchievements* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResetAllStatsAndAchievements>();
	}
};
DUMPER7_ASSERTS_UResetAllStatsAndAchievements;

// Class StatsIntegration.SetAchievementData
// 0x0000 (0x0028 - 0x0028)
class USetAchievementData final : public UBlueprintFunctionLibrary
{
public:
	static bool ClearAchievement(const class FString& AchievementAPIName);
	static bool SetAchievement(const class FString& AchievementAPIName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SetAchievementData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SetAchievementData")
	}
	static class USetAchievementData* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetAchievementData>();
	}
};
DUMPER7_ASSERTS_USetAchievementData;

// Class StatsIntegration.SetStoredStats
// 0x0000 (0x0028 - 0x0028)
class USetStoredStats final : public UBlueprintFunctionLibrary
{
public:
	static bool SetStoredStat(const class FString& APIStatName, ESteamStatType StatType, float FloatValue, int32 IntegerValue, float SessionLength);
	static bool SetStoredStats(const TArray<struct FSteamStat>& SteamStatsIn, float SessionLength);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SetStoredStats")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SetStoredStats")
	}
	static class USetStoredStats* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetStoredStats>();
	}
};
DUMPER7_ASSERTS_USetStoredStats;

// Class StatsIntegration.SteamRequests
// 0x0000 (0x0028 - 0x0028)
class USteamRequests final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteamRequests")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteamRequests")
	}
	static class USteamRequests* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamRequests>();
	}
};
DUMPER7_ASSERTS_USteamRequests;

// Class StatsIntegration.StoreStatsAndAchievements
// 0x0070 (0x00A0 - 0x0030)
class UStoreStatsAndAchievements final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 SteamErrorOutput)> OnSuccess;                                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 SteamErrorOutput)> OnFailure;                                // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UStoreStatsAndAchievements* StoreUserStatsAndAchievements();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StoreStatsAndAchievements")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StoreStatsAndAchievements")
	}
	static class UStoreStatsAndAchievements* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreStatsAndAchievements>();
	}
};
DUMPER7_ASSERTS_UStoreStatsAndAchievements;

}

