#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BlockList_Entry

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_ReportButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ReportButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ReportButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_ReportButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ReportButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ReportButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_ReportButton_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ReportButton_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ReportButton_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_UnBlockButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_UnBlockButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_UnBlockButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_UnblockButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_UnblockButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_UnblockButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_UnblockButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_UnblockButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_UnblockButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_ViewProfileButton_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ViewProfileButton_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ViewProfileButton_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_ViewProfileButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ViewProfileButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ViewProfileButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_ViewProfileButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ViewProfileButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_ViewProfileButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_W_InputActionButton_241_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_W_InputActionButton_241_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_W_InputActionButton_241_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_W_InputActionButton_73_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_W_InputActionButton_73_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_W_InputActionButton_73_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.BndEvt__W_BlockList_Entry_W_InputActionButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_W_InputActionButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_BndEvt__W_BlockList_Entry_W_InputActionButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature;

// Function W_BlockList_Entry.W_BlockList_Entry_C.ExecuteUbergraph_W_BlockList_Entry
// 0x0090 (0x0090 - 0x0000)
struct W_BlockList_Entry_C_ExecuteUbergraph_W_BlockList_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_10;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_9;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_8;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BlockList_C*                         K2Node_DynamicCast_AsW_Block_List;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_11;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_12;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_13;              // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowProfileUI_ReturnValue;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_BlockList_Entry_C_ExecuteUbergraph_W_BlockList_Entry;

}

