#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Briefing_TimelineEvents

#include "Basic.hpp"

#include "ReadyOrNot_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Briefing_TimelineEvents.W_Briefing_TimelineEvents_C
// 0x0088 (0x0350 - 0x02C8)
class UW_Briefing_TimelineEvents_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VB_Events;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Header_C*                            W_Header;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<double, struct FTimelineEvent>           EventEntries;                                      // 0x02E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCanvasPanel*                           TimelineEntryCanvas;                               // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Spacing;                                           // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double EventAudioStart, double EventAudioDuration)> OnEventClicked; // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddEvent(double EventID);
	void EventClicked(double EventAudioStart, double EventAudioDuration);
	void ExecuteUbergraph_W_Briefing_TimelineEvents(int32 EntryPoint);
	void Finished_CEF1E049428EE21AB58B96A8441038EA();
	void Initialize(const TMap<double, struct FTimelineEvent>& EventEntries_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Briefing_TimelineEvents_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Briefing_TimelineEvents_C")
	}
	static class UW_Briefing_TimelineEvents_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Briefing_TimelineEvents_C>();
	}
};
DUMPER7_ASSERTS_UW_Briefing_TimelineEvents_C;

}

