#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Briefing_Media_AudioEntry_V2

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C
// 0x0120 (0x16D0 - 0x15B0)
class UW_Briefing_Media_AudioEntry_V2_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       animPlaying;                                       // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_icon;                                          // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       txt_Description;                                   // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       txt_Name;                                          // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x15E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x15F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Transcript;                                        // 0x1610(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFMODEvent*                             FMODEvent;                                         // 0x1628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlaying;                                          // 0x1630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1631[0x7];                                     // 0x1631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMissionAudio                          MissionAudioData;                                  // 0x1638(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class UW_Briefing_Media_AudioEntry_V2_C* AudioEntry)> OnClick;     // 0x1698(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bHovered;                                          // 0x16A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPressed;                                          // 0x16A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelected;                                         // 0x16AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16AB[0x5];                                     // 0x16AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UW_Briefing_Media_AudioEntry_V2_C* AudioEntry)> OnFocused;   // 0x16B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_Briefing_Media_AudioEntry_V2_C* AudioEntry)> OnUnfocused; // 0x16C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnReleased();
	void BP_OnUnhovered();
	void Construct();
	void Deselect();
	void ExecuteUbergraph_W_Briefing_Media_AudioEntry_V2(int32 EntryPoint);
	void GetBorderColor(struct FLinearColor* Color);
	void GetIconColor(struct FLinearColor* Color);
	void GetTextColor(struct FSlateColor* Color);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void Select();
	void SetHoverState(bool Hovered);
	void SetIsPlaying(bool IsPlaying);
	void SetPressedState(bool Pressed);
	void UpdateText();
	void UpdateVisualState(bool Hovered, bool Pressed, bool Selected, bool Playing);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Briefing_Media_AudioEntry_V2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Briefing_Media_AudioEntry_V2_C")
	}
	static class UW_Briefing_Media_AudioEntry_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Briefing_Media_AudioEntry_V2_C>();
	}
};
DUMPER7_ASSERTS_UW_Briefing_Media_AudioEntry_V2_C;

}

