#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Briefing_Media_AudioEntry_V2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.ExecuteUbergraph_W_Briefing_Media_AudioEntry_V2
// 0x0038 (0x0038 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_ExecuteUbergraph_W_Briefing_Media_AudioEntry_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_ExecuteUbergraph_W_Briefing_Media_AudioEntry_V2;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.GetBorderColor
// 0x00E0 (0x00E0 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_GetBorderColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor;                // 0x0020(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_1;             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_1;              // 0x0044(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_2;             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_2;              // 0x0068(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_3;             // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_3;              // 0x008C(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_GetBorderColor;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.GetIconColor
// 0x0114 (0x0114 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_GetIconColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor;                // 0x0020(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_1;             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_1;              // 0x0044(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_2;             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_2;              // 0x0068(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_3;             // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_3;              // 0x00AC(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_4;             // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_4;              // 0x00E0(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_4;                // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_GetIconColor;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.GetTextColor
// 0x0158 (0x0158 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_GetTextColor final
{
public:
	struct FSlateColor                            Color;                                             // 0x0000(0x0014)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor;               // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor;                // 0x002C(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_1;             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_1;              // 0x0050(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_2;             // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_2;              // 0x0074(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_3;             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_3;              // 0x0098(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x00AC(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_4;             // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_4;              // 0x00D0(0x0014)()
	struct FLinearColor                           CallFunc_GetColorByName_LinearColor_5;             // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorByName_SlateColor_5;              // 0x00F4(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0108(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x011C(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x0130(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_4;                           // 0x0144(0x0014)()
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_GetTextColor;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_OnAddedToFocusPath;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_OnRemovedFromFocusPath;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_PreConstruct;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.SetHoverState
// 0x0001 (0x0001 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_SetHoverState final
{
public:
	bool                                          Hovered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_SetHoverState;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.SetIsPlaying
// 0x0010 (0x0010 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_SetIsPlaying final
{
public:
	bool                                          IsPlaying;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_SetIsPlaying;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.SetPressedState
// 0x0001 (0x0001 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_SetPressedState final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_SetPressedState;

// Function W_Briefing_Media_AudioEntry_V2.W_Briefing_Media_AudioEntry_V2_C.UpdateVisualState
// 0x0038 (0x0038 - 0x0000)
struct W_Briefing_Media_AudioEntry_V2_C_UpdateVisualState final
{
public:
	bool                                          Hovered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Playing;                                           // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetTextColor_Color;                       // 0x0004(0x0014)()
	struct FLinearColor                           CallFunc_GetIconColor_Color;                       // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetBorderColor_Color;                     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Briefing_Media_AudioEntry_V2_C_UpdateVisualState;

}

