#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ChatBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ChatBox.W_ChatBox_C
// 0x0030 (0x02F8 - 0x02C8)
class UW_ChatBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEditableTextBox*                       ChatBox;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_165;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bEditingChatbox;                                   // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTeamChat_;                                        // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     ChatToTeam;                                        // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MouseCursorAfterChat;                              // 0x02E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreplanningChat;                                   // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ESlateVisibility                              PostChatVisibility;                                // 0x02E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ChatVisibility;                                    // 0x02E6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E7[0x1];                                      // 0x02E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRChatMessage>                  NewVar_0;                                          // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__EditableTextBox_220_K2Node_ComponentBoundEvent_25_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void Construct();
	void ExecuteUbergraph_W_ChatBox(int32 EntryPoint);
	void HideChat();
	void HideChatBox();
	void OnChatMessageReceived_Event_0(const struct FRChatMessage& Message);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void SetInput();
	void ShowChatBox(bool bTeamChat__0);
	void UpdateHudVisibility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ChatBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ChatBox_C")
	}
	static class UW_ChatBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ChatBox_C>();
	}
};
DUMPER7_ASSERTS_UW_ChatBox_C;

}

