#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ConsoleHotkey

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_ConsoleHotkey.W_ConsoleHotkey_C.ExecuteUbergraph_W_ConsoleHotkey
// 0x0018 (0x0018 - 0x0000)
struct W_ConsoleHotkey_C_ExecuteUbergraph_W_ConsoleHotkey final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Pressed;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ConsoleHotkey_C_ExecuteUbergraph_W_ConsoleHotkey;

// Function W_ConsoleHotkey.W_ConsoleHotkey_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ConsoleHotkey_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ConsoleHotkey_C_PreConstruct;

// Function W_ConsoleHotkey.W_ConsoleHotkey_C.ShoulderButtonPressed
// 0x0001 (0x0001 - 0x0000)
struct W_ConsoleHotkey_C_ShoulderButtonPressed final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ConsoleHotkey_C_ShoulderButtonPressed;

}

