#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Combobox_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Combobox_Menu.W_Combobox_Menu_C
// 0x0058 (0x0320 - 0x02C8)
class UW_Combobox_Menu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           OptionContainer;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         OptionsAsStrings;                                  // 0x02D8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class FText>                           OptionsAsText;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UW_StandardCombobox_New_C*              ParentComboBox;                                    // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTextBlock*                             DescriptionWidget;                                 // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FText>                           Descriptions;                                      // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         SelectedOption;                                    // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Font_Size;                                         // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_Combobox_Menu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Combobox_Menu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Combobox_Menu_C")
	}
	static class UW_Combobox_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Combobox_Menu_C>();
	}
};
DUMPER7_ASSERTS_UW_Combobox_Menu_C;

}

