#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ControlsBind

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputRemapping_structs.hpp"
#include "SKeybinding_structs.hpp"
#include "InputCore_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_ControlsBind.W_ControlsBind_C.Add Conflicting Keybinds to List OLD
// 0x0040 (0x0040 - 0x0000)
struct W_ControlsBind_C_Add_Conflicting_Keybinds_to_List_OLD final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAxisMappingStruct>             Axes;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FActionMappingStruct>           Actions;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        ControlsScale;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TempMappingName;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ControlsBind_C_Add_Conflicting_Keybinds_to_List_OLD;

// Function W_ControlsBind.W_ControlsBind_C.Add Keybinds to List OLD
// 0x0048 (0x0048 - 0x0000)
struct W_ControlsBind_C_Add_Keybinds_to_List_OLD final
{
public:
	TArray<struct FSKeybinding>                   Keybinds;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   AxisMapping;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAxisMappingStruct>             AxesList;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FActionMappingStruct>           ActionsList;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        TempScale;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ControlsBind_C_Add_Keybinds_to_List_OLD;

// Function W_ControlsBind.W_ControlsBind_C.Click Listener Button Down
// 0x02D8 (0x02D8 - 0x0000)
struct W_ControlsBind_C_Click_Listener_Button_Down final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0168(0x00B8)()
	struct FEventReply                            CallFunc_HandleMouseButtonDown_Reply;              // 0x0220(0x00B8)()
};
DUMPER7_ASSERTS_W_ControlsBind_C_Click_Listener_Button_Down;

// Function W_ControlsBind.W_ControlsBind_C.ExecuteUbergraph_W_ControlsBind
// 0x0210 (0x0210 - 0x0000)
struct W_ControlsBind_C_ExecuteUbergraph_W_ControlsBind final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_KeyIn;                          // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAxisMappingStruct                     K2Node_MakeStruct_AxisMappingStruct;               // 0x0030(0x0028)()
	struct FActionMappingStruct                   K2Node_MakeStruct_ActionMappingStruct;             // 0x0058(0x0028)()
	TArray<EActionMappingFilter>                  K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	TArray<EAxisMappingFilter>                    K2Node_MakeArray_Array_1;                          // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetAllActionMappings_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActionMappingStruct>           CallFunc_GetAllActionMappings_ActionMappings;      // 0x00A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetAllAxisMappings_ReturnValue;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAxisMappingStruct>             CallFunc_GetAllAxisMappings_AxisMappings;          // 0x00C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConflictingKeybindsWhenValid_HasConflict; // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAxisMappingStruct>             CallFunc_GetConflictingKeybindsWhenValid_ConflictingAxes; // 0x00D8(0x0010)(ReferenceParm)
	TArray<struct FActionMappingStruct>           CallFunc_GetConflictingKeybindsWhenValid_ConflictingActions; // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CheckConflictingKeybindsAreUnbindable_ReturnValue; // 0x0100(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_BindFriendlyName;               // 0x0128(0x0018)()
	class FText                                   CallFunc_GetConflictingKeybindText_ReturnValue;    // 0x0140(0x0018)()
	TDelegate<void(class FText BindFriendlyName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RebindKey_ReturnValue;                    // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F[0x1];                                      // 0x016F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAxisMappingStruct                     CallFunc_GetInputBindingData_AxisMapping;          // 0x0170(0x0028)()
	struct FActionMappingStruct                   CallFunc_GetInputBindingData_ActionMapping;        // 0x0198(0x0028)()
	struct FAxisMappingStruct                     K2Node_MakeStruct_AxisMappingStruct_1;             // 0x01C0(0x0028)()
	struct FActionMappingStruct                   K2Node_MakeStruct_ActionMappingStruct_1;           // 0x01E8(0x0028)()
};
DUMPER7_ASSERTS_W_ControlsBind_C_ExecuteUbergraph_W_ControlsBind;

// Function W_ControlsBind.W_ControlsBind_C.Get Conflicting Keybind Text OLD
// 0x0048 (0x0048 - 0x0000)
struct W_ControlsBind_C_Get_Conflicting_Keybind_Text_OLD final
{
public:
	class FText                                   RequiredKeybindName;                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Text;                                              // 0x0018(0x0018)(Parm, OutParm)
	class FText                                   ConflictingBindFormat;                             // 0x0030(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_W_ControlsBind_C_Get_Conflicting_Keybind_Text_OLD;

// Function W_ControlsBind.W_ControlsBind_C.Get Conflicting Keybinds when Valid OLD
// 0x0078 (0x0078 - 0x0000)
struct W_ControlsBind_C_Get_Conflicting_Keybinds_when_Valid_OLD final
{
public:
	TArray<struct FAxisMappingStruct>             Axes;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FActionMappingStruct>           Actions;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bHasConflict;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAxisMappingStruct>             ConflictingAxes_0;                                 // 0x0028(0x0010)(Parm, OutParm)
	TArray<struct FActionMappingStruct>           ConflictingActions_0;                              // 0x0038(0x0010)(Parm, OutParm)
	TArray<struct FActionMappingStruct>           OutputAction;                                      // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<struct FAxisMappingStruct>             OutputAxes;                                        // 0x0058(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           LocalizedActions;                                  // 0x0068(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_W_ControlsBind_C_Get_Conflicting_Keybinds_when_Valid_OLD;

// Function W_ControlsBind.W_ControlsBind_C.GetOtherBindingIndex
// 0x0014 (0x0014 - 0x0000)
struct W_ControlsBind_C_GetOtherBindingIndex final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ControlsBind_C_GetOtherBindingIndex;

// Function W_ControlsBind.W_ControlsBind_C.HandleKeyDown
// 0x02B8 (0x02B8 - 0x0000)
struct W_ControlsBind_C_HandleKeyDown final
{
public:
	struct FGeometry                              My_Geometry;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              In_Key_Event;                                      // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0200(0x00B8)()
};
DUMPER7_ASSERTS_W_ControlsBind_C_HandleKeyDown;

// Function W_ControlsBind.W_ControlsBind_C.HandleMouseButtonDown
// 0x02B8 (0x02B8 - 0x0000)
struct W_ControlsBind_C_HandleMouseButtonDown final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            Reply;                                             // 0x0078(0x00B8)(Parm, OutParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0200(0x00B8)()
};
DUMPER7_ASSERTS_W_ControlsBind_C_HandleMouseButtonDown;

// Function W_ControlsBind.W_ControlsBind_C.HandleMouseWheel
// 0x0368 (0x0368 - 0x0000)
struct W_ControlsBind_C_HandleMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0170(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0190(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_2;                            // 0x01A8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_Select_Default;                             // 0x01C0(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01D8(0x00B8)()
	struct FKey                                   K2Node_Select_Default_1;                           // 0x0290(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x02A8(0x00B8)()
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ControlsBind_C_HandleMouseWheel;

// Function W_ControlsBind.W_ControlsBind_C.Key Event Received
// 0x0018 (0x0018 - 0x0000)
struct W_ControlsBind_C_Key_Event_Received final
{
public:
	struct FKey                                   KeyIn;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ControlsBind_C_Key_Event_Received;

// Function W_ControlsBind.W_ControlsBind_C.OnIllegalBindAttempted
// 0x0018 (0x0018 - 0x0000)
struct W_ControlsBind_C_OnIllegalBindAttempted final
{
public:
	class FText                                   BindFriendlyName_0;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_ControlsBind_C_OnIllegalBindAttempted;

// Function W_ControlsBind.W_ControlsBind_C.OnKeyDown
// 0x01E8 (0x01E8 - 0x0000)
struct W_ControlsBind_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_HandleKeyDown_ReturnValue;                // 0x0130(0x00B8)()
};
DUMPER7_ASSERTS_W_ControlsBind_C_OnKeyDown;

// Function W_ControlsBind.W_ControlsBind_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct W_ControlsBind_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_HandleMouseButtonDown_Reply;              // 0x0168(0x00B8)()
};
DUMPER7_ASSERTS_W_ControlsBind_C_OnMouseButtonDown;

// Function W_ControlsBind.W_ControlsBind_C.OnMouseWheel
// 0x0220 (0x0220 - 0x0000)
struct W_ControlsBind_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_HandleMouseWheel_ReturnValue;             // 0x0168(0x00B8)()
};
DUMPER7_ASSERTS_W_ControlsBind_C_OnMouseWheel;

// Function W_ControlsBind.W_ControlsBind_C.OnPreviewKeyDown
// 0x01E8 (0x01E8 - 0x0000)
struct W_ControlsBind_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_HandleKeyDown_ReturnValue;                // 0x0130(0x00B8)()
};
DUMPER7_ASSERTS_W_ControlsBind_C_OnPreviewKeyDown;

// Function W_ControlsBind.W_ControlsBind_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ControlsBind_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ControlsBind_C_PreConstruct;

// Function W_ControlsBind.W_ControlsBind_C.Remove Conflict Keybinds OLD
// 0x0080 (0x0080 - 0x0000)
struct W_ControlsBind_C_Remove_Conflict_Keybinds_OLD final
{
public:
	TArray<struct FAxisMappingStruct>             Axes;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FActionMappingStruct>           Actions;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UW_ControlsBind_C*                      TempActionToRemove;                                // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ControlsBind_C*                      TempAxisToRemove;                                  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActionMappingStruct                   TempActionMapping;                                 // 0x0030(0x0028)(Edit, BlueprintVisible)
	struct FAxisMappingStruct                     TempAxisMapping;                                   // 0x0058(0x0028)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_W_ControlsBind_C_Remove_Conflict_Keybinds_OLD;

// Function W_ControlsBind.W_ControlsBind_C.SetDisabled
// 0x0002 (0x0002 - 0x0000)
struct W_ControlsBind_C_SetDisabled final
{
public:
	bool                                          Disabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ControlsBind_C_SetDisabled;

// Function W_ControlsBind.W_ControlsBind_C.SetupDescription
// 0x0008 (0x0008 - 0x0000)
struct W_ControlsBind_C_SetupDescription final
{
public:
	class UW_Options_UE5_C*                       CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ControlsBind_C_SetupDescription;

}

