#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DebugInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DebugInfo.W_DebugInfo_C
// 0x00E8 (0x03B0 - 0x02C8)
class UW_DebugInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             DebugName_Text;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DebugValue_Text;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_53;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DebugName;                                         // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateFontInfo                         DebugNameFont;                                     // 0x0300(0x0058)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateFontInfo                         DebugValueFont;                                    // 0x0358(0x0058)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_DebugInfo(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetDebugValue(const class FText& DebugText);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_DebugInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_DebugInfo_C")
	}
	static class UW_DebugInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DebugInfo_C>();
	}
};
DUMPER7_ASSERTS_UW_DebugInfo_C;

}

