#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DebugInfoContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DebugInfoContainer.W_DebugInfoContainer_C
// 0x01A8 (0x0470 - 0x02C8)
class UW_DebugInfoContainer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BG_Blur;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Image;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DebugInfo_Container;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title_Text;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         TitleFont;                                         // 0x02F0(0x0058)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FMargin                                TitlePadding;                                      // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EHorizontalAlignment                          TitleHorizontalAlignment;                          // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EVerticalAlignment                            TitleVerticalAlignment;                            // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         DebugNameFont;                                     // 0x0360(0x0058)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateFontInfo                         DebugValueFont;                                    // 0x03B8(0x0058)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bEnableBackgroundEffects;                          // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0418(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class FText>                           DebugItems;                                        // 0x0430(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<double>                                Spacing;                                           // 0x0440(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bUseUniformSpacing;                                // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DefaultSpacing;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UW_DebugInfo_C*>                 DebugInfoWidgets;                                  // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddDebugItem(const class FText& Label, const class FText& Value);
	void AddDebugItems(int32 Num);
	void Clear();
	void ExecuteUbergraph_W_DebugInfoContainer(int32 EntryPoint);
	void Get_Debug_Item__Index_(int32 Index_0, class UW_DebugInfo_C** DebugInfoWidget);
	void Get_Debug_Item__Name_(const class FText& Debug_Name, class UW_DebugInfo_C** DebugInfoWidget);
	void GetNumDebugEntries(int32* Return_Value);
	void PreConstruct(bool IsDesignTime);
	void Refresh();
	void SetDebugItemValue(int32 Index_0, const class FText& DebugText);

	void GetTitle(class FText* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_DebugInfoContainer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_DebugInfoContainer_C")
	}
	static class UW_DebugInfoContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DebugInfoContainer_C>();
	}
};
DUMPER7_ASSERTS_UW_DebugInfoContainer_C;

}

