#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: w_Dropdown

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ST_DropdownOptions_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function w_Dropdown.w_Dropdown_C.AddFooterOption
// 0x0030 (0x0030 - 0x0000)
struct w_Dropdown_C_AddFooterOption final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FST_DropdownOptions                    OptionData;                                        // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_AddFooterOption;

// Function w_Dropdown.w_Dropdown_C.AddOption
// 0x0028 (0x0028 - 0x0000)
struct w_Dropdown_C_AddOption final
{
public:
	class FString                                 OptionID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   OptionText;                                        // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_w_Dropdown_C_AddOption;

// Function w_Dropdown.w_Dropdown_C.BackPage
// 0x0001 (0x0001 - 0x0000)
struct w_Dropdown_C_BackPage final
{
public:
	bool                                          Handled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_BackPage;

// Function w_Dropdown.w_Dropdown_C.BndEvt__w_Dropdown_btn_Dropdown_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct w_Dropdown_C_BndEvt__w_Dropdown_btn_Dropdown_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_BndEvt__w_Dropdown_btn_Dropdown_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature;

// Function w_Dropdown.w_Dropdown_C.BndEvt__w_Dropdown_btn_Dropdown_K2Node_ComponentBoundEvent_2_Hovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct w_Dropdown_C_BndEvt__w_Dropdown_btn_Dropdown_K2Node_ComponentBoundEvent_2_Hovered__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_BndEvt__w_Dropdown_btn_Dropdown_K2Node_ComponentBoundEvent_2_Hovered__DelegateSignature;

// Function w_Dropdown.w_Dropdown_C.ChangePage
// 0x0008 (0x0008 - 0x0000)
struct w_Dropdown_C_ChangePage final
{
public:
	class FName                                   PageName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_ChangePage;

// Function w_Dropdown.w_Dropdown_C.CloseMenu
// 0x0010 (0x0010 - 0x0000)
struct w_Dropdown_C_CloseMenu final
{
public:
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_CloseMenu;

// Function w_Dropdown.w_Dropdown_C.DisableInteraction
// 0x0001 (0x0001 - 0x0000)
struct w_Dropdown_C_DisableInteraction final
{
public:
	bool                                          Disable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_DisableInteraction;

// Function w_Dropdown.w_Dropdown_C.ExecuteUbergraph_w_Dropdown
// 0x00B0 (0x00B0 - 0x0000)
struct w_Dropdown_C_ExecuteUbergraph_w_Dropdown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Button_C*                            K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_OptionID_3;                     // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_OptionID_2;                     // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Delay_1;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Delay;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Collapse;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PageName;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_OptionID_1;                     // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsGamepad;                            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_OptionID;                       // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UW_Button_C*                            K2Node_ComponentBoundEvent_Button;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_ExecuteUbergraph_w_Dropdown;

// Function w_Dropdown.w_Dropdown_C.FooterOptionHovered
// 0x0010 (0x0010 - 0x0000)
struct w_Dropdown_C_FooterOptionHovered final
{
public:
	class FString                                 OptionID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_FooterOptionHovered;

// Function w_Dropdown.w_Dropdown_C.FooterOptionSelected
// 0x0010 (0x0010 - 0x0000)
struct w_Dropdown_C_FooterOptionSelected final
{
public:
	class FString                                 OptionID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_FooterOptionSelected;

// Function w_Dropdown.w_Dropdown_C.Hide
// 0x0010 (0x0010 - 0x0000)
struct w_Dropdown_C_Hide final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Collapse;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_Hide;

// Function w_Dropdown.w_Dropdown_C.On_DropdownMenuAnchor_GetUserMenuContent_0
// 0x0090 (0x0090 - 0x0000)
struct w_Dropdown_C_On_DropdownMenuAnchor_GetUserMenuContent_0 final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OptionID)> K2Node_CreateDelegate_OutputDelegate;             // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class Uw_DropdownMenu_C*                      CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_Button_C* DesiredFocus)> K2Node_CreateDelegate_OutputDelegate_2;         // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OptionID)> K2Node_CreateDelegate_OutputDelegate_4;           // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OptionID)> K2Node_CreateDelegate_OutputDelegate_5;           // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OptionID)> K2Node_CreateDelegate_OutputDelegate_7;           // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_On_DropdownMenuAnchor_GetUserMenuContent_0;

// Function w_Dropdown.w_Dropdown_C.OnDropdown Menu Desired Focus Set
// 0x0008 (0x0008 - 0x0000)
struct w_Dropdown_C_OnDropdown_Menu_Desired_Focus_Set final
{
public:
	class UW_Button_C*                            DesiredFocus;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_OnDropdown_Menu_Desired_Focus_Set;

// Function w_Dropdown.w_Dropdown_C.OpenMenu
// 0x0020 (0x0020 - 0x0000)
struct w_Dropdown_C_OpenMenu final
{
public:
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_OpenMenu;

// Function w_Dropdown.w_Dropdown_C.OptionHovered
// 0x0010 (0x0010 - 0x0000)
struct w_Dropdown_C_OptionHovered final
{
public:
	class FString                                 OptionID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_OptionHovered;

// Function w_Dropdown.w_Dropdown_C.OptionSelected
// 0x0010 (0x0010 - 0x0000)
struct w_Dropdown_C_OptionSelected final
{
public:
	class FString                                 OptionID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_OptionSelected;

// Function w_Dropdown.w_Dropdown_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct w_Dropdown_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_PreConstruct;

// Function w_Dropdown.w_Dropdown_C.RemoveFooterOption
// 0x0018 (0x0018 - 0x0000)
struct w_Dropdown_C_RemoveFooterOption final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_RemoveFooterOption;

// Function w_Dropdown.w_Dropdown_C.Reveal
// 0x0008 (0x0008 - 0x0000)
struct w_Dropdown_C_Reveal final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_Reveal;

// Function w_Dropdown.w_Dropdown_C.SetFooterOptions
// 0x0050 (0x0050 - 0x0000)
struct w_Dropdown_C_SetFooterOptions final
{
public:
	TMap<class FString, struct FST_DropdownOptions> FooterOptions_0;                                 // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_w_Dropdown_C_SetFooterOptions;

// Function w_Dropdown.w_Dropdown_C.SetInputMode
// 0x0001 (0x0001 - 0x0000)
struct w_Dropdown_C_SetInputMode final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_SetInputMode;

// Function w_Dropdown.w_Dropdown_C.SetLabelText
// 0x0018 (0x0018 - 0x0000)
struct w_Dropdown_C_SetLabelText final
{
public:
	class FText                                   LabelText_0;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_w_Dropdown_C_SetLabelText;

// Function w_Dropdown.w_Dropdown_C.SetOptions
// 0x0050 (0x0050 - 0x0000)
struct w_Dropdown_C_SetOptions final
{
public:
	TMap<class FString, class FText>              Options_0;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_w_Dropdown_C_SetOptions;

// Function w_Dropdown.w_Dropdown_C.SetSelection
// 0x0030 (0x0030 - 0x0000)
struct w_Dropdown_C_SetSelection final
{
public:
	class FString                                 OptionID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0010(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_SetSelection;

// Function w_Dropdown.w_Dropdown_C.SetSelectionByIndex
// 0x0028 (0x0028 - 0x0000)
struct w_Dropdown_C_SetSelectionByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0008(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_SetSelectionByIndex;

// Function w_Dropdown.w_Dropdown_C.UpdateLabelText
// 0x0058 (0x0058 - 0x0000)
struct w_Dropdown_C_UpdateLabelText final
{
public:
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0000(0x0020)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0020(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_UpdateLabelText;

// Function w_Dropdown.w_Dropdown_C.GetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct w_Dropdown_C_GetFocusTarget final
{
public:
	class UWidget*                                Focus;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_w_Dropdown_C_GetFocusTarget;

}

