#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: w_DropdownMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Style_Buttons_structs.hpp"
#include "ST_DropdownOptions_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass w_DropdownMenu.w_DropdownMenu_C
// 0x0228 (0x04F0 - 0x02C8)
class Uw_DropdownMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                btn_ClickAway;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 div_Footer;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           vb_FooterOptions;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           vb_Options;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, class FText>              Options;                                           // 0x02F8(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FString                                 SelectedOption;                                    // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_Style_Buttons                               OptionButtonStyleOld;                              // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& OptionID)> OnOptionSelected;                  // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const class FString& OptionID)> OnOptionHovered;                   // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnOptionUnhovered;                                 // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class UW_Button_C*, class FString>       OptionsMap;                                        // 0x0390(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class FString, struct FST_DropdownOptions> FooterOptions;                                   // 0x03E0(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMap<class UW_Button_C*, class FString>       FooterOptionsMap;                                  // 0x0430(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	E_Style_Buttons                               FooterButtonStyle;                                 // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& OptionID)> OnFooterOptionSelected;            // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const class FString& OptionID)> OnFooterOptionHovered;             // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFooterOptionUnhovered;                           // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnClickaway;                                       // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        DropdownMaxHeigh;                                  // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         CharacterLimit;                                    // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UW_Button_C* DesiredFocus)> OnDesiredFocusSet;               // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 OptionButtonStyle;                                 // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__w_DropdownMenu_btn_Clickaway_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void CreateFooterButton(const class FString& FooterOptionID);
	void CreateOptionButton(const class FString& OptionID, class UW_Button_C** NewOptionButton);
	void ExecuteUbergraph_w_DropdownMenu(int32 EntryPoint);
	void FooterOptionClicked(class UW_Button_C* Button);
	void FooterOptionHovered(class UW_Button_C* Button);
	void FooterOptionUnhovered();
	void OptionClicked(class UW_Button_C* Button);
	void OptionHovered(class UW_Button_C* Button);
	void OptionUnhovered();
	void PopulateOptions(const TMap<class FString, class FText>& Options_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("w_DropdownMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"w_DropdownMenu_C")
	}
	static class Uw_DropdownMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uw_DropdownMenu_C>();
	}
};
DUMPER7_ASSERTS_Uw_DropdownMenu_C;

}

