#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ExfilOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ExfilOverlay.W_ExfilOverlay_C
// 0x0038 (0x0300 - 0x02C8)
class UW_ExfilOverlay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_176;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardModal_C*                     W_StandardModal;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnExfilClicked;                                    // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCancelClicked;                                   // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__W_ExfilOverlay_W_StandardModal_K2Node_ComponentBoundEvent_0_OnOkClicked__DelegateSignature(class UW_StandardModal_C* CallingModal, const class FText& TextEntry);
	void BndEvt__W_ExfilOverlay_W_StandardModal_K2Node_ComponentBoundEvent_1_CancelClickedDelegate__DelegateSignature(class UStandardModal* CallingModal);
	void Construct();
	void ExecuteUbergraph_W_ExfilOverlay(int32 EntryPoint);
	void SetNumMissingSwat(int32 MissingSwat, bool bMissionSoftComplete);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ExfilOverlay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ExfilOverlay_C")
	}
	static class UW_ExfilOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ExfilOverlay_C>();
	}
};
DUMPER7_ASSERTS_UW_ExfilOverlay_C;

}

