#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FireMode

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FireMode.W_FireMode_C
// 0x0118 (0x03E0 - 0x02C8)
class UW_FireMode_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 FireMode_Icon_Image;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              txt_Firemode;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            Icon;                                              // 0x02E0(0x00D0)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FLinearColor                           SelectedColor;                                     // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   FireModeText;                                      // 0x03C0(0x0018)(Edit, BlueprintVisible)

public:
	void Deselect();
	void ExecuteUbergraph_W_FireMode(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Select();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_FireMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_FireMode_C")
	}
	static class UW_FireMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_FireMode_C>();
	}
};
DUMPER7_ASSERTS_UW_FireMode_C;

}

