#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FooterInputActionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_Style_Buttons_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FooterInputActionButton.W_FooterInputActionButton_C
// 0x0580 (0x1B70 - 0x15F0)
class UW_FooterInputActionButton_C final : public UCommonFooterButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_MultiAction;                                    // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               InputAction;                                       // 0x1600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              InputActionMultiSwitcher;                          // 0x1608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               InputActionPC;                                     // 0x1610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              txt_ButtonLabel;                                   // 0x1618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       txt_InputLabel;                                    // 0x1620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       txt_Label;                                         // 0x1628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_InputAction_C*                       W_InputAction;                                     // 0x1630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonLabelText;                                   // 0x1638(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	E_Style_Buttons                               SelectButtonStyle;                                 // 0x1650(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1651[0x7];                                     // 0x1651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             StyleGuide;                                        // 0x1658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x1660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1661[0x7];                                     // 0x1661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UW_Button_C* Button)> Clicked;                               // 0x1668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_Button_C* Button)> Hovered;                               // 0x1678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Unhovered;                                         // 0x1688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Pressed;                                           // 0x1698(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_Button_C* Button)> DoubleClicked;                         // 0x16A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         FontSizeOverride;                                  // 0x16B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16BC[0x4];                                     // 0x16BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             DescriptionWidget;                                 // 0x16C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceUppercaseDescription;                         // 0x16C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C9[0x7];                                     // 0x16C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DescriptionText;                                   // 0x16D0(0x0018)(Edit, BlueprintVisible)
	bool                                          StartActive;                                       // 0x16E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartActiveDisabled;                               // 0x16E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16EA[0x2];                                     // 0x16EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CharacterLimit;                                    // 0x16EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTextBlockStyle                        Widget_Style;                                      // 0x16F0(0x0340)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            HoveredButtonStyle;                                // 0x1A30(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              Released;                                          // 0x1B00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_Button_C* Button)> Selected;                              // 0x1B10(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_Button_C* Button)> Deselected;                            // 0x1B20(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EHorizontalAlignment                          ContentHorizontalAlignment;                        // 0x1B30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            ContentVerticalAlignment;                          // 0x1B31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B32[0x6];                                     // 0x1B32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UW_Button_C* Button)> OnRightMousePressed;                   // 0x1B38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRightMouseReleased;                              // 0x1B48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FDataTableRowHandle>            CurrentMultiInputActions;                          // 0x1B58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__W_FooterInputActionButton_W_InputAction_K2Node_ComponentBoundEvent_0_OnInputActionSetNotFound__DelegateSignature(class UW_InputAction_C* TriggeringInputActionWidget);
	void BndEvt__W_FooterInputActionButton_W_InputAction_K2Node_ComponentBoundEvent_1_OnInputActionWidgetUpdated__DelegateSignature();
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnDoubleClicked();
	void BP_OnHovered();
	void BP_OnReleased();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void Deselect();
	void DisableInteraction(bool Disable);
	void Enable(bool Enable_0);
	void EventOnPressed(class UCommonButtonBase* Button);
	void EventOnReleased(class UCommonButtonBase* Button);
	void ExecuteUbergraph_W_FooterInputActionButton(int32 EntryPoint);
	void ForceClick();
	void ForceDoubleClick();
	void HideHotkeyInput();
	void IgnoreInteraction(bool Ignore);
	void InitContent();
	void Initialize();
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnCurrentTextStyleChanged();
	void OnInputChanged(ECommonInputType bNewInputType);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnPressed();
	void PassthroughInteraction(bool PassThrough);
	void PreConstruct(bool IsDesignTime);
	void RightMousePressed();
	void RightMouseReleased();
	void Select();
	void Set_Action_Name(const class FText& Action_Name);
	void SetBackgroundTint(const struct FLinearColor& InBackgroundColor);
	void SetButtonText(const class FText& Text);
	void SetInputActions(TArray<struct FDataTableRowHandle>& InputActions);
	void SetMultiInputAction(TArray<struct FDataTableRowHandle>& InputActions, bool IsCombo);
	void ShowHotkeyInput();
	void TruncateText(bool Truncate, int32 CharacterLimit_0, const class FString& TruncationCharacters);

	class UCommonTextBlock* BP_GetButtonLabel() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_FooterInputActionButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_FooterInputActionButton_C")
	}
	static class UW_FooterInputActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_FooterInputActionButton_C>();
	}
};
DUMPER7_ASSERTS_UW_FooterInputActionButton_C;

}

