#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HelicopterHeadingTape

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_HelicopterHeadingTape.W_HelicopterHeadingTape_C.ExecuteUbergraph_W_HelicopterHeadingTape
// 0x0020 (0x0020 - 0x0000)
struct W_HelicopterHeadingTape_C_ExecuteUbergraph_W_HelicopterHeadingTape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Degree;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_HelicopterHeadingTape_C_ExecuteUbergraph_W_HelicopterHeadingTape;

// Function W_HelicopterHeadingTape.W_HelicopterHeadingTape_C.UpdateHeading
// 0x0008 (0x0008 - 0x0000)
struct W_HelicopterHeadingTape_C_UpdateHeading final
{
public:
	double                                        Degree;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_HelicopterHeadingTape_C_UpdateHeading;

}

