#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Hotkeys

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Hotkeys.W_Hotkeys_C.ExecuteUbergraph_W_Hotkeys
// 0x00B0 (0x00B0 - 0x0000)
struct W_Hotkeys_C_ExecuteUbergraph_W_Hotkeys final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AReadyOrNotCharacter* Character, class ABaseItem* LastItemBeforeQuickThrow, class ABaseItem* QuickThrowGrenade)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABaseItem* QuickThrowGrenade)> K2Node_CreateDelegate_OutputDelegate_1;      // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bUsingSecondarySight, class ABaseMagazineWeapon* Weapon)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AReadyOrNotCharacter* Character, bool bOn)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotCharacter*                   K2Node_CustomEvent_Character_1;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseItem*                              K2Node_CustomEvent_LastItemBeforeQuickThrow;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseItem*                              K2Node_CustomEvent_QuickThrowGrenade_1;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseItem*                              K2Node_CustomEvent_QuickThrowGrenade;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bUsingSecondarySight;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseMagazineWeapon*                    K2Node_CustomEvent_Weapon;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotCharacter*                   K2Node_CustomEvent_Character;                      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bOn;                            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EquippedWeaponHasLaserAttachment_ReturnValue; // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EquippedWeaponHasLightAttachment_ReturnValue; // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Hotkeys_C_ExecuteUbergraph_W_Hotkeys;

// Function W_Hotkeys.W_Hotkeys_C.OnNightVisionGogglesToggled_Event_0
// 0x0010 (0x0010 - 0x0000)
struct W_Hotkeys_C_OnNightVisionGogglesToggled_Event_0 final
{
public:
	class AReadyOrNotCharacter*                   Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bOn;                                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Hotkeys_C_OnNightVisionGogglesToggled_Event_0;

// Function W_Hotkeys.W_Hotkeys_C.OnQuickThrowEnd_Event_0
// 0x0008 (0x0008 - 0x0000)
struct W_Hotkeys_C_OnQuickThrowEnd_Event_0 final
{
public:
	class ABaseItem*                              QuickThrowGrenade;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Hotkeys_C_OnQuickThrowEnd_Event_0;

// Function W_Hotkeys.W_Hotkeys_C.OnQuickThrowStart_Event_0
// 0x0018 (0x0018 - 0x0000)
struct W_Hotkeys_C_OnQuickThrowStart_Event_0 final
{
public:
	class AReadyOrNotCharacter*                   Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseItem*                              LastItemBeforeQuickThrow;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABaseItem*                              QuickThrowGrenade;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Hotkeys_C_OnQuickThrowStart_Event_0;

// Function W_Hotkeys.W_Hotkeys_C.OnSecondarySightToggled_Event_0
// 0x0010 (0x0010 - 0x0000)
struct W_Hotkeys_C_OnSecondarySightToggled_Event_0 final
{
public:
	bool                                          bUsingSecondarySight;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseMagazineWeapon*                    Weapon;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Hotkeys_C_OnSecondarySightToggled_Event_0;

}

