#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HotkeyBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "st_HotkeySettings_structs.hpp"
#include "W_SubMenu_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_HotkeyBar.W_HotkeyBar_C
// 0x0040 (0x0490 - 0x0450)
class UW_HotkeyBar_C final : public UW_SubMenu_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_W_HotkeyBar_C;                      // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BackgroundBlur_0;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Bindings;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HotkeyBar_Entry_C*                   W_HotkeyBar_Entry;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct Fst_HotkeySettings>             Hotkeys;                                           // 0x0470(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(const class FString& HotkeyID)> OnHotkeyClicked;                   // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_W_HotkeyBar(int32 EntryPoint);
	void HotkeyButtonClicked(class UW_HotkeyBar_Entry_C* TriggeringHotkeyEntry);
	void PreConstruct(bool IsDesignTime);
	void UpdateHints(const TArray<struct Fst_HotkeySettings>& Hotkeys_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_HotkeyBar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_HotkeyBar_C")
	}
	static class UW_HotkeyBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_HotkeyBar_C>();
	}
};
DUMPER7_ASSERTS_UW_HotkeyBar_C;

}

