#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InitialOptions_Gamma

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_InitialOptions_Gamma.W_InitialOptions_Gamma_C.DoCustomNavigation
// 0x0010 (0x0010 - 0x0000)
struct W_InitialOptions_Gamma_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_InitialOptions_Gamma_C_DoCustomNavigation;

// Function W_InitialOptions_Gamma.W_InitialOptions_Gamma_C.ExecuteUbergraph_W_InitialOptions_Gamma
// 0x0004 (0x0004 - 0x0000)
struct W_InitialOptions_Gamma_C_ExecuteUbergraph_W_InitialOptions_Gamma final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_InitialOptions_Gamma_C_ExecuteUbergraph_W_InitialOptions_Gamma;

// Function W_InitialOptions_Gamma.W_InitialOptions_Gamma_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_InitialOptions_Gamma_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_InitialOptions_Gamma_C_BP_GetDesiredFocusTarget;

}

