#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemSelection_ItemGroupList_V2

#include "Basic.hpp"

#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemSelection_ItemGroupList_V2.W_ItemSelection_ItemGroupList_V2_C
// 0x0048 (0x0338 - 0x02F0)
class UW_ItemSelection_ItemGroupList_V2_C final : public UBaseWidget
{
public:
	class UHorizontalBox*                         ItemList_Container;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_V2_C*        W_ItemSelection_ItemGroup_V2;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_V2_C*        W_ItemSelection_ItemGroup_V2_1;                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_V2_C*        W_ItemSelection_ItemGroup_V2_2;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_V2_C*        W_ItemSelection_ItemGroup_V2_3;                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_V2_C*        W_ItemSelection_ItemGroup_V2_4;                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_V2_C*        W_ItemSelection_ItemGroup_V2_5;                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UW_ItemSelection_ItemList_V2_C*> ItemLists;                                         // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void FadeOutAllExcept(int32 Index_0);
	void Initialize(TArray<struct FItemSelectionGroup>& InItemGroupArray);
	void ResetAnimationState();
	void SelectCategory(int32 GroupIndex, int32 CategoryIndex);
	void SelectList(int32 Index_0);
	void UpdateKeybinds(TArray<struct FItemSelectionGroup>& InItemGroups);

	void Get_List_At_Index(int32 Index_0, class UW_ItemSelection_ItemList_V2_C** Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ItemSelection_ItemGroupList_V2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ItemSelection_ItemGroupList_V2_C")
	}
	static class UW_ItemSelection_ItemGroupList_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ItemSelection_ItemGroupList_V2_C>();
	}
};
DUMPER7_ASSERTS_UW_ItemSelection_ItemGroupList_V2_C;

}

