#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemSelection_ItemList_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemSelection_ItemList_V2.W_ItemSelection_ItemList_V2_C
// 0x0088 (0x0378 - 0x02F0)
class UW_ItemSelection_ItemList_V2_C final : public UBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOut;                                      // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_V2_C*        ItemGroup;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Items;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Main;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FItemSelectionGroup                    ItemSelectionGroup;                                // 0x0318(0x0048)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bIsLastGroup;                                      // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectionIndex;                                    // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_ItemSelection_Item_C*>        ItemWidgets;                                       // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ConfirmSelection();
	void CreateItem(EItemCategory InItemCategory, class ABaseItem* InItem);
	void ExecuteUbergraph_W_ItemSelection_ItemList_V2(int32 EntryPoint);
	void FadeOut();
	void FadeOutAll();
	void FadeOutAllExcept(int32 Index_0);
	void Focus();
	void HideList(bool bPlaySound);
	void Initialize();
	void OnAnimSelectFinished();
	void PopulateList();
	void PreConstruct(bool IsDesignTime);
	void Select(int32 Index_0);
	void ShowList(bool bPlaySound);
	void Unfocus();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ItemSelection_ItemList_V2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ItemSelection_ItemList_V2_C")
	}
	static class UW_ItemSelection_ItemList_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ItemSelection_ItemList_V2_C>();
	}
};
DUMPER7_ASSERTS_UW_ItemSelection_ItemList_V2_C;

}

