#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemSelectionMenu

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemSelectionMenu.W_ItemSelectionMenu_C
// 0x0118 (0x0408 - 0x02F0)
class UW_ItemSelectionMenu_C final : public UBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SlideIn;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_DebugInfoContainer_C*                DebugInfoContainer_Menu;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroupList_C*       ItemGroupList;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        MouseWheelDelta;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   OpeningMenuKey;                                    // 0x0320(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FKey                                   PreviousMenuTriggerKey;                            // 0x0338(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FKey>                           MenuOpenKeyTriggers;                               // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FItemSelectionGroup>            ItemGroups;                                        // 0x0360(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bInitialized;                                      // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedColumn;                                    // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFadedOut;                                         // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       PlayerCharacter;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsActive;                                         // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TH_FadeOut;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<struct FKey, int32>                      QueuedSelections;                                  // 0x0398(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         OpenMenuTriggerCount;                              // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TH_FadeOutSelected;                                // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnMenuOpened;                                      // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CanNavigate(bool* Return_Value);
	void CloseMenu();
	void CustomEvent_0();
	void ExecuteSelection(int32 Index_0);
	void ExecuteUbergraph_W_ItemSelectionMenu(int32 EntryPoint);
	void FadeOutSelectedColumn();
	void HideMenu();
	void Initialize(bool bForce, const TArray<struct FItemSelectionGroup>& InItemSelectionGroups);
	void IsOpen(bool* Return_Value);
	void OnFadeOutFinished();
	void OnInitialized();
	void OnWeaponMagCheck_Event_0(class ABaseMagazineWeapon* MagazineWeapon);
	void OpenMenu(const struct FKey& TriggerKey);
	void PreConstruct(bool IsDesignTime);
	void QueuedExecuteSelection();
	void RemoveItemFromMenu(class ABaseItem* ItemToRemove, int32 List_Index);
	void ResetAnimationFadeOutState();
	void SetMouseWheelDelta(double NewMouseWheelDelta);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	bool UpdateDebugInfo();

	void CanQueueSelection(bool* Return_Value) const;
	void FindColumnIndexFromItem(class ABaseItem* InItem, int32* Return_Value) const;
	void FindItemFromColumnIndex(class UW_ItemSelection_ItemList_C** Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ItemSelectionMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ItemSelectionMenu_C")
	}
	static class UW_ItemSelectionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ItemSelectionMenu_C>();
	}
};
DUMPER7_ASSERTS_UW_ItemSelectionMenu_C;

}

