#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemSelection_ItemGroupList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemSelection_ItemGroupList.W_ItemSelection_ItemGroupList_C
// 0x0078 (0x0368 - 0x02F0)
class UW_ItemSelection_ItemGroupList_C final : public UBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ItemList_Container;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_C*           W_ItemSelection_ItemGroup_1;                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_C*           W_ItemSelection_ItemGroup_2;                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_C*           W_ItemSelection_ItemGroup_3;                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_C*           W_ItemSelection_ItemGroup_4;                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_C*           W_ItemSelection_ItemGroup_5;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemSelection_ItemGroup_C*           W_ItemSelection_ItemGroup_74;                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedColumn;                                    // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousSelectedColumn;                            // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_ItemSelection_ItemList_C*>    ItemLists;                                         // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FItemSelectionGroup>            ItemGroups;                                        // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APlayerCharacter*                       PlayerCharacter;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bNVGOn;                                            // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CreateNewItemList(TArray<class ABaseItem*>& Items, int32 Index_0, class UW_ItemSelection_ItemList_C** Return_Value);
	void Event_FocusAll();
	void Event_UnfocusAll();
	void ExecuteUbergraph_W_ItemSelection_ItemGroupList(int32 EntryPoint);
	void FadeInAllItemLists();
	void FadeInMagCount();
	void FadeInOverview();
	void FadeOutAllItemLists();
	void FadeOutMagCount();
	void FadeOutOverview();
	void FocusAll(bool bForce);
	void Initialize(TArray<struct FItemSelectionGroup>& InItemGroupArray);
	void Next();
	void OnInitialized();
	void OnInputReleased();
	void OnNightVisionGogglesToggled_Event_0(bool bNVGOn_0);
	void Previous();
	void SelectColumn(int32 Index_0);
	void SplitItemList(bool bSplit);
	void UnfocusAll(bool bForce);
	void UpdateKeybinds(TArray<struct FItemSelectionGroup>& InItemGroups);

	void GetListAtColumnIndex(int32 Index_0, class UW_ItemSelection_ItemList_C** Return_Value) const;
	void IsInsideList(bool* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ItemSelection_ItemGroupList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ItemSelection_ItemGroupList_C")
	}
	static class UW_ItemSelection_ItemGroupList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ItemSelection_ItemGroupList_C>();
	}
};
DUMPER7_ASSERTS_UW_ItemSelection_ItemGroupList_C;

}

