#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LobbyAreaPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LobbyAreaPopup.W_LobbyAreaPopup_C
// 0x0040 (0x0308 - 0x02C8)
class UW_LobbyAreaPopup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutEverything;                                 // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInEverything;                                  // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             PopupText;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          WaitForMatchStartInformation;                      // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnGameStarted();
	void OnFadeOutCompleted();
	struct FLinearColor GetColorAndOpacity_0();
	ESlateVisibility Get_RoundCount_Visibility_0();
	class FText Get_RoundCount_Text_0();
	class FText DisplayText();
	void Construct();
	void ExecuteUbergraph_W_LobbyAreaPopup(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_LobbyAreaPopup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_LobbyAreaPopup_C")
	}
	static class UW_LobbyAreaPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LobbyAreaPopup_C>();
	}
};
DUMPER7_ASSERTS_UW_LobbyAreaPopup_C;

}

