#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Loadout_Page_Preset

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Loadout_Page_Preset.W_Loadout_Page_Preset_C
// 0x0118 (0x0530 - 0x0418)
class UW_Loadout_Page_Preset_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Loadout_UnitSelect_C*                UnitSelect;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_Presets;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, class FText>              Options;                                           // 0x0430(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UCommonButtonBase*, class FString> OptionsMap;                                        // 0x0480(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FString                                 Selected_Option;                                   // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnDefaultPresetSelected;                           // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const class FString& Name)> OnPresetSelected;                      // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPresetEquipped;                                  // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonButtonBase*                      Equipped_Preset;                                   // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bCustomization;                                    // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& Name)> OnCustomizationPresetHovered;          // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Add_New_Preset(class UCommonButtonBase* Button);
	void Add_Presets_to_List();
	void BndEvt__W_Loadout_Page_Preset_UnitSelect_K2Node_ComponentBoundEvent_0_OnEquippingUnitSelected__DelegateSignature(const struct FST_EquippingUnit& EquippingUnitInfo);
	void BndEvt__W_Loadout_Page_Preset_UnitSelect_K2Node_ComponentBoundEvent_1_OnCarouselNext__DelegateSignature();
	void BndEvt__W_Loadout_Page_Preset_UnitSelect_K2Node_ComponentBoundEvent_2_OnCarouselPrevious__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	bool BP_OnHandleBackAction();
	void Construct();
	void Create_New_Preset_Button();
	void Create_Preset_Option(const class FString& Preset_ID, class UCommonButton_C** FocusButton);
	void Customization_Preset_Deleted(const class FText& PresetName);
	bool Customization_Preset_Exists();
	void Equip_Selected_Preset(class UWidget* Selected_Button);
	void ExecuteUbergraph_W_Loadout_Page_Preset(int32 EntryPoint);
	void HeaderSubpageNavigation(class FName OptionNameID);
	void InputMethodChanged(ECommonInputType bNewInputType);
	void New_Preset_Hovered(class UCommonButtonBase* Button);
	void Option_Clicked(class UCommonButtonBase* Button);
	void Option_Hovered(class UCommonButtonBase* Button);
	void Populate_Presets();
	void Preset_Deleted(const class FText& PresetName);
	bool Preset_Exists();
	void Preset_List_Updated();
	void Set_Current_Unit();
	void Set_Equipped_Preset_By_Swat_Member(EEquippingSwat NewParam);
	void Unequip_Preset_If_Deleted(EEquippingSwat CurrentSwat);
	void UpdateActiveLoadout(const struct FSavedLoadout& ActiveLoadout);
	void UpdateCurrentItemMap(const TMap<EItemCategory, class UClass*>& ItemCategory);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Loadout_Page_Preset_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Loadout_Page_Preset_C")
	}
	static class UW_Loadout_Page_Preset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Loadout_Page_Preset_C>();
	}
};
DUMPER7_ASSERTS_UW_Loadout_Page_Preset_C;

}

