#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadingScreen.W_LoadingScreen_C
// 0x0058 (0x0568 - 0x0510)
class UW_LoadingScreen_C final : public ULoadingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LoadingPercentText;                                // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingSpinner;                                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tips;                                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PageWrapper_C*                       W_PageWrapper;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Out_Map;                                           // 0x0540(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Out_Mode;                                          // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsConsole;                                         // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_LoadingScreen(int32 EntryPoint);
	class FText Get_ServerName_Text_0();
	class FText Get_TextLoading_Text_0();
	class FText GetLoadingProgressText();
	class FText GetText_0();
	void PreConstruct(bool IsDesignTime);
	void SetLoadingScreenConsole();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateHeaderText();
	void UpdateLoadingScreenPercentage(double NewPercentage);
	void UpdateTips();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_LoadingScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_LoadingScreen_C")
	}
	static class UW_LoadingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LoadingScreen_C>();
	}
};
DUMPER7_ASSERTS_UW_LoadingScreen_C;

}

