#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu_Overlay

#include "Basic.hpp"

#include "ReadyOrNot_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_MainMenu_Overlay.W_MainMenu_Overlay_C.BndEvt__W_MainMenu_Overlay_FriendsList_K2Node_ComponentBoundEvent_0_ViewableProfileHovered__DelegateSignature
// 0x01C8 (0x01C8 - 0x0000)
struct W_MainMenu_Overlay_C_BndEvt__W_MainMenu_Overlay_FriendsList_K2Node_ComponentBoundEvent_0_ViewableProfileHovered__DelegateSignature final
{
public:
	struct FFriend                                Friend;                                            // 0x0000(0x01C8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_MainMenu_Overlay_C_BndEvt__W_MainMenu_Overlay_FriendsList_K2Node_ComponentBoundEvent_0_ViewableProfileHovered__DelegateSignature;

// Function W_MainMenu_Overlay.W_MainMenu_Overlay_C.BndEvt__W_MainMenu_Overlay_FriendsList_K2Node_ComponentBoundEvent_1_NonViewableProfileHovered__DelegateSignature
// 0x01C8 (0x01C8 - 0x0000)
struct W_MainMenu_Overlay_C_BndEvt__W_MainMenu_Overlay_FriendsList_K2Node_ComponentBoundEvent_1_NonViewableProfileHovered__DelegateSignature final
{
public:
	struct FFriend                                Friend;                                            // 0x0000(0x01C8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_MainMenu_Overlay_C_BndEvt__W_MainMenu_Overlay_FriendsList_K2Node_ComponentBoundEvent_1_NonViewableProfileHovered__DelegateSignature;

// Function W_MainMenu_Overlay.W_MainMenu_Overlay_C.ExecuteUbergraph_W_MainMenu_Overlay
// 0x0528 (0x0528 - 0x0000)
struct W_MainMenu_Overlay_C_ExecuteUbergraph_W_MainMenu_Overlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Number_of_Friends;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfFriends_Count;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_ScreenFooterEntry_C*                 K2Node_CustomEvent_FooterEntry;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFriendListEmpty_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFriendListEmpty_ReturnValue_1;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInitialOptionsSet_ReturnValue;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFriend                                K2Node_ComponentBoundEvent_Friend_1;               // 0x0028(0x01C8)()
	class FText                                   CallFunc_FormatViewProfileText_FormattedText;      // 0x01F0(0x0018)()
	struct FFriend                                K2Node_ComponentBoundEvent_Friend;                 // 0x0208(0x01C8)()
	TDelegate<void(class UW_ScreenFooterEntry_C* FooterEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x03D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHiddenEntry_ReturnValue;                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Number_of_Friends)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x03E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0404(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowEOSSocialOverlay_ReturnValue;         // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0415(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_416[0x2];                                      // 0x0416(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0418(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0430(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0448(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0498(0x0050)(HasGetValueTypeHash)
	TDelegate<void(bool Offline)>                 K2Node_CreateDelegate_OutputDelegate_4;            // 0x04E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x04F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0508(0x0018)()
	bool                                          K2Node_CustomEvent_Offline;                        // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MainMenu_Overlay_C_ExecuteUbergraph_W_MainMenu_Overlay;

// Function W_MainMenu_Overlay.W_MainMenu_Overlay_C.FooterButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct W_MainMenu_Overlay_C_FooterButtonClicked final
{
public:
	class UW_ScreenFooterEntry_C*                 FooterEntry;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MainMenu_Overlay_C_FooterButtonClicked;

// Function W_MainMenu_Overlay.W_MainMenu_Overlay_C.FriendsListUpdate
// 0x0004 (0x0004 - 0x0000)
struct W_MainMenu_Overlay_C_FriendsListUpdate final
{
public:
	int32                                         Number_of_Friends;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MainMenu_Overlay_C_FriendsListUpdate;

// Function W_MainMenu_Overlay.W_MainMenu_Overlay_C.IsFriendListEmpty
// 0x000C (0x000C - 0x0000)
struct W_MainMenu_Overlay_C_IsFriendListEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfFriends_Count;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MainMenu_Overlay_C_IsFriendListEmpty;

// Function W_MainMenu_Overlay.W_MainMenu_Overlay_C.OnFriendsListConnectionUpdate
// 0x0001 (0x0001 - 0x0000)
struct W_MainMenu_Overlay_C_OnFriendsListConnectionUpdate final
{
public:
	bool                                          Offline;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MainMenu_Overlay_C_OnFriendsListConnectionUpdate;

// Function W_MainMenu_Overlay.W_MainMenu_Overlay_C.Set EOS Button Visibility
// 0x0018 (0x0018 - 0x0000)
struct W_MainMenu_Overlay_C_Set_EOS_Button_Visibility final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEOSMultiplayerSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAccountLinked_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MainMenu_Overlay_C_Set_EOS_Button_Visibility;

}

