#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu_LargeButton_V3

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MainMenu_LargeButton_V3.W_MainMenu_LargeButton_V3_C
// 0x0100 (0x1700 - 0x1600)
class UW_MainMenu_LargeButton_V3_C final : public UMainMenu_BaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       animRedLine;                                       // 0x1608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x1610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 img_RedLine;                                       // 0x1618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MenuText;                                          // 0x1620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Selected)> OnSelected;                                        // 0x1628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSelectedAnimFinished;                            // 0x1638(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateFontInfo                         FontStyleDefault;                                  // 0x1648(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         FontStyleHovered;                                  // 0x16A0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void CustomEvent_0();
	void ExecuteUbergraph_W_MainMenu_LargeButton_V3(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void SetState(bool Hovered, bool Selected_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MainMenu_LargeButton_V3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MainMenu_LargeButton_V3_C")
	}
	static class UW_MainMenu_LargeButton_V3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MainMenu_LargeButton_V3_C>();
	}
};
DUMPER7_ASSERTS_UW_MainMenu_LargeButton_V3_C;

}

