#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu_Overlay

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MainMenu_Overlay.W_MainMenu_Overlay_C
// 0x0050 (0x0468 - 0x0418)
class UW_MainMenu_Overlay_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFriendsList_C*                         FriendsList;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CurrentUserVisualization_C*          W_CurrentUserVisualization;                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DLC_Button_C*                        W_DLC_HomeInvasion_Button;                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DLC_Button_C*                        W_DLC_Maritime_Button;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScreenFooter_C*                      W_ScreenFooter;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          WidgetStack;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidget*               MainMenu;                                          // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bFriendsListOffline;                               // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_MainMenu_Overlay_FriendsList_K2Node_ComponentBoundEvent_0_ViewableProfileHovered__DelegateSignature(const struct FFriend& Friend);
	void BndEvt__W_MainMenu_Overlay_FriendsList_K2Node_ComponentBoundEvent_1_NonViewableProfileHovered__DelegateSignature(const struct FFriend& Friend);
	void Construct();
	void ExecuteUbergraph_W_MainMenu_Overlay(int32 EntryPoint);
	void FooterButtonClicked(class UW_ScreenFooterEntry_C* FooterEntry);
	void FriendsListUpdate(int32 Number_of_Friends);
	bool IsFriendListEmpty();
	void OnFriendsListConnectionUpdate(bool Offline);
	void OnOverlayWidgetDeactivated();
	void OverlayWidgetActivated();
	void Set_EOS_Button_Visibility();
	void Switch_to_Main_Menu();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MainMenu_Overlay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MainMenu_Overlay_C")
	}
	static class UW_MainMenu_Overlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MainMenu_Overlay_C>();
	}
};
DUMPER7_ASSERTS_UW_MainMenu_Overlay_C;

}

