#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MagCheck_MagStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MagCheck_MagStatus.W_MagCheck_MagStatus_C
// 0x0060 (0x0328 - 0x02C8)
class UW_MagCheck_MagStatus_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Highlight;                                    // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AmmoTypeText;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight_Bar_Image;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MagIcon_Image;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_MagIcon;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         MagIndex;                                          // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AmmoType;                                          // 0x0300(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UMaterial*                              DefaultMaterial;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DefaultMID;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_MagCheck_MagStatus(int32 EntryPoint);
	void Highlight();
	void Init(int32 MagIndex_0, const class FText& AmmoTypeText_0, class UMaterialInstanceDynamic* Mid);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Unhighlight();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MagCheck_MagStatus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MagCheck_MagStatus_C")
	}
	static class UW_MagCheck_MagStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MagCheck_MagStatus_C>();
	}
};
DUMPER7_ASSERTS_UW_MagCheck_MagStatus_C;

}

