#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MissionEndBonus

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MissionEndBonus.W_MissionEndBonus_C
// 0x0060 (0x0328 - 0x02C8)
class UW_MissionEndBonus_C final : public UUserWidget
{
public:
	class UTextBlock*                             BonusAmount;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BonusName;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BonusScoreAmount;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BonusTxt;                                          // 0x02E0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   BonusAmountTxt;                                    // 0x02F8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   ScoreAmountTxt;                                    // 0x0310(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MissionEndBonus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MissionEndBonus_C")
	}
	static class UW_MissionEndBonus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MissionEndBonus_C>();
	}
};
DUMPER7_ASSERTS_UW_MissionEndBonus_C;

}

