#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MissionSelect_EntryPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C
// 0x00F0 (0x03B8 - 0x02C8)
class UW_MissionSelect_EntryPoint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       animShowImage;                                     // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       animReveal;                                        // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_Button_C*                            ButtonBase;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       img_EntryPreview;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Size_EntryPointPreview;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UW_MissionSelect_EntryPoint_C* Widget)> OnClicked;           // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FEntryPoint                            EntryPoint;                                        // 0x0308(0x00A8)(Edit, BlueprintVisible)
	bool                                          HasImage;                                          // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BackPage(bool* Handled);
	void BndEvt__W_MissionSelect_EntryPoint_ButtonBase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ChangePage(class FName PageName);
	void Construct();
	void Deselect();
	void ExecuteUbergraph_W_MissionSelect_EntryPoint(int32 EntryPoint_0);
	void ForceClick();
	void Hide(double Delay, bool Collapse);
	void Reveal(double Delay);
	void Select();
	void SequenceEvent__ENTRYPOINTW_MissionSelect_EntryPoint();
	void SetImageVisibility(ESlateVisibility InVisibility);
	void SetInputMode(bool IsGamepad);
	void SetupEntryPoint(const struct FEntryPoint& EntryPoint_0);

	void GetFocusTarget(class UWidget** Focus) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MissionSelect_EntryPoint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MissionSelect_EntryPoint_C")
	}
	static class UW_MissionSelect_EntryPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MissionSelect_EntryPoint_C>();
	}
};
DUMPER7_ASSERTS_UW_MissionSelect_EntryPoint_C;

}

