#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MissionEnd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MissionEnd.W_MissionEnd_C
// 0x0250 (0x0668 - 0x0418)
class UW_MissionEnd_C final : public UMissionEnd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Button_C*                            btn_Debrief;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            btn_Score;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_PageNav;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PageWrapper_C*                       PageWrapper;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MissionScore_C*                      W_MissionScore;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       WidgetSwitcher;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MissionName;                                       // 0x0450(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        DebriefRevealDelay;                                // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ViewingDebrief;                                    // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          DebriefEnabled;                                    // 0x0471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_RosterReview_C*                      DebriefWidget;                                     // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UW_MissionScore_C*                      ScoreWidget;                                       // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FScreenFooterEntry                     QuitFooterEntry;                                   // 0x0488(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScreenFooterEntry                     RestartFooterEntry;                                // 0x0500(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScreenFooterEntry                     StationFooterEntry;                                // 0x0578(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScreenFooterEntry                     CreditsFooterEntry;                                // 0x05F0(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddFooterOptions();
	void BackPage(bool* Handled);
	void BndEvt__W_MissionEnd_btn_Debrief_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_MissionEnd_btn_Score_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_MissionEnd_PageWrapper_K2Node_ComponentBoundEvent_7_OnFooterButtonClicked__DelegateSignature(const class FString& ButtonId);
	void BndEvt__W_MissionEnd_W_MissionScore_K2Node_ComponentBoundEvent_5_OnScoringComplete__DelegateSignature();
	void BndEvt__W_MissionEnd_W_PageHeader_K2Node_ComponentBoundEvent_6_OnNavOptionSelected__DelegateSignature(class FName OptionNameID);
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void ChangePage(class FName PageName);
	void EnableDebrief();
	void ExecuteUbergraph_W_MissionEnd(int32 EntryPoint);
	void Hide(double Delay, bool Collapse);
	void Hide_Footer_Options();
	void OnCreditsClicked();
	void OnCreditsEnd();
	void OnInitialized();
	void OpenDebriefPage();
	void OpenScorePage();
	void PreConstruct(bool IsDesignTime);
	void QuitToMenu();
	void RestartMission();
	void ReturnToStation();
	void Reveal(double Delay);
	void SetInputMode(bool IsGamepad);
	void SetupNavigation();
	void Show_Footer_Options();
	void ShowCreditsButton(bool* Show);
	bool ShowQuitButton();
	void UpdateActiveNavButton();

	class UWidget* BP_GetDesiredFocusTarget() const;
	ESlateVisibility GetDebriefButtonVisibility() const;
	void GetFocusTarget(class UWidget** Focus) const;
	ESlateVisibility GetScoreButtonVisibility() const;
	bool ShowRestartButton() const;
	bool ShowReturnButton() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MissionEnd_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MissionEnd_C")
	}
	static class UW_MissionEnd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MissionEnd_C>();
	}
};
DUMPER7_ASSERTS_UW_MissionEnd_C;

}

