#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MissionSelect_EntryPoint

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK::Params
{

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.BackPage
// 0x0001 (0x0001 - 0x0000)
struct W_MissionSelect_EntryPoint_C_BackPage final
{
public:
	bool                                          Handled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_BackPage;

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.BndEvt__W_MissionSelect_EntryPoint_ButtonBase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_MissionSelect_EntryPoint_C_BndEvt__W_MissionSelect_EntryPoint_ButtonBase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_BndEvt__W_MissionSelect_EntryPoint_ButtonBase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.ChangePage
// 0x0008 (0x0008 - 0x0000)
struct W_MissionSelect_EntryPoint_C_ChangePage final
{
public:
	class FName                                   PageName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_ChangePage;

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.ExecuteUbergraph_W_MissionSelect_EntryPoint
// 0x0100 (0x0100 - 0x0000)
struct W_MissionSelect_EntryPoint_C_ExecuteUbergraph_W_MissionSelect_EntryPoint final
{
public:
	int32                                         EntryPoint_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEntryPoint                            K2Node_CustomEvent_EntryPoint;                     // 0x0010(0x00A8)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Delay_1;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PageName;                             // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Collapse;                             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsGamepad;                            // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_ExecuteUbergraph_W_MissionSelect_EntryPoint;

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.Hide
// 0x0010 (0x0010 - 0x0000)
struct W_MissionSelect_EntryPoint_C_Hide final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Collapse;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_Hide;

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.Reveal
// 0x0008 (0x0008 - 0x0000)
struct W_MissionSelect_EntryPoint_C_Reveal final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_Reveal;

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.SetImageVisibility
// 0x0001 (0x0001 - 0x0000)
struct W_MissionSelect_EntryPoint_C_SetImageVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_SetImageVisibility;

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.SetInputMode
// 0x0001 (0x0001 - 0x0000)
struct W_MissionSelect_EntryPoint_C_SetInputMode final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_SetInputMode;

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.SetupEntryPoint
// 0x00A8 (0x00A8 - 0x0000)
struct W_MissionSelect_EntryPoint_C_SetupEntryPoint final
{
public:
	struct FEntryPoint                            EntryPoint_0;                                      // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_SetupEntryPoint;

// Function W_MissionSelect_EntryPoint.W_MissionSelect_EntryPoint_C.GetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_MissionSelect_EntryPoint_C_GetFocusTarget final
{
public:
	class UWidget*                                Focus;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionSelect_EntryPoint_C_GetFocusTarget;

}

