#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MissionScore_ScorePanel_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.BackPage
// 0x0001 (0x0001 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_BackPage final
{
public:
	bool                                          Handled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_BackPage;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.ChangePage
// 0x0008 (0x0008 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_ChangePage final
{
public:
	class FName                                   PageName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_ChangePage;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.ExecuteUbergraph_W_MissionScore_ScorePanel_Entry
// 0x0088 (0x0088 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_ExecuteUbergraph_W_MissionScore_ScorePanel_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsGamepad;                            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PageName;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Event_Receiver;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Collapse;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_ExecuteUbergraph_W_MissionScore_ScorePanel_Entry;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.Hide
// 0x0010 (0x0010 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_Hide final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Collapse;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_Hide;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.numberSound
// 0x0008 (0x0008 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_numberSound final
{
public:
	class UObject*                                Event_Receiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_numberSound;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_PreConstruct;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.Reveal
// 0x0008 (0x0008 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_Reveal final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_Reveal;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.SequenceEvent__ENTRYPOINTW_MissionScore_ScorePanel_Entry_0
// 0x0008 (0x0008 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_SequenceEvent__ENTRYPOINTW_MissionScore_ScorePanel_Entry_0 final
{
public:
	class UObject*                                Event_Receiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_SequenceEvent__ENTRYPOINTW_MissionScore_ScorePanel_Entry_0;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.SequenceEvent__ENTRYPOINTW_MissionScore_ScorePanel_Entry_2
// 0x0008 (0x0008 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_SequenceEvent__ENTRYPOINTW_MissionScore_ScorePanel_Entry_2 final
{
public:
	class UObject*                                Event_Receiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_SequenceEvent__ENTRYPOINTW_MissionScore_ScorePanel_Entry_2;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.SetCountText
// 0x0118 (0x0118 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_SetCountText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0100(0x0018)()
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_SetCountText;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.SetInputMode
// 0x0001 (0x0001 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_SetInputMode final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_SetInputMode;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.SetNameText
// 0x0010 (0x0010 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_SetNameText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_SetNameText;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.SetValueText
// 0x0060 (0x0060 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_SetValueText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class UTextBlock*                             K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0048(0x0018)()
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_SetValueText;

// Function W_MissionScore_ScorePanel_Entry.W_MissionScore_ScorePanel_Entry_C.GetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_MissionScore_ScorePanel_Entry_C_GetFocusTarget final
{
public:
	class UWidget*                                Focus;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MissionScore_ScorePanel_Entry_C_GetFocusTarget;

}

