#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MissionSelect_EntryPoint_Gamepad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MissionSelect_EntryPoint_Gamepad.W_MissionSelect_EntryPoint_Gamepad_C
// 0x00E8 (0x03B0 - 0x02C8)
class UW_MissionSelect_EntryPoint_Gamepad_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       animChangeEntryPoint;                              // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       animReveal;                                        // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonLazyImage*                       img_EntryPreview;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Size_EntryPointPreview;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UW_MissionSelect_EntryPoint_C* Widget)> OnClicked;           // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FEntryPoint                            EntryPoint;                                        // 0x0300(0x00A8)(Edit, BlueprintVisible)
	bool                                          HasImage;                                          // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BackPage(bool* Handled);
	void ChangePage(class FName PageName);
	void Construct();
	void ExecuteUbergraph_W_MissionSelect_EntryPoint_Gamepad(int32 EntryPoint_0);
	void Hide(double Delay, bool Collapse);
	void OnEntryPointChanged(const struct FEntryPoint& NewEntryPoint);
	void Reveal(double Delay);
	void SequenceEvent();
	void SequenceEvent__ENTRYPOINTW_MissionSelect_EntryPoint_Gamepad();
	void SetImageVisibility(ESlateVisibility InVisibility);
	void SetInputMode(bool IsGamepad);

	void GetFocusTarget(class UWidget** Focus) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MissionSelect_EntryPoint_Gamepad_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MissionSelect_EntryPoint_Gamepad_C")
	}
	static class UW_MissionSelect_EntryPoint_Gamepad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MissionSelect_EntryPoint_Gamepad_C>();
	}
};
DUMPER7_ASSERTS_UW_MissionSelect_EntryPoint_Gamepad_C;

}

