#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Objective

#include "Basic.hpp"

#include "ReadyOrNot_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Objective.W_Objective_C
// 0x00A8 (0x0370 - 0x02C8)
class UW_Objective_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 img_Complete;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              txt_ObjTitle;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_SubObjectiveList;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SubObjective_Entry_C*                W_SubObjective_Entry_34;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AObjective*                             Objective;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   CompleteText;                                      // 0x02F8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   FailedText;                                        // 0x0310(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 ObjectiveClass;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bSimplifiedObjectives;                             // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ObjectiveName;                                     // 0x0338(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ObjectiveDescription;                              // 0x0350(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	EObjectiveStatus                              ObjectiveStatus;                                   // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_Objective(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateDescription();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Objective_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Objective_C")
	}
	static class UW_Objective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Objective_C>();
	}
};
DUMPER7_ASSERTS_UW_Objective_C;

}

