#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OnOffButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OnOffButton.W_OnOffButton_C
// 0x00D0 (0x0398 - 0x02C8)
class UW_OnOffButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Button_C*                            btn_Toggle;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bNewCheckState)> OnValueStateChange;                          // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   EnabledText;                                       // 0x02F0(0x0018)(Edit, BlueprintVisible)
	class FText                                   DisabledText;                                      // 0x0308(0x0018)(Edit, BlueprintVisible)
	class FText                                   DescriptionText;                                   // 0x0320(0x0018)(Edit, BlueprintVisible)
	class UTextBlock*                             DescriptionWidget;                                 // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   DescriptionText_PS5Variant;                        // 0x0340(0x0018)(Edit, BlueprintVisible)
	class FText                                   EnabledText_PS5Variant;                            // 0x0358(0x0018)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   DisabledText_PS5Variant;                           // 0x0380(0x0018)(Edit, BlueprintVisible)

public:
	void BndEvt__W_OnOffButton_btn_Toggle_K2Node_ComponentBoundEvent_3_Hovered__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_OnOffButton_btn_Toggle_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_OnOffButton_btn_Toggle_K2Node_ComponentBoundEvent_5_Selected__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_OnOffButton_btn_Toggle_K2Node_ComponentBoundEvent_6_Deselected__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_OnOffButton_btn_Toggle_K2Node_ComponentBoundEvent_7_Unhovered__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_OnOffButton(int32 EntryPoint);
	bool IsPS5TextValid(const class FText& InputString);
	void PreConstruct(bool IsDesignTime);
	void SetCheckedState(bool NewChecked);
	void SetDisabledText(const class FText& EnabledText_0);
	void SetEnabledText(const class FText& EnabledText_0);
	void SetupDescription();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_OnOffButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_OnOffButton_C")
	}
	static class UW_OnOffButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_OnOffButton_C>();
	}
};
DUMPER7_ASSERTS_UW_OnOffButton_C;

}

