#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_Button_With_Status

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_Button_With_Status.W_Options_Button_With_Status_C
// 0x0088 (0x0388 - 0x0300)
class UW_Options_Button_With_Status_C final : public UOptionsButtonWithStatus
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 InteractiveNotSelected;                            // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 NotInteractiveNotSelected;                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 NotInteractiveSelected;                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DefaultButtonStyle;                                // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LockedButtonStyle;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnButtonClicked;                                   // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool NewCheckState)> OnValueChange;                                // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonText;                                        // 0x0350(0x0018)(Edit, BlueprintVisible)
	bool                                          ButtonIsToggleable;                                // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonDescription;                                 // 0x0370(0x0018)(Edit, BlueprintVisible)

public:
	void BndEvt__W_Options_Button_With_Status_Button_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature(class UW_Button_C* Button_0);
	void BndEvt__W_Options_Button_With_Status_Button_K2Node_ComponentBoundEvent_1_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void ButtonClicked();
	void Construct();
	void ExecuteUbergraph_W_Options_Button_With_Status(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Checked(bool Checked);
	void Set_Status(const class FText& Status);
	void SetCheckedState(bool bChecked);
	void SetWidgetStatus(const class FText& NewStatus);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Options_Button_With_Status_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Options_Button_With_Status_C")
	}
	static class UW_Options_Button_With_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Options_Button_With_Status_C>();
	}
};
DUMPER7_ASSERTS_UW_Options_Button_With_Status_C;

}

