#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_Graphics_UE5

#include "Basic.hpp"

#include "SGraphicPreset_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.AdaptUIScaleValueForPlatform
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_AdaptUIScaleValueForPlatform final
{
public:
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_AdaptUIScaleValueForPlatform;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_AAQuality_K2Node_ComponentBoundEvent_25_OnQualityValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_AAQuality_K2Node_ComponentBoundEvent_25_OnQualityValueChanged__DelegateSignature final
{
public:
	int32                                         NewQualityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_AAQuality_K2Node_ComponentBoundEvent_25_OnQualityValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_DLSSQuality_K2Node_ComponentBoundEvent_84_OnDlssValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_DLSSQuality_K2Node_ComponentBoundEvent_84_OnDlssValueChanged__DelegateSignature final
{
public:
	int32                                         NewIntegerValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_DLSSQuality_K2Node_ComponentBoundEvent_84_OnDlssValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_EffectsQuality_K2Node_ComponentBoundEvent_26_OnQualityValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_EffectsQuality_K2Node_ComponentBoundEvent_26_OnQualityValueChanged__DelegateSignature final
{
public:
	int32                                         NewQualityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_EffectsQuality_K2Node_ComponentBoundEvent_26_OnQualityValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_FrameLimiter_K2Node_ComponentBoundEvent_60_OnIntegralValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_FrameLimiter_K2Node_ComponentBoundEvent_60_OnIntegralValueChanged__DelegateSignature final
{
public:
	int32                                         NewIntegerValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_FrameLimiter_K2Node_ComponentBoundEvent_60_OnIntegralValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_OptiwandFPS_K2Node_ComponentBoundEvent_28_OnIntegralValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_OptiwandFPS_K2Node_ComponentBoundEvent_28_OnIntegralValueChanged__DelegateSignature final
{
public:
	int32                                         NewIntegerValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_OptiwandFPS_K2Node_ComponentBoundEvent_28_OnIntegralValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_OptiwandScale_K2Node_ComponentBoundEvent_29_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_OptiwandScale_K2Node_ComponentBoundEvent_29_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_OptiwandScale_K2Node_ComponentBoundEvent_29_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_PPQuality_K2Node_ComponentBoundEvent_24_OnQualityValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_PPQuality_K2Node_ComponentBoundEvent_24_OnQualityValueChanged__DelegateSignature final
{
public:
	int32                                         NewQualityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_PPQuality_K2Node_ComponentBoundEvent_24_OnQualityValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_ShadowQuality_K2Node_ComponentBoundEvent_23_OnQualityValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_ShadowQuality_K2Node_ComponentBoundEvent_23_OnQualityValueChanged__DelegateSignature final
{
public:
	int32                                         NewQualityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_ShadowQuality_K2Node_ComponentBoundEvent_23_OnQualityValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_TextureQuality_K2Node_ComponentBoundEvent_22_OnQualityValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_TextureQuality_K2Node_ComponentBoundEvent_22_OnQualityValueChanged__DelegateSignature final
{
public:
	int32                                         NewQualityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_TextureQuality_K2Node_ComponentBoundEvent_22_OnQualityValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__AdvGraphics_Slider_ViewDistance_K2Node_ComponentBoundEvent_27_OnQualityValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_ViewDistance_K2Node_ComponentBoundEvent_27_OnQualityValueChanged__DelegateSignature final
{
public:
	int32                                         NewQualityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__AdvGraphics_Slider_ViewDistance_K2Node_ComponentBoundEvent_27_OnQualityValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__Options_Slider_TeamView_PIP_FPS_K2Node_ComponentBoundEvent_86_OnIntegralValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__Options_Slider_TeamView_PIP_FPS_K2Node_ComponentBoundEvent_86_OnIntegralValueChanged__DelegateSignature final
{
public:
	int32                                         NewIntegerValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__Options_Slider_TeamView_PIP_FPS_K2Node_ComponentBoundEvent_86_OnIntegralValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__SimpleGraphics_Slider_Resolution_K2Node_ComponentBoundEvent_19_OnResolutionValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__SimpleGraphics_Slider_Resolution_K2Node_ComponentBoundEvent_19_OnResolutionValueChanged__DelegateSignature final
{
public:
	class FString                                 NewResolutionValue;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__SimpleGraphics_Slider_Resolution_K2Node_ComponentBoundEvent_19_OnResolutionValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__SimpleGraphics_Slider_ResolutionScale_K2Node_ComponentBoundEvent_57_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__SimpleGraphics_Slider_ResolutionScale_K2Node_ComponentBoundEvent_57_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__SimpleGraphics_Slider_ResolutionScale_K2Node_ComponentBoundEvent_57_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__SimpleGraphics_Slider_SafeZone_X_K2Node_ComponentBoundEvent_82_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__SimpleGraphics_Slider_SafeZone_X_K2Node_ComponentBoundEvent_82_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__SimpleGraphics_Slider_SafeZone_X_K2Node_ComponentBoundEvent_82_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__SimpleGraphics_Slider_SafeZone_Y_K2Node_ComponentBoundEvent_83_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__SimpleGraphics_Slider_SafeZone_Y_K2Node_ComponentBoundEvent_83_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__SimpleGraphics_Slider_SafeZone_Y_K2Node_ComponentBoundEvent_83_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_DepthOfFieldChoice_K2Node_ComponentBoundEvent_55_OnCheckStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_DepthOfFieldChoice_K2Node_ComponentBoundEvent_55_OnCheckStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_DepthOfFieldChoice_K2Node_ComponentBoundEvent_55_OnCheckStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_MeshPaitingChoice_K2Node_ComponentBoundEvent_56_OnCheckStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_MeshPaitingChoice_K2Node_ComponentBoundEvent_56_OnCheckStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_MeshPaitingChoice_K2Node_ComponentBoundEvent_56_OnCheckStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Gameplay_UE5_Options_OptiwandViewMode_K2Node_ComponentBoundEvent_22_OnPageIndexChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Gameplay_UE5_Options_OptiwandViewMode_K2Node_ComponentBoundEvent_22_OnPageIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Gameplay_UE5_Options_OptiwandViewMode_K2Node_ComponentBoundEvent_22_OnPageIndexChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_AdvGraphics_Slider_GlobalIllumination_K2Node_ComponentBoundEvent_7_OnQualityValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_AdvGraphics_Slider_GlobalIllumination_K2Node_ComponentBoundEvent_7_OnQualityValueChanged__DelegateSignature final
{
public:
	int32                                         NewQualityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_AdvGraphics_Slider_GlobalIllumination_K2Node_ComponentBoundEvent_7_OnQualityValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_AdvGraphics_Slider_ReflectionQuality_K2Node_ComponentBoundEvent_8_OnQualityValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_AdvGraphics_Slider_ReflectionQuality_K2Node_ComponentBoundEvent_8_OnQualityValueChanged__DelegateSignature final
{
public:
	int32                                         NewQualityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_AdvGraphics_Slider_ReflectionQuality_K2Node_ComponentBoundEvent_8_OnQualityValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_CommonActionWidget_47_K2Node_ComponentBoundEvent_5_OnInputMethodChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_CommonActionWidget_47_K2Node_ComponentBoundEvent_5_OnInputMethodChanged__DelegateSignature final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_CommonActionWidget_47_K2Node_ComponentBoundEvent_5_OnInputMethodChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_Options_Gamepad_MotionBlurScale_K2Node_ComponentBoundEvent_9_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_Options_Gamepad_MotionBlurScale_K2Node_ComponentBoundEvent_9_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_Options_Gamepad_MotionBlurScale_K2Node_ComponentBoundEvent_9_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_Options_Gamepad_UIScale_K2Node_ComponentBoundEvent_2_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_Options_Gamepad_UIScale_K2Node_ComponentBoundEvent_2_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_Options_Gamepad_UIScale_K2Node_ComponentBoundEvent_2_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_Options_OnOff_TeamViewFPS_K2Node_ComponentBoundEvent_3_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_Options_OnOff_TeamViewFPS_K2Node_ComponentBoundEvent_3_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_Options_OnOff_TeamViewFPS_K2Node_ComponentBoundEvent_3_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Brightness_Slider_1_K2Node_ComponentBoundEvent_12_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Brightness_Slider_1_K2Node_ComponentBoundEvent_12_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Brightness_Slider_1_K2Node_ComponentBoundEvent_12_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Brightness_Slider_K2Node_ComponentBoundEvent_11_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Brightness_Slider_K2Node_ComponentBoundEvent_11_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Brightness_Slider_K2Node_ComponentBoundEvent_11_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Carousel_InterfaceAspectRatio_K2Node_ComponentBoundEvent_6_OnPageIndexChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Carousel_InterfaceAspectRatio_K2Node_ComponentBoundEvent_6_OnPageIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Carousel_InterfaceAspectRatio_K2Node_ComponentBoundEvent_6_OnPageIndexChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Carousel_Preset_1_K2Node_ComponentBoundEvent_10_OnPageIndexChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Carousel_Preset_1_K2Node_ComponentBoundEvent_10_OnPageIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Carousel_Preset_1_K2Node_ComponentBoundEvent_10_OnPageIndexChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Slider_UIScale_K2Node_ComponentBoundEvent_1_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Slider_UIScale_K2Node_ComponentBoundEvent_1_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_SimpleGraphics_Slider_UIScale_K2Node_ComponentBoundEvent_1_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_W_Options_Graphics_FOV_GamePad_K2Node_ComponentBoundEvent_16_SyncVariables__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_W_Options_Graphics_FOV_GamePad_K2Node_ComponentBoundEvent_16_SyncVariables__DelegateSignature final
{
public:
	bool                                          VerticalFov;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WorldFov;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WeaponFov;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponFOVPreset                              FovPreset;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GraphicsChanged_0;                                 // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_W_Options_Graphics_FOV_GamePad_K2Node_ComponentBoundEvent_16_SyncVariables__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_Options_Graphics_UE5_W_Options_Graphics_FOV_PC_K2Node_ComponentBoundEvent_14_SyncVariables__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_W_Options_Graphics_FOV_PC_K2Node_ComponentBoundEvent_14_SyncVariables__DelegateSignature final
{
public:
	bool                                          VerticalFov;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WorldFov;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WeaponFov;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponFOVPreset                              FovPreset;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GraphicsChanged_0;                                 // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_Options_Graphics_UE5_W_Options_Graphics_FOV_PC_K2Node_ComponentBoundEvent_14_SyncVariables__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenu_AdvGraphics_Check_FlashlightShadows_K2Node_ComponentBoundEvent_42_OnCheckStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Check_FlashlightShadows_K2Node_ComponentBoundEvent_42_OnCheckStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Check_FlashlightShadows_K2Node_ComponentBoundEvent_42_OnCheckStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenu_AdvGraphics_Slider_DecalDensity_K2Node_ComponentBoundEvent_111_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Slider_DecalDensity_K2Node_ComponentBoundEvent_111_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Slider_DecalDensity_K2Node_ComponentBoundEvent_111_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenu_AdvGraphics_Slider_DecalFadeScreenSize_K2Node_ComponentBoundEvent_112_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Slider_DecalFadeScreenSize_K2Node_ComponentBoundEvent_112_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Slider_DecalFadeScreenSize_K2Node_ComponentBoundEvent_112_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenu_AdvGraphics_Slider_FSRQuality_K2Node_ComponentBoundEvent_44_OnDlssValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Slider_FSRQuality_K2Node_ComponentBoundEvent_44_OnDlssValueChanged__DelegateSignature final
{
public:
	int32                                         NewIntegerValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Slider_FSRQuality_K2Node_ComponentBoundEvent_44_OnDlssValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenu_AdvGraphics_Slider_MotionBlurScale_K2Node_ComponentBoundEvent_119_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Slider_MotionBlurScale_K2Node_ComponentBoundEvent_119_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_AdvGraphics_Slider_MotionBlurScale_K2Node_ComponentBoundEvent_119_OnFloatValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenu_Tab_AdvancedGraphicsOptions_K2Node_ComponentBoundEvent_36_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_Tab_AdvancedGraphicsOptions_K2Node_ComponentBoundEvent_36_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_Tab_AdvancedGraphicsOptions_K2Node_ComponentBoundEvent_36_Clicked__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenu_Tab_SimpleGraphicsOptions_K2Node_ComponentBoundEvent_35_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_Tab_SimpleGraphicsOptions_K2Node_ComponentBoundEvent_35_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenu_Tab_SimpleGraphicsOptions_K2Node_ComponentBoundEvent_35_Clicked__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_BounceLight_K2Node_ComponentBoundEvent_126_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_BounceLight_K2Node_ComponentBoundEvent_126_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_BounceLight_K2Node_ComponentBoundEvent_126_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_DecalsEnabled_K2Node_ComponentBoundEvent_127_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_DecalsEnabled_K2Node_ComponentBoundEvent_127_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_DecalsEnabled_K2Node_ComponentBoundEvent_127_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_FrameLimit_K2Node_ComponentBoundEvent_103_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_FrameLimit_K2Node_ComponentBoundEvent_103_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_FrameLimit_K2Node_ComponentBoundEvent_103_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_MotionBlurEnable_K2Node_ComponentBoundEvent_104_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_MotionBlurEnable_K2Node_ComponentBoundEvent_104_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_MotionBlurEnable_K2Node_ComponentBoundEvent_104_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_OptiwandFPSEnabled_K2Node_ComponentBoundEvent_128_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_OptiwandFPSEnabled_K2Node_ComponentBoundEvent_128_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_OptiwandFPSEnabled_K2Node_ComponentBoundEvent_128_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_PerObjectShadows_K2Node_ComponentBoundEvent_38_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_PerObjectShadows_K2Node_ComponentBoundEvent_38_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_PerObjectShadows_K2Node_ComponentBoundEvent_38_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_Raytracing_K2Node_ComponentBoundEvent_129_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_Raytracing_K2Node_ComponentBoundEvent_129_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_Raytracing_K2Node_ComponentBoundEvent_129_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingAmbientOcclusion_K2Node_ComponentBoundEvent_132_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingAmbientOcclusion_K2Node_ComponentBoundEvent_132_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingAmbientOcclusion_K2Node_ComponentBoundEvent_132_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingGlobalIllumination_K2Node_ComponentBoundEvent_133_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingGlobalIllumination_K2Node_ComponentBoundEvent_133_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingGlobalIllumination_K2Node_ComponentBoundEvent_133_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingReflections_K2Node_ComponentBoundEvent_131_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingReflections_K2Node_ComponentBoundEvent_131_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingReflections_K2Node_ComponentBoundEvent_131_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingShadows_K2Node_ComponentBoundEvent_130_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingShadows_K2Node_ComponentBoundEvent_130_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingShadows_K2Node_ComponentBoundEvent_130_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingTranslucency_K2Node_ComponentBoundEvent_134_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingTranslucency_K2Node_ComponentBoundEvent_134_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_RaytracingTranslucency_K2Node_ComponentBoundEvent_134_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_VSync_K2Node_ComponentBoundEvent_109_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_VSync_K2Node_ComponentBoundEvent_109_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_OnOff_VSync_K2Node_ComponentBoundEvent_109_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_AdvGraphics_Slider_FrameGeneration_K2Node_ComponentBoundEvent_0_OnDlssValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_Slider_FrameGeneration_K2Node_ComponentBoundEvent_0_OnDlssValueChanged__DelegateSignature final
{
public:
	int32                                         NewIntegerValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_AdvGraphics_Slider_FrameGeneration_K2Node_ComponentBoundEvent_0_OnDlssValueChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_Options_Carousel_MirrorReflectionMode_K2Node_ComponentBoundEvent_50_FocusLostDispatcher__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Options_Carousel_MirrorReflectionMode_K2Node_ComponentBoundEvent_50_FocusLostDispatcher__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Options_Carousel_MirrorReflectionMode_K2Node_ComponentBoundEvent_50_FocusLostDispatcher__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_Options_OnOff_BounceLight_K2Node_ComponentBoundEvent_28_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Options_OnOff_BounceLight_K2Node_ComponentBoundEvent_28_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Options_OnOff_BounceLight_K2Node_ComponentBoundEvent_28_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_Options_OnOff_MotionBlur_K2Node_ComponentBoundEvent_27_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Options_OnOff_MotionBlur_K2Node_ComponentBoundEvent_27_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Options_OnOff_MotionBlur_K2Node_ComponentBoundEvent_27_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_Reflex_OnOff_GameLatency_K2Node_ComponentBoundEvent_137_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Reflex_OnOff_GameLatency_K2Node_ComponentBoundEvent_137_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Reflex_OnOff_GameLatency_K2Node_ComponentBoundEvent_137_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_Reflex_OnOff_GameToRenderLatency_K2Node_ComponentBoundEvent_135_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Reflex_OnOff_GameToRenderLatency_K2Node_ComponentBoundEvent_135_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Reflex_OnOff_GameToRenderLatency_K2Node_ComponentBoundEvent_135_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_Reflex_OnOff_RenderLatency_K2Node_ComponentBoundEvent_138_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Reflex_OnOff_RenderLatency_K2Node_ComponentBoundEvent_138_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_Reflex_OnOff_RenderLatency_K2Node_ComponentBoundEvent_138_OnValueStateChange__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_ReflexLowLatencyCarousel_K2Node_ComponentBoundEvent_41_OnPageIndexChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_ReflexLowLatencyCarousel_K2Node_ComponentBoundEvent_41_OnPageIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_ReflexLowLatencyCarousel_K2Node_ComponentBoundEvent_41_OnPageIndexChanged__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_SimpleGraphics_Carousel_InterfaceAspectRatio_K2Node_ComponentBoundEvent_76_FocusLostDispatcher__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_SimpleGraphics_Carousel_InterfaceAspectRatio_K2Node_ComponentBoundEvent_76_FocusLostDispatcher__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Graphics_UE5_C_BndEvt__W_SettingsMenuGamepad_SimpleGraphics_Carousel_InterfaceAspectRatio_K2Node_ComponentBoundEvent_76_FocusLostDispatcher__DelegateSignature;

// Function W_Options_Graphics_UE5.W_Options_Graphics_UE5_C.BndEvt__W_SettingsMenuGamepad_SimpleGraphics_Carousel_Preset_K2Node_ComponentBoundEvent_78_OnPageIndexChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
