#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_GamepadCommandWheel_UE5

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_GamepadCommandWheel_UE5.W_Options_GamepadCommandWheel_UE5_C
// 0x0048 (0x0460 - 0x0418)
class UW_Options_GamepadCommandWheel_UE5_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_OnOffButton_C*                       Controls_OnOff_RadialMenu;                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_RadialMenu_2;                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_Toggle_RadialNavigation;                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_ConfirmationPreset;                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_GameCommander_Preset;                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              RadialNavigationContainer_2;                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilityWidgetBase*            LastUsedController;                                // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Options_GamepadCommandWheel_UE5_Options_GameCommander_Preset_K2Node_ComponentBoundEvent_0_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_GamepadCommandWheel_UE5_Options_GyroActiveMode_K2Node_ComponentBoundEvent_1_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_RadialMenu_1_K2Node_ComponentBoundEvent_21_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void CreateInputLabel(const class UVerticalBox* TargetBox, const class FText& Text, const uint8& Direction);
	void ExecuteUbergraph_W_Options_GamepadCommandWheel_UE5(int32 EntryPoint);
	void PopulateOptions();
	void ResetToDefaults();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Options_GamepadCommandWheel_UE5_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Options_GamepadCommandWheel_UE5_C")
	}
	static class UW_Options_GamepadCommandWheel_UE5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Options_GamepadCommandWheel_UE5_C>();
	}
};
DUMPER7_ASSERTS_UW_Options_GamepadCommandWheel_UE5_C;

}

