#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_Gameplay_UE5

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_Gameplay_UE5.W_Options_Gameplay_UE5_C
// 0x0208 (0x0650 - 0x0448)
class UW_Options_Gameplay_UE5_C final : public UOptionsGameplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_OptionsContainer_UE5_C*              AllowModdedPlayers;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Analytics;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Header_C*                            AnalyticsHeader;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            ClearModioUserData;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            CopySupporterCodeButton;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              CrossplayEnabled;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputMethodListener;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              JoinModdedServers;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              LinkAccount;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              MapAnalyticsContainer;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Header_C*                            ModioHeader;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ModioSubCategory;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              ModioUserDataContainer;                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardCheckbox_C*                  Options_Checkbox_ShowCommandMarkers;               // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardCombobox_New_C*              Options_Combo_CommandStyle;                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardCombobox_New_C*              Options_Combo_EmptyMagReloadStyle;                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_DefaultOpenDoorCommand;                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_DefaultSurfaceCommand;                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_DefaultUnknownDoorCommand;                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_GrenadeStyle;                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_LanguageSelection;                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_LockedDoorcommand;                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_LowReadyStyle;                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_InvertMousePitch;                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_InvertMouseYaw;                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_MapAnalytics;                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_Replay;                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowChat;                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowCommandContextHint;              // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowCompass;                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowFPS;                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowHealthIcons;                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowHesitationBar;                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowHotkeys;                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowHUD;                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowIcons;                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowNames;                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_ShowTeamStatus;                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_StaticReload;                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Options_OnOff_SwayHUD;                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_ScoreReadoutMode;                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_ShotgunReloadStyle;                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Options_Slider_FreelookSensitivity;                // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Options_Slider_MouseSensitivity;                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_UnlockedDoorCommand;                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              ReplayContainer;                                   // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Header_C*                            ReplayHeader;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ReplaySubcategory;                                 // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    SimpleGraphics_Carousel_NVGStyle;                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       SimpleGraphics_OnOff_ADSZoom;                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              SupporterCodeContainer;                            // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Header_C*                            SupporterHeader;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SupporterSubCategory;                              // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             Tab_Game;                                          // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   EOSReturnToMainMenuStatus;                         // 0x0608(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EOSNetworkIssue;                                   // 0x0620(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EOSLInkedToName;                                   // 0x0638(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__Options_Combo_LastMagReloadStyle_1_K2Node_ComponentBoundEvent_87_OnNewOptionSelected__DelegateSignature(int32 NewOption);
	void BndEvt__Options_Slider_FreelookSensitivity_K2Node_ComponentBoundEvent_20_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__Options_Slider_MouseSensitivity_K2Node_ComponentBoundEvent_52_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_Gameplay_UE5_AllowModdedPlayerButton_K2Node_ComponentBoundEvent_24_OnValueChange__DelegateSignature(bool NewCheckState);
	void BndEvt__W_Options_Gameplay_UE5_CrossplayButton_K2Node_ComponentBoundEvent_23_OnValueChange__DelegateSignature(bool NewCheckState);
	void BndEvt__W_Options_Gameplay_UE5_InputMethodListener_K2Node_ComponentBoundEvent_4_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void BndEvt__W_Options_Gameplay_UE5_JoinModdedServersButton_K2Node_ComponentBoundEvent_5_OnValueChange__DelegateSignature(bool NewCheckState);
	void BndEvt__W_Options_Gameplay_UE5_LinkAccountButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature();
	void BndEvt__W_Options_Gameplay_UE5_Options_DefaultOpenDoorCommand_K2Node_ComponentBoundEvent_17_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Gameplay_UE5_Options_DefaultSurfaceCommand_K2Node_ComponentBoundEvent_6_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Gameplay_UE5_Options_DefaultUnknownDoorCommand_K2Node_ComponentBoundEvent_16_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Gameplay_UE5_Options_LanguageSelection_K2Node_ComponentBoundEvent_0_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Gameplay_UE5_Options_LockedDoorcommand_K2Node_ComponentBoundEvent_19_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Gameplay_UE5_Options_LowReadyStyle_K2Node_ComponentBoundEvent_15_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Gameplay_UE5_Options_ScoreReadoutMode_K2Node_ComponentBoundEvent_21_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Gameplay_UE5_Options_ShotgunReloadStyle_K2Node_ComponentBoundEvent_13_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Gameplay_UE5_Options_UnlockedDoorCommand_K2Node_ComponentBoundEvent_18_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_SettingsMenuGamepad_ClearModioUserData_K2Node_ComponentBoundEvent_90_Clicked__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_SettingsMenuGamepad_CopySupporterCodeButton_K2Node_ComponentBoundEvent_45_Clicked__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_SettingsMenuGamepad_Options_GrenadeStyle_K2Node_ComponentBoundEvent_17_FocusLostDispatcher__DelegateSignature(int32 Index_0);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_MapAnalytics_K2Node_ComponentBoundEvent_94_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_Replay_K2Node_ComponentBoundEvent_30_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowChat_K2Node_ComponentBoundEvent_9_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowCommandContextHint_K2Node_ComponentBoundEvent_15_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowCompass_K2Node_ComponentBoundEvent_12_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowFPS_K2Node_ComponentBoundEvent_2_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowHealthIcons_K2Node_ComponentBoundEvent_13_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowHesitationBar_K2Node_ComponentBoundEvent_124_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowHotkeys_K2Node_ComponentBoundEvent_14_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowHUD_K2Node_ComponentBoundEvent_3_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowIcons_K2Node_ComponentBoundEvent_122_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowNames_K2Node_ComponentBoundEvent_10_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_ShowTeamStatus_K2Node_ComponentBoundEvent_8_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_StaticReload_K2Node_ComponentBoundEvent_11_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Options_OnOff_SwayHUD_K2Node_ComponentBoundEvent_7_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_SimpleGraphics_Carousel_NVGStyle_K2Node_ComponentBoundEvent_136_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_SettingsMenuGamepad_SimpleGraphics_OnOff_ADSZoom_K2Node_ComponentBoundEvent_92_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_W_OnOffButton_K2Node_ComponentBoundEvent_46_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_W_OnOffButton_K2Node_ComponentBoundEvent_91_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CreateRestartDialog();
	void ExecuteUbergraph_W_Options_Gameplay_UE5(int32 EntryPoint);
	ESlateVisibility Get_AllowModdedPlayers_Visibility();
	ESlateVisibility Get_JoinModdedServers_Visibility();
	void LanguageCancelClicked(class UStandardModal* CallingModal);
	void LanguageOkClicked(class UW_StandardModal_C* CallingModal, const class FText& TextEntry);
	void PopulateGameSettings();
	void ResetDefaultGameplay();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Options_Gameplay_UE5_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Options_Gameplay_UE5_C")
	}
	static class UW_Options_Gameplay_UE5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Options_Gameplay_UE5_C>();
	}
};
DUMPER7_ASSERTS_UW_Options_Gameplay_UE5_C;

}

