#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_Controls_UE5

#include "Basic.hpp"

#include "SStandardModalDetails_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "InputCore_structs.hpp"
#include "InputRemapping_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.Add To Control Binds Lists
// 0x0060 (0x0060 - 0x0000)
struct W_Options_Controls_UE5_C_Add_To_Control_Binds_Lists final
{
public:
	class UW_ControlsBind_C*                      ControlBind;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAxisMappingStruct                     InputAxis;                                         // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActionMappingStruct                   InputAction;                                       // 0x0030(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_Add_To_Control_Binds_Lists;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.AddControlsToGridPanel
// 0x0018 (0x0018 - 0x0000)
struct W_Options_Controls_UE5_C_AddControlsToGridPanel final
{
public:
	TArray<struct FKeyBinding>                    Bindings;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UGridPanel*                             GridPanel;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_AddControlsToGridPanel;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BndEvt__W_Options_Controls_UE5_btn_ControlsEquipment_1_K2Node_ComponentBoundEvent_5_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsEquipment_1_K2Node_ComponentBoundEvent_5_Clicked__DelegateSignature final
{
public:
	class UW_ScrollButton_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsEquipment_1_K2Node_ComponentBoundEvent_5_Clicked__DelegateSignature;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BndEvt__W_Options_Controls_UE5_btn_ControlsInteraction_1_K2Node_ComponentBoundEvent_6_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsInteraction_1_K2Node_ComponentBoundEvent_6_Clicked__DelegateSignature final
{
public:
	class UW_ScrollButton_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsInteraction_1_K2Node_ComponentBoundEvent_6_Clicked__DelegateSignature;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BndEvt__W_Options_Controls_UE5_btn_ControlsMovement_1_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsMovement_1_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature final
{
public:
	class UW_ScrollButton_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsMovement_1_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BndEvt__W_Options_Controls_UE5_btn_ControlsReplay_1_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsReplay_1_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature final
{
public:
	class UW_ScrollButton_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsReplay_1_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BndEvt__W_Options_Controls_UE5_btn_ControlsReplay_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsReplay_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature final
{
public:
	class UW_ScrollButton_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsReplay_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BndEvt__W_Options_Controls_UE5_btn_ControlsVehicle_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsVehicle_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature final
{
public:
	class UW_ScrollButton_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_btn_ControlsVehicle_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BndEvt__W_Options_Controls_UE5_NextGamepadTabButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_NextGamepadTabButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_NextGamepadTabButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BndEvt__W_Options_Controls_UE5_PreviousGamepadTabButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_PreviousGamepadTabButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_PreviousGamepadTabButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BndEvt__W_Options_Controls_UE5_W_ScrollButton_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_W_ScrollButton_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature final
{
public:
	class UW_ScrollButton_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BndEvt__W_Options_Controls_UE5_W_ScrollButton_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.Conflicting Bind Cancel Clicked
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_Conflicting_Bind_Cancel_Clicked final
{
public:
	class UStandardModal*                         CallingModal;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_Conflicting_Bind_Cancel_Clicked;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.Conflicting Bind Detected
// 0x0050 (0x0050 - 0x0000)
struct W_Options_Controls_UE5_C_Conflicting_Bind_Detected final
{
public:
	class UW_ControlsBind_C*                      CallingBind;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActionMappingStruct>           ActionMappings;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FAxisMappingStruct>             AxisMappings;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FKey                                   Key;                                               // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TArray<class FText>                           ConflictBindsText;                                 // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_Conflicting_Bind_Detected;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.Conflicting Bind Ok Clicked
// 0x0020 (0x0020 - 0x0000)
struct W_Options_Controls_UE5_C_Conflicting_Bind_Ok_Clicked final
{
public:
	class UW_StandardModal_C*                     CallingModal;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   TextEntry;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_Conflicting_Bind_Ok_Clicked;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.ExecuteUbergraph_W_Options_Controls_UE5
// 0x0440 (0x0440 - 0x0000)
struct W_Options_Controls_UE5_C_ExecuteUbergraph_W_Options_Controls_UE5 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ScrollButton_C*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_SettingLabel_C*                      CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKeyBinding>                    K2Node_CustomEvent_Bindings;                       // 0x0050(0x0010)(ConstParm, ReferenceParm)
	class UGridPanel*                             K2Node_CustomEvent_GridPanel;                      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKeyBinding                            CallFunc_Array_Get_Item;                           // 0x0070(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAssignUnbindableControl_bSuccess;      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAssignUnbindableControl_bSuccess_1;    // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_ControlsBind_C*                      CallFunc_Create_ReturnValue_1;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ControlsBind_C*                      CallFunc_Create_ReturnValue_2;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_1;             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_2;             // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UStandardModal* CallingModal)> K2Node_CreateDelegate_OutputDelegate;        // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UStandardModal* CallingModal)> K2Node_CreateDelegate_OutputDelegate_1;      // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_StandardModal_C* CallingModal, class FText TextEntry)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_ControlsBind_C* CallingBind, TArray<struct FActionMappingStruct>& ActionMappings, TArray<struct FAxisMappingStruct>& AxisMappings, const struct FKey& Key, TArray<class FText>& ConflictBindsText)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_ControlsBind_C* CallingWidget, const struct FKey& NewKey)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_ControlsBind_C*                      K2Node_CustomEvent_CallingWidget_2;                // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_StandardButton_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0158(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_StandardButton_C*                    CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_ControlsBind_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_ControlsBind_C* CallingWidget)> K2Node_CreateDelegate_OutputDelegate_5;  // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_ControlsResetBinding_C*>      CallFunc_GetAllWidgetsOfClass_FoundWidgets_2;      // 0x01A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_ControlsResetBinding_C*              CallFunc_Array_Get_Item_2;                         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ControlsResetBinding_C*              CallFunc_Create_ReturnValue_3;                     // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_3;             // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_ControlsBind_C*>              K2Node_MakeArray_Array;                            // 0x01D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FAxisMappingStruct>             K2Node_MakeArray_Array_1;                          // 0x01E0(0x0010)(ReferenceParm)
	TArray<struct FActionMappingStruct>           K2Node_MakeArray_Array_2;                          // 0x01F0(0x0010)(ReferenceParm)
	TDelegate<void(class UW_ControlsBind_C* CallingWidget)> K2Node_CreateDelegate_OutputDelegate_6;  // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_ControlsBind_C*                      K2Node_CustomEvent_CallingWidget_1;                // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_ControlsBind_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets_3;      // 0x0218(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ControlsBind_C*                      CallFunc_Array_Get_Item_3;                         // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_ControlsResetBinding_C*>      CallFunc_GetAllWidgetsOfClass_FoundWidgets_4;      // 0x0248(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ControlsResetBinding_C*              CallFunc_Array_Get_Item_4;                         // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ControlsBind_C*                      CallFunc_Array_Get_Item_5;                         // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_StandardButton_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets_5;      // 0x0288(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_StandardButton_C*                    CallFunc_Array_Get_Item_6;                         // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ControlsBind_C*                      K2Node_CustomEvent_CallingWidget;                  // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_NewKey;                         // 0x02B0(0x0018)(HasGetValueTypeHash)
	class UW_ControlsBind_C*                      K2Node_CustomEvent_CallingBind;                    // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActionMappingStruct>           K2Node_CustomEvent_ActionMappings;                 // 0x02D0(0x0010)(ReferenceParm)
	TArray<struct FAxisMappingStruct>             K2Node_CustomEvent_AxisMappings;                   // 0x02E0(0x0010)(ReferenceParm)
	struct FKey                                   K2Node_CustomEvent_Key;                            // 0x02F0(0x0018)(HasGetValueTypeHash)
	TArray<class FText>                           K2Node_CustomEvent_ConflictBindsText;              // 0x0308(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetConflictingKeybindText_Text;           // 0x0318(0x0018)()
	class UReadyOrNotGameUserSettings*            CallFunc_GetReadyOrNotGameUserSettings_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_StandardModal_C*                     K2Node_CustomEvent_CallingModal_2;                 // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_TextEntry;                      // 0x0358(0x0018)()
	class UStandardModal*                         K2Node_CustomEvent_CallingModal_1;                 // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStandardModal*                         CallFunc_Initialise_Or_Get_Pop_Up_OutputPopUp;     // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStandardModal*                         CallFunc_Initialise_Or_Get_Pop_Up_OutputPopUp_1;   // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BindConflictModal_C*                 K2Node_DynamicCast_AsW_Bind_Conflict_Modal;        // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_IllegalUnbindModal_C*                K2Node_DynamicCast_AsW_Illegal_Unbind_Modal;       // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStandardModal*                         K2Node_CustomEvent_CallingModal;                   // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_ScrollButton_C*>              CallFunc_WidgetGetChildrenOfClass_ChildWidgets;    // 0x03B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x03C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_ScrollButton_C*                      CallFunc_Array_Get_Item_7;                         // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_8;                         // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Button_C*                            K2Node_ComponentBoundEvent_Button_8;               // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Button_C*                            K2Node_ComponentBoundEvent_Button_7;               // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ScrollButton_C*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ScrollButton_C*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0408(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ScrollButton_C*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ScrollButton_C*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0418(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ScrollButton_C*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0420(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ScrollButton_C*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast; // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast_1; // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_ExecuteUbergraph_W_Options_Controls_UE5;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.GetConflictingKeybindListText
// 0x0388 (0x0388 - 0x0000)
struct W_Options_Controls_UE5_C_GetConflictingKeybindListText final
{
public:
	TArray<struct FAxisMappingStruct>             Axes;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FActionMappingStruct>           Actions;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FText>                           ConflictBinds;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Text;                                              // 0x0030(0x0018)(Parm, OutParm)
	class FText                                   LocalizedActionChain;                              // 0x0048(0x0018)(Edit, BlueprintVisible)
	class FText                                   Inputs_2LocalizedComma;                            // 0x0060(0x0018)(Edit, BlueprintVisible)
	class FText                                   Inputs_2LocalizedAnd;                              // 0x0078(0x0018)(Edit, BlueprintVisible)
	TArray<class FText>                           LocalizedActions;                                  // 0x0090(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0100(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0150(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0170(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01F0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0240(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0250(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x0278(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0290(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_2;                         // 0x02E0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0300(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0358(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0368(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_GetConflictingKeybindListText;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.GetConflictingKeybindText
// 0x0168 (0x0168 - 0x0000)
struct W_Options_Controls_UE5_C_GetConflictingKeybindText final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TArray<struct FAxisMappingStruct>             ConflictingAxes;                                   // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FActionMappingStruct>           ConflictingActions;                                // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FText>                           ConflictBindNames;                                 // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Text;                                              // 0x0048(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetConflictingKeybindListText_Text;       // 0x0060(0x0018)()
	class FString                                 CallFunc_Abbreviate_Key_Abreviated_Name;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_GetConflictingKeybindText;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.Initialise Or Get Pop Up
// 0x00C8 (0x00C8 - 0x0000)
struct W_Options_Controls_UE5_C_Initialise_Or_Get_Pop_Up final
{
public:
	class UClass*                                 PopUpType;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSStandardModalDetails                 ModalDetails;                                      // 0x0008(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UStandardModal*                         OutputPopUp;                                       // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStandardModal*                         TempPopUp;                                         // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PopUpClass;                                        // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStandardModal*                         CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStandardModal*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStandardModal*                         CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_Initialise_Or_Get_Pop_Up;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.NextControlsTab
// 0x0050 (0x0050 - 0x0000)
struct W_Options_Controls_UE5_C_NextControlsTab final
{
public:
	TArray<class UW_ScrollButton_C*>              CallFunc_Map_Keys_Keys;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ScrollButton_C*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Map_Find_Value;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ScrollButton_C*                      CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Map_Find_Value_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_NextControlsTab;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.On Binding Canceled
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_On_Binding_Canceled final
{
public:
	class UW_ControlsBind_C*                      CallingWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_On_Binding_Canceled;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.On Binding Committed
// 0x0020 (0x0020 - 0x0000)
struct W_Options_Controls_UE5_C_On_Binding_Committed final
{
public:
	class UW_ControlsBind_C*                      CallingWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   NewKey;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_On_Binding_Committed;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.On Binding Started
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_On_Binding_Started final
{
public:
	class UW_ControlsBind_C*                      CallingWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_On_Binding_Started;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.OnCancelIllegalBindClicked
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_OnCancelIllegalBindClicked final
{
public:
	class UStandardModal*                         CallingModal;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_OnCancelIllegalBindClicked;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.PreviousControlsTab
// 0x0050 (0x0050 - 0x0000)
struct W_Options_Controls_UE5_C_PreviousControlsTab final
{
public:
	TArray<class UW_ScrollButton_C*>              CallFunc_Map_Keys_Keys;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_ScrollButton_C*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ScrollButton_C*                      CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Map_Find_Value;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Map_Find_Value_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_PreviousControlsTab;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.SwitchControlsTab
// 0x0030 (0x0030 - 0x0000)
struct W_Options_Controls_UE5_C_SwitchControlsTab final
{
public:
	class UW_ScrollButton_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                MenuWidget;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_ControlsResetBinding_C*>      CallFunc_WidgetGetChildrenOfClass_ChildWidgets;    // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_ControlsResetBinding_C*              CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_SwitchControlsTab;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.TryAssignUnbindableControl
// 0x0050 (0x0050 - 0x0000)
struct W_Options_Controls_UE5_C_TryAssignUnbindableControl final
{
public:
	struct FKeyBinding                            KeyBinding;                                        // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CannotBeUnbindable;                                // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_TryAssignUnbindableControl;

// Function W_Options_Controls_UE5.W_Options_Controls_UE5_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Controls_UE5_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Controls_UE5_C_BP_GetDesiredFocusTarget;

}

