#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_GamepadOptions_UE5

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_AimSensitivityHorizontal_K2Node_ComponentBoundEvent_13_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_AimSensitivityHorizontal_K2Node_ComponentBoundEvent_13_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_AimSensitivityHorizontal_K2Node_ComponentBoundEvent_13_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroHorizontalADSSensitivity_K2Node_ComponentBoundEvent_9_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroHorizontalADSSensitivity_K2Node_ComponentBoundEvent_9_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroHorizontalADSSensitivity_K2Node_ComponentBoundEvent_9_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertADSSensitivity_K2Node_ComponentBoundEvent_8_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertADSSensitivity_K2Node_ComponentBoundEvent_8_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertADSSensitivity_K2Node_ComponentBoundEvent_8_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_1_K2Node_ComponentBoundEvent_7_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_1_K2Node_ComponentBoundEvent_7_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_1_K2Node_ComponentBoundEvent_7_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_K2Node_ComponentBoundEvent_6_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_K2Node_ComponentBoundEvent_6_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_K2Node_ComponentBoundEvent_6_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookInnerDeadzone_K2Node_ComponentBoundEvent_22_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookInnerDeadzone_K2Node_ComponentBoundEvent_22_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookInnerDeadzone_K2Node_ComponentBoundEvent_22_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivityHorizontal_K2Node_ComponentBoundEvent_12_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivityHorizontal_K2Node_ComponentBoundEvent_12_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivityHorizontal_K2Node_ComponentBoundEvent_12_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivitySpeedUp_K2Node_ComponentBoundEvent_14_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivitySpeedUp_K2Node_ComponentBoundEvent_14_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivitySpeedUp_K2Node_ComponentBoundEvent_14_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_MovementInnerDeadzone_K2Node_ComponentBoundEvent_18_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_MovementInnerDeadzone_K2Node_ComponentBoundEvent_18_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_MovementInnerDeadzone_K2Node_ComponentBoundEvent_18_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_Volume_K2Node_ComponentBoundEvent_0_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_Volume_K2Node_ComponentBoundEvent_0_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_Volume_K2Node_ComponentBoundEvent_0_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_DirectionalFaceButton_K2Node_ComponentBoundEvent_2_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_DirectionalFaceButton_K2Node_ComponentBoundEvent_2_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_DirectionalFaceButton_K2Node_ComponentBoundEvent_2_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertHorizontalGyro_K2Node_ComponentBoundEvent_11_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertHorizontalGyro_K2Node_ComponentBoundEvent_11_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertHorizontalGyro_K2Node_ComponentBoundEvent_11_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertVertGyro_K2Node_ComponentBoundEvent_10_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertVertGyro_K2Node_ComponentBoundEvent_10_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertVertGyro_K2Node_ComponentBoundEvent_10_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_RadialMenu_1_K2Node_ComponentBoundEvent_21_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_RadialMenu_1_K2Node_ComponentBoundEvent_21_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_RadialMenu_1_K2Node_ComponentBoundEvent_21_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_StickLayout_K2Node_ComponentBoundEvent_3_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_StickLayout_K2Node_ComponentBoundEvent_3_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_StickLayout_K2Node_ComponentBoundEvent_3_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5AdaptiveTrigger_K2Node_ComponentBoundEvent_4_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5AdaptiveTrigger_K2Node_ComponentBoundEvent_4_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5AdaptiveTrigger_K2Node_ComponentBoundEvent_4_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5ADSAdaptiveTrigger_K2Node_ComponentBoundEvent_19_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5ADSAdaptiveTrigger_K2Node_ComponentBoundEvent_19_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5ADSAdaptiveTrigger_K2Node_ComponentBoundEvent_19_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_Triggers_K2Node_ComponentBoundEvent_17_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_Triggers_K2Node_ComponentBoundEvent_17_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_Triggers_K2Node_ComponentBoundEvent_17_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_ForceFeedbackSlider_K2Node_ComponentBoundEvent_16_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_ForceFeedbackSlider_K2Node_ComponentBoundEvent_16_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_ForceFeedbackSlider_K2Node_ComponentBoundEvent_16_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_InputMethodListener_K2Node_ComponentBoundEvent_20_OnInputMethodChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_InputMethodListener_K2Node_ComponentBoundEvent_20_OnInputMethodChanged__DelegateSignature final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_InputMethodListener_K2Node_ComponentBoundEvent_20_OnInputMethodChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Options_GyroActiveMode_K2Node_ComponentBoundEvent_5_OnPageIndexChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Options_GyroActiveMode_K2Node_ComponentBoundEvent_5_OnPageIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Options_GyroActiveMode_K2Node_ComponentBoundEvent_5_OnPageIndexChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_W_OnOffButton_K2Node_ComponentBoundEvent_1_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_W_OnOffButton_K2Node_ComponentBoundEvent_1_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_W_OnOffButton_K2Node_ComponentBoundEvent_1_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_AimSensitivity_K2Node_ComponentBoundEvent_88_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_AimSensitivity_K2Node_ComponentBoundEvent_88_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_AimSensitivity_K2Node_ComponentBoundEvent_88_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_LookSensitivity_K2Node_ComponentBoundEvent_85_OnFloatValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_LookSensitivity_K2Node_ComponentBoundEvent_85_OnFloatValueChanged__DelegateSignature final
{
public:
	double                                        NewFloatValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSliderValue;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_LookSensitivity_K2Node_ComponentBoundEvent_85_OnFloatValueChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_SettingsMenuGamepad_Controls_OnOff_HoldCrouch_K2Node_ComponentBoundEvent_73_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_HoldCrouch_K2Node_ComponentBoundEvent_73_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_HoldCrouch_K2Node_ComponentBoundEvent_73_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertHorizontal_K2Node_ComponentBoundEvent_71_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertHorizontal_K2Node_ComponentBoundEvent_71_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertHorizontal_K2Node_ComponentBoundEvent_71_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertVertical_K2Node_ComponentBoundEvent_70_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertVertical_K2Node_ComponentBoundEvent_70_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertVertical_K2Node_ComponentBoundEvent_70_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_SettingsMenuGamepad_Controls_OnOff_ToggleADS_K2Node_ComponentBoundEvent_72_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_ToggleADS_K2Node_ComponentBoundEvent_72_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_ToggleADS_K2Node_ComponentBoundEvent_72_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_SettingsMenuGamepad_Controls_OnOff_TogglePS5Gyro_K2Node_ComponentBoundEvent_59_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_TogglePS5Gyro_K2Node_ComponentBoundEvent_59_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_Controls_OnOff_TogglePS5Gyro_K2Node_ComponentBoundEvent_59_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.BndEvt__W_SettingsMenuGamepad_W_CommonCarousel_K2Node_ComponentBoundEvent_61_OnPageIndexChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_W_CommonCarousel_K2Node_ComponentBoundEvent_61_OnPageIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_BndEvt__W_SettingsMenuGamepad_W_CommonCarousel_K2Node_ComponentBoundEvent_61_OnPageIndexChanged__DelegateSignature;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.ExecuteUbergraph_W_Options_GamepadOptions_UE5
// 0x0338 (0x0338 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_ExecuteUbergraph_W_Options_GamepadOptions_UE5 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadInverted_bInvertVertical;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadInverted_bInvertHorizontal;     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadInverted_ReturnValue;           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_12;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_12;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_11;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_11;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadLookSensitivityVertical_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadAimSensitivityVertical_ReturnValue; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_11;      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Value_1;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveTogglePS5Gyro_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadAimAssistIntensity_ReturnValue; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_10;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadInverted_ReturnValue;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue_2; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_9;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadInvertButtonLayout_ReturnValue; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_8;       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadInvertStickLayout_ReturnValue;  // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_7;       // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SavePS5AdaptiveFireTriggers_ReturnValue;  // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Value;                  // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_10;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_10;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGyroActiveMode_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGyroVerticalLookSensitivity_ReturnValue; // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_9;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_9;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_8;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_8;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGyroHorizontalLookSensitivity_ReturnValue; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGyroVerticalAimSensitivity_ReturnValue; // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_7;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_7;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_6;       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGyroHorizontalAimSensitivity_ReturnValue; // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_5;       // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_4;       // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadInverted_ReturnValue_1;         // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_6;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_6;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_5;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_5;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadLookSensitivityHorizontal_ReturnValue; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadAimSensitivityHorizontal_ReturnValue; // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_4;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_4;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_3;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_3;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadLookSensitivitySpeedUp_ReturnValue; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadMovementInnerDeadzone_ReturnValue; // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bUsingGamepad;          // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_2;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_2;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadLookInnerDeadzone_ReturnValue;  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroInverted_bInvertGyroVertical;      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroInverted_bInvertGyroHorizontal;    // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroInverted_ReturnValue;              // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGyroInverted_ReturnValue;              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGyroInverted_ReturnValue_1;            // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UReadyOrNotGameUserSettings*            CallFunc_GetReadyOrNotGameUserSettings_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_3;       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SavePS5AdaptiveAimTriggers_ReturnValue;   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_2;       // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetForceFeedbackEnabled_ReturnValue;      // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_12;      // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_13;      // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveHoldCrouch_ReturnValue;               // 0x015F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveToggleADS_ReturnValue;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue_3; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewFloatValue_1;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue_1;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetForceFeedbackIntensity_ReturnValue;    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue_4; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState_1;       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadInvertTriggersLayout_ReturnValue; // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState;         // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadRadialMenuUseLeftStick_ReturnValue; // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadSwitchBumpersTriggersLayout_ReturnValue; // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadSwitchBumpersTriggersLayout_ReturnValue_1; // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadInvertTriggersLayout_bInvertTriggersLayout; // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadInvertTriggersLayout_ReturnValue; // 0x019F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewFloatValue;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewSliderValue;         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01C0(0x0018)()
	bool                                          CallFunc_SetSpeakerIntensity_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01E0(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0240(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0250(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0268(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0280(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02E0(0x0018)()
	float                                         CallFunc_SetGamepadLookSensitivityVertical_GamepadLookSensitivityVertical_ImplicitCast; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGamepadAimSensitivityVertical_GamepadAimSensitivityVertical_ImplicitCast; // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGyroVerticalLookSensitivity_GyroVerticalLookSensitivity_ImplicitCast; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGyroHorizontalLookSensitivity_GyroHorizontalLookSensitivity_ImplicitCast; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGyroVerticalAimSensitivity_GyroVerticalAimSensitivity_ImplicitCast; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGyroHorizontalAimSensitivity_GyroHorizontalAimSensitivity_ImplicitCast; // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGamepadLookSensitivityHorizontal_GamepadLookSensitivityHorizontal_ImplicitCast; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGamepadAimSensitivityHorizontal_GamepadAimSensitivityHorizontal_ImplicitCast; // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGamepadLookSensitivitySpeedUp_GamepadLookSensitivitySpeedUp_ImplicitCast; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGamepadMovementInnerDeadzone_GamepadMovementInnerDeadzone_ImplicitCast; // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGamepadLookInnerDeadzone_GamepadLookInnerDeadzone_ImplicitCast; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetForceFeedbackIntensity_ForceFeedbackIntensity_ImplicitCast; // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetForceFeedbackIntensity_ForceFeedbackIntensity_ImplicitCast_1; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSpeakerIntensity_SpeakerIntensity_ImplicitCast; // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSpeakerIntensity_SpeakerIntensity_ImplicitCast_1; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadOptions_UE5_C_ExecuteUbergraph_W_Options_GamepadOptions_UE5;

// Function W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C.PopulateGamepadControls_0
// 0x0188 (0x0188 - 0x0000)
struct W_Options_GamepadOptions_UE5_C_PopulateGamepadControls_0 final
{
public:
	bool                                          CallFunc_GetForceFeedbackEnabled_ForceFeedbackEnabled; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetForceFeedbackEnabled_ReturnValue;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadRadialMenuUseLeftStick_UseLeftStick; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadRadialMenuUseLeftStick_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadPS5AdaptiveAimTriggers_PS5AdaptiveAimTriggers; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadPS5AdaptiveAimTriggers_ReturnValue;   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadPS5AdaptiveFireTriggers_PS5AdaptiveFireTriggers; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadPS5AdaptiveFireTriggers_ReturnValue;  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetGyroActiveMode_GyroActiveMode;         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroActiveMode_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroInverted_bInvertGyroVertical;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroInverted_bInvertGyroHorizontal;    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroInverted_ReturnValue;              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveByString_Success;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGyroHorizontalAimSensitivity_GyroHorizontalAimSensitivity; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroHorizontalAimSensitivity_ReturnValue; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGyroVerticalAimSensitivity_GyroVerticalAimSensitivity; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroVerticalAimSensitivity_ReturnValue; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetFloatValue_NewValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetFloatValue_NewValue_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGyroHorizontalLookSensitivity_GyroHorizontalLookSensitivity; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroHorizontalLookSensitivity_ReturnValue; // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGyroVerticalLookSensitivity_GyroVerticalLookSensitivity; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGyroVerticalLookSensitivity_ReturnValue; // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetFloatValue_NewValue_2;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetFloatValue_NewValue_3;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
