#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_GamepadOptions_UE5

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C
// 0x0168 (0x0580 - 0x0418)
class UW_Options_GamepadOptions_UE5_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_StandardSlider_C*                    Controls_Gamepad_AimSensitivityHorizontal;         // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_AimSensitivityVert;               // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_GyroHorizontalADSSensitivity;     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_GyroHorizontalLookSensitivity;    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_GyroVertADSSensitivity;           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_GyroVertLookSensitivity;          // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_LookInnerDeadzone;                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_LookSensitivityHorizontal;        // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_LookSensitivitySpeedUp;           // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_LookSensitivityVert;              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Controls_Gamepad_MovementInnerDeadzone;            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_DirectionalFaceButton;              // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_HoldCrouch;                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_InvertHorizontal;                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_InvertHorizontalGyro;               // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_InvertVertGyro;                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_InvertVertical;                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_StickLayout;                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_ToggleADS;                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_TogglePS5AdaptiveTrigger;           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_TogglePS5ADSAdaptiveTrigger;        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_TogglePS5Gyro;                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_OnOff_Triggers;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Controls_Toggle_RadialNavigation;                  // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       ForceFeedbackButton;                               // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              ForceFeedbackContainer;                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    ForceFeedbackSlider;                               // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Gamepad_Volume_Slider;                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputMethodListener;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_AimAssistIntensity;                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_GyroActiveMode;                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             Tab_Gamepad;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              W_OptionsContainer_UE5;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldUpdateState;                                // 0x0529(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52A[0x6];                                      // 0x052A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<double, class FString>                   ForceFeedbackIntensityMap_0;                       // 0x0530(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_AimSensitivityHorizontal_K2Node_ComponentBoundEvent_13_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroHorizontalADSSensitivity_K2Node_ComponentBoundEvent_9_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertADSSensitivity_K2Node_ComponentBoundEvent_8_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_1_K2Node_ComponentBoundEvent_7_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_K2Node_ComponentBoundEvent_6_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookInnerDeadzone_K2Node_ComponentBoundEvent_22_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivityHorizontal_K2Node_ComponentBoundEvent_12_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivitySpeedUp_K2Node_ComponentBoundEvent_14_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_MovementInnerDeadzone_K2Node_ComponentBoundEvent_18_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_Volume_K2Node_ComponentBoundEvent_0_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_DirectionalFaceButton_K2Node_ComponentBoundEvent_2_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertHorizontalGyro_K2Node_ComponentBoundEvent_11_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertVertGyro_K2Node_ComponentBoundEvent_10_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_RadialMenu_1_K2Node_ComponentBoundEvent_21_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_StickLayout_K2Node_ComponentBoundEvent_3_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5AdaptiveTrigger_K2Node_ComponentBoundEvent_4_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5ADSAdaptiveTrigger_K2Node_ComponentBoundEvent_19_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_Triggers_K2Node_ComponentBoundEvent_17_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_ForceFeedbackSlider_K2Node_ComponentBoundEvent_16_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_InputMethodListener_K2Node_ComponentBoundEvent_20_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void BndEvt__W_Options_GamepadOptions_UE5_Options_GyroActiveMode_K2Node_ComponentBoundEvent_5_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_GamepadOptions_UE5_W_OnOffButton_K2Node_ComponentBoundEvent_1_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_AimSensitivity_K2Node_ComponentBoundEvent_88_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_LookSensitivity_K2Node_ComponentBoundEvent_85_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_HoldCrouch_K2Node_ComponentBoundEvent_73_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertHorizontal_K2Node_ComponentBoundEvent_71_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertVertical_K2Node_ComponentBoundEvent_70_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_ToggleADS_K2Node_ComponentBoundEvent_72_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_TogglePS5Gyro_K2Node_ComponentBoundEvent_59_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_W_CommonCarousel_K2Node_ComponentBoundEvent_61_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_W_Options_GamepadOptions_UE5(int32 EntryPoint);
	void PopulateGamepadControls_0();
	void ResetDefaultsGamepad();
	void UpdateDescriptions();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Options_GamepadOptions_UE5_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Options_GamepadOptions_UE5_C")
	}
	static class UW_Options_GamepadOptions_UE5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Options_GamepadOptions_UE5_C>();
	}
};
DUMPER7_ASSERTS_UW_Options_GamepadOptions_UE5_C;

}

