#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_GamepadCommandWheel_UE5

#include "Basic.hpp"

#include "ReadyOrNot_structs.hpp"


namespace SDK::Params
{

// Function W_Options_GamepadCommandWheel_UE5.W_Options_GamepadCommandWheel_UE5_C.BndEvt__W_Options_GamepadCommandWheel_UE5_Options_GameCommander_Preset_K2Node_ComponentBoundEvent_0_OnPageIndexChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_Options_GamepadCommandWheel_UE5_C_BndEvt__W_Options_GamepadCommandWheel_UE5_Options_GameCommander_Preset_K2Node_ComponentBoundEvent_0_OnPageIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadCommandWheel_UE5_C_BndEvt__W_Options_GamepadCommandWheel_UE5_Options_GameCommander_Preset_K2Node_ComponentBoundEvent_0_OnPageIndexChanged__DelegateSignature;

// Function W_Options_GamepadCommandWheel_UE5.W_Options_GamepadCommandWheel_UE5_C.BndEvt__W_Options_GamepadCommandWheel_UE5_Options_GyroActiveMode_K2Node_ComponentBoundEvent_1_OnPageIndexChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_Options_GamepadCommandWheel_UE5_C_BndEvt__W_Options_GamepadCommandWheel_UE5_Options_GyroActiveMode_K2Node_ComponentBoundEvent_1_OnPageIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadCommandWheel_UE5_C_BndEvt__W_Options_GamepadCommandWheel_UE5_Options_GyroActiveMode_K2Node_ComponentBoundEvent_1_OnPageIndexChanged__DelegateSignature;

// Function W_Options_GamepadCommandWheel_UE5.W_Options_GamepadCommandWheel_UE5_C.BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_RadialMenu_1_K2Node_ComponentBoundEvent_21_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GamepadCommandWheel_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_RadialMenu_1_K2Node_ComponentBoundEvent_21_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadCommandWheel_UE5_C_BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_RadialMenu_1_K2Node_ComponentBoundEvent_21_OnValueStateChange__DelegateSignature;

// Function W_Options_GamepadCommandWheel_UE5.W_Options_GamepadCommandWheel_UE5_C.CreateInputLabel
// 0x0028 (0x0028 - 0x0000)
struct W_Options_GamepadCommandWheel_UE5_C_CreateInputLabel final
{
public:
	const class UVerticalBox*                     TargetBox;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         Direction;                                         // 0x0020(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadCommandWheel_UE5_C_CreateInputLabel;

// Function W_Options_GamepadCommandWheel_UE5.W_Options_GamepadCommandWheel_UE5_C.ExecuteUbergraph_W_Options_GamepadCommandWheel_UE5
// 0x0078 (0x0078 - 0x0000)
struct W_Options_GamepadCommandWheel_UE5_C_ExecuteUbergraph_W_Options_GamepadCommandWheel_UE5 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Options_GamePad_InputLabel_C*        CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadRadialMenuUseLeftStick_ReturnValue; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Value_1;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EGamepadConfirmationPreset                    CallFunc_GetGamepadRadialMenuConfirmationPresetEnum_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamepadRadialMenuConfirmationPreset_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Value;                  // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVerticalBox*                     K2Node_Event_TargetBox;                            // 0x0048(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Text;                                 // 0x0050(0x0018)(ConstParm)
	uint8                                         K2Node_Event_Direction;                            // 0x0068(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetUseCommandMenuForGamepad_ReturnValue;  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadCommandWheel_UE5_C_ExecuteUbergraph_W_Options_GamepadCommandWheel_UE5;

// Function W_Options_GamepadCommandWheel_UE5.W_Options_GamepadCommandWheel_UE5_C.PopulateOptions
// 0x0014 (0x0014 - 0x0000)
struct W_Options_GamepadCommandWheel_UE5_C_PopulateOptions final
{
public:
	bool                                          CallFunc_GetUseCommandMenuForGamepad_bUsesCommandMenu; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUseCommandMenuForGamepad_ReturnValue;  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamepadConfirmationPreset                    CallFunc_GetGamepadRadialMenuConfirmationPreset_Preset; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadRadialMenuConfirmationPreset_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadRadialMenuUseLeftStick_UseLeftStick; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGamepadRadialMenuUseLeftStick_ReturnValue; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadCommandWheel_UE5_C_PopulateOptions;

// Function W_Options_GamepadCommandWheel_UE5.W_Options_GamepadCommandWheel_UE5_C.ResetToDefaults
// 0x0008 (0x0008 - 0x0000)
struct W_Options_GamepadCommandWheel_UE5_C_ResetToDefaults final
{
public:
	class UReadyOrNotGameUserSettings*            CallFunc_GetReadyOrNotGameUserSettings_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadCommandWheel_UE5_C_ResetToDefaults;

// Function W_Options_GamepadCommandWheel_UE5.W_Options_GamepadCommandWheel_UE5_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_Options_GamepadCommandWheel_UE5_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_GamepadCommandWheel_UE5_C_BP_GetDesiredFocusTarget;

}

