#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_Button_With_Status

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Options_Button_With_Status.W_Options_Button_With_Status_C.BndEvt__W_Options_Button_With_Status_Button_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Options_Button_With_Status_C_BndEvt__W_Options_Button_With_Status_Button_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Button_With_Status_C_BndEvt__W_Options_Button_With_Status_Button_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature;

// Function W_Options_Button_With_Status.W_Options_Button_With_Status_C.BndEvt__W_Options_Button_With_Status_Button_K2Node_ComponentBoundEvent_1_OnValueStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Button_With_Status_C_BndEvt__W_Options_Button_With_Status_Button_K2Node_ComponentBoundEvent_1_OnValueStateChange__DelegateSignature final
{
public:
	bool                                          bNewCheckState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Button_With_Status_C_BndEvt__W_Options_Button_With_Status_Button_K2Node_ComponentBoundEvent_1_OnValueStateChange__DelegateSignature;

// Function W_Options_Button_With_Status.W_Options_Button_With_Status_C.ExecuteUbergraph_W_Options_Button_With_Status
// 0x0058 (0x0058 - 0x0000)
struct W_Options_Button_With_Status_C_ExecuteUbergraph_W_Options_Button_With_Status final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Button_C*                            K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bNewCheckState;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bChecked;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_NewStatus;                            // 0x0028(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OnOffButton_C*                       K2Node_DynamicCast_AsW_on_Off_Button;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Button_With_Status_C_ExecuteUbergraph_W_Options_Button_With_Status;

// Function W_Options_Button_With_Status.W_Options_Button_With_Status_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Button_With_Status_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Button_With_Status_C_PreConstruct;

// Function W_Options_Button_With_Status.W_Options_Button_With_Status_C.Set Checked
// 0x0018 (0x0018 - 0x0000)
struct W_Options_Button_With_Status_C_Set_Checked final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OnOffButton_C*                       K2Node_DynamicCast_AsW_on_Off_Button;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Button_With_Status_C_Set_Checked;

// Function W_Options_Button_With_Status.W_Options_Button_With_Status_C.Set Status
// 0x0020 (0x0020 - 0x0000)
struct W_Options_Button_With_Status_C_Set_Status final
{
public:
	class FText                                   Status;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Button_With_Status_C_Set_Status;

// Function W_Options_Button_With_Status.W_Options_Button_With_Status_C.SetCheckedState
// 0x0001 (0x0001 - 0x0000)
struct W_Options_Button_With_Status_C_SetCheckedState final
{
public:
	bool                                          bChecked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Options_Button_With_Status_C_SetCheckedState;

// Function W_Options_Button_With_Status.W_Options_Button_With_Status_C.SetWidgetStatus
// 0x0018 (0x0018 - 0x0000)
struct W_Options_Button_With_Status_C_SetWidgetStatus final
{
public:
	class FText                                   NewStatus;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_W_Options_Button_With_Status_C_SetWidgetStatus;

}

