#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_Audio_UE5

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_Audio_UE5.W_Options_Audio_UE5_C
// 0x0088 (0x04A0 - 0x0418)
class UW_Options_Audio_UE5_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_CommonCarousel_C*                    Audio_AudioMix;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Audio_DefaultVoipChannel;                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Audio_InputAudioDevice;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_MasterVolume;                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_MicGainVolume;                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_MusicVolume;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_SFXVolume;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_SubtitlesBackgroundOpacity;           // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_SubtitlesSpeed;                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_UIVolume;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_VOIPVolume;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                       Audio_SubtitlesEnabled;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Audio_SubtitlesLanguage;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Audio_SubtitlesSize;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             Tab_Audio;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Options_Audio_UE5_Audio_AudioMix_K2Node_ComponentBoundEvent_4_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Audio_UE5_Audio_DefaultVoipChannel_K2Node_ComponentBoundEvent_0_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Audio_UE5_Audio_InputAudioDevice_K2Node_ComponentBoundEvent_3_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Audio_UE5_Audio_SubtitlesLanguage_K2Node_ComponentBoundEvent_2_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Audio_UE5_Audio_SubtitlesSize_K2Node_ComponentBoundEvent_1_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_MasterVolume_1_K2Node_ComponentBoundEvent_25_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_MicGainVolume_1_K2Node_ComponentBoundEvent_40_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_MusicVolume_1_K2Node_ComponentBoundEvent_32_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_SFXVolume_1_K2Node_ComponentBoundEvent_29_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_SubtitlesBackgroundOpacity_K2Node_ComponentBoundEvent_66_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_SubtitlesSpeed_K2Node_ComponentBoundEvent_67_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_UIVolume_1_K2Node_ComponentBoundEvent_31_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_VOIPVolume_1_K2Node_ComponentBoundEvent_37_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_SubtitlesEnabled_K2Node_ComponentBoundEvent_64_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_W_Options_Audio_UE5(int32 EntryPoint);
	void PopulateAudioSettings();
	void PopulateSubtitleLocales(class UW_CommonCarousel_C* Carousel);
	void ResetDefaultAudio();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Options_Audio_UE5_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Options_Audio_UE5_C")
	}
	static class UW_Options_Audio_UE5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Options_Audio_UE5_C>();
	}
};
DUMPER7_ASSERTS_UW_Options_Audio_UE5_C;

}

