#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_Graphics_FOV

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_Graphics_FOV.W_Options_Graphics_FOV_C
// 0x0070 (0x0488 - 0x0418)
class UW_Options_Graphics_FOV_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_CommonCarousel_C*                    Options_FOV_Scaling;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                    Options_FOVPreset;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Simple_Slider_FOV_Weapon;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    SimpleGraphics_Slider_FieldOfView;                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              WeaponFOV_Custom_Container;                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              WeaponFOVContainer;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          StagedUseVerticalFOV;                              // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StagedFOV;                                         // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StagedWeaponFOV;                                   // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponFOVPreset                              StagingWeaponFOVPreset;                            // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool VerticalFov, double WorldFov, double WeaponFov, EWeaponFOVPreset FovPreset, bool GraphicsChanged)> SyncVariables; // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          GraphicsChanged;                                   // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0481(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__SimpleGraphics_Slider_FieldOfView_K2Node_ComponentBoundEvent_21_OnIntegralValueChanged__DelegateSignature(int32 NewIntegerValue, double NewSliderValue);
	void BndEvt__W_Options_Graphics_UE5_Options_FOV_Scaling_K2Node_ComponentBoundEvent_17_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Graphics_UE5_Options_FOVPreset_K2Node_ComponentBoundEvent_16_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BndEvt__W_Options_Graphics_UE5_Simple_Slider_FOV_Weapon_K2Node_ComponentBoundEvent_14_OnIntegralValueChanged__DelegateSignature(int32 NewIntegerValue, double NewSliderValue);
	void ExecuteUbergraph_W_Options_Graphics_FOV(int32 EntryPoint);
	void PopulateOptions();
	void PushVariables();
	void UpdateWeaponFOVText();
	void UpdateWorldFOVText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Options_Graphics_FOV_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Options_Graphics_FOV_C")
	}
	static class UW_Options_Graphics_FOV_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Options_Graphics_FOV_C>();
	}
};
DUMPER7_ASSERTS_UW_Options_Graphics_FOV_C;

}

