#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Overview_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Overview_V2.W_Overview_V2_C
// 0x0108 (0x0538 - 0x0430)
class UW_Overview_V2_C final : public UOverview_V2
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_ArmorOverviewSlot_C*                 ArmorOverview;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            btn_ArmorMunitions;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Loadout_UnitSelect_C*                CharacterSelect;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       lbl_Preset;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             Loadout;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutSlot_v2_C*                    LongTactical;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PresetBox;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SmallSlot_v2_C*                      PresetName;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutSlot_v2_C*                    Primary;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutSlot_v2_C*                    Secondary;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HeadwearOverviewSlot_C*              W_HeadwearOverviewSlot;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Loadout_PresetDropdown_C*            W_Loadout_PresetDropdown;                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MunitionsOverviewSlot_C*             W_MunitionsSlot;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& Name)> CharacterChanged;                      // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CharacterIndex;                                    // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Character_Index;                                   // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseGamepad;                                       // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadout_V2*                            Loadout_V2;                                        // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                LastHovered;                                       // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULoadoutSlot_V2*                        DefaultFocus;                                      // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ULoadoutSlot_V2*>                LoadoutSlots;                                      // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class FString, class FText>              LoadoutPresetOptions;                              // 0x04E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BackPage(bool* Handled);
	void BndEvt__W_Overview_V2_ArmorOverview_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature(class UW_ArmorOverviewSlot_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_btn_ArmorMunitions_K2Node_ComponentBoundEvent_21_Hovered__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_Overview_V2_btn_ArmorMunitions_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_Overview_V2_CharacterSelect_Dropdown_K2Node_ComponentBoundEvent_0_OnCarouselNext__DelegateSignature();
	void BndEvt__W_Overview_V2_CharacterSelect_Dropdown_K2Node_ComponentBoundEvent_16_OnEquippingUnitSelected__DelegateSignature(const struct FST_EquippingUnit& EquippingUnitInfo);
	void BndEvt__W_Overview_V2_CharacterSelect_Dropdown_K2Node_ComponentBoundEvent_7_OnCarouselPrevious__DelegateSignature();
	void BndEvt__W_Overview_V2_LongTactical_K2Node_ComponentBoundEvent_20_OnClick__DelegateSignature(class UW_LoadoutSlot_v2_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_LongTactical_K2Node_ComponentBoundEvent_23_OnUnhover__DelegateSignature();
	void BndEvt__W_Overview_V2_LongTactical_K2Node_ComponentBoundEvent_8_OnHover__DelegateSignature(class UW_LoadoutSlot_v2_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_PresetName_K2Node_ComponentBoundEvent_19_OnClick__DelegateSignature(class UW_SmallSlot_v2_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_Primary_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature(class UW_LoadoutSlot_v2_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_Primary_K2Node_ComponentBoundEvent_12_OnUnhover__DelegateSignature();
	void BndEvt__W_Overview_V2_Primary_K2Node_ComponentBoundEvent_3_OnHover__DelegateSignature(class UW_LoadoutSlot_v2_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_Secondary_K2Node_ComponentBoundEvent_13_OnUnhover__DelegateSignature();
	void BndEvt__W_Overview_V2_Secondary_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature(class UW_LoadoutSlot_v2_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_Secondary_K2Node_ComponentBoundEvent_6_OnHover__DelegateSignature(class UW_LoadoutSlot_v2_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_W_HeadwearOverviewSlot_K2Node_ComponentBoundEvent_25_OnHover__DelegateSignature(class UW_HeadwearOverviewSlot_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_W_HeadwearOverviewSlot_K2Node_ComponentBoundEvent_33_OnClick__DelegateSignature(class UW_HeadwearOverviewSlot_C* TriggeringSlot);
	void BndEvt__W_Overview_V2_W_Loadout_PresetDropdown_K2Node_ComponentBoundEvent_11_OnPresetSelected__DelegateSignature(const class FString& PresetName_0);
	void BndEvt__W_Overview_V2_W_Loadout_PresetDropdown_K2Node_ComponentBoundEvent_14_OnSaveModifiedPresetClicked__DelegateSignature(const class FString& ModifiedPreset);
	void BndEvt__W_Overview_V2_W_Loadout_PresetDropdown_K2Node_ComponentBoundEvent_15_OnSaveNewPresetClicked__DelegateSignature();
	void BndEvt__W_Overview_V2_W_Loadout_PresetDropdown_K2Node_ComponentBoundEvent_17_OnDeletePresetClicked__DelegateSignature(const class FString& PresetName_0);
	void BndEvt__W_Overview_V2_W_Loadout_PresetDropdown_K2Node_ComponentBoundEvent_18_OnDefaultPresetSelected__DelegateSignature();
	void BndEvt__W_Overview_V2_W_Loadout_PresetDropdown_K2Node_ComponentBoundEvent_22_OnPresetMenuClosed__DelegateSignature();
	void BndEvt__W_Overview_V2_W_Loadout_PresetDropdown_K2Node_ComponentBoundEvent_26_OnLoadoutPresetHovered__DelegateSignature(const struct FSavedLoadout& SavedLoadout);
	void BndEvt__W_Overview_V2_W_MunitionsSlot_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ChangePage(class FName PageName);
	void Construct();
	void DisableLoadoutPreview();
	bool Equipping_Unit_Is_Self(const class FString& Unit_ID);
	void ExecuteUbergraph_W_Overview_V2(int32 EntryPoint);
	void Hide(double Delay, bool Collapse);
	void InitializeLoadoutPresets();
	void InputMethodChanged(ECommonInputType bNewInputType);
	void OnCharacterSelectionNext();
	void OnCharacterSelectionPrevious();
	void OnInitialized();
	bool Preset_Exists();
	void PresetApplied(const class FString& Name_0, const struct FSavedLoadout& Loadout_0);
	void PresetModified(bool PresetDirty);
	void RefreshOverviewSlots();
	void Reveal(double Delay);
	void Select_Character(const class FString& Unit_ID, EEquippingSwat SwatMember, class AReadyOrNotPlayerState* Player_State);
	void Set_Current_Preset_Name();
	void SetInputMode(bool IsGamepad);
	void SetLastHovered(class UWidget* Widget);
	void SetLoadoutPreview(const struct FSavedLoadout& Loadout_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Unequip_Preset_If_Deleted(EEquippingSwat Swat_Member);
	void Update_Active_Character();
	void UpdateBodyArmor();
	void UpdateHeadwear();
	void UpdateLongTactical();
	void UpdateMunitions();
	void UpdatePrimary();
	void UpdateSecondary();
	void UpdateStyle(bool bUseGamepad_0);

	class UWidget* BP_GetDesiredFocusTarget() const;
	void GetFocusTarget(class UWidget** Focus) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Overview_V2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Overview_V2_C")
	}
	static class UW_Overview_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Overview_V2_C>();
	}
};
DUMPER7_ASSERTS_UW_Overview_V2_C;

}

