#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayersList

#include "Basic.hpp"

#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayersList.W_PlayersList_C
// 0x00C0 (0x0538 - 0x0478)
class UW_PlayersList_C final : public UPlayersList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_168;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            InviteButton;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_0;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        LastScrolloffset;                                  // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLobbyPlayer                           HoveredPlayer;                                     // 0x04A0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              FocusedPlayerCallback;                             // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              PlayerBlockedCallback;                             // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HoveredInvite;                                     // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Ban_Player(const struct FLobbyPlayer& Lobby_Player);
	void BndEvt__W_PlayersList_InviteButton_K2Node_ComponentBoundEvent_0_Unhovered__DelegateSignature();
	void BndEvt__W_PlayersList_W_Button_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_PlayersList_W_Button_K2Node_ComponentBoundEvent_3_Hovered__DelegateSignature(class UW_Button_C* Button);
	void BP_OnActivated();
	void Construct();
	void Create_Player_Item(class APlayerController* OwningPlayer, const struct FLobbyPlayer& Player);
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FLobbyPlayer& Player);
	void ExecuteUbergraph_W_PlayersList(int32 EntryPoint);
	void KickPlayer(const struct FLobbyPlayer& LobbyPlayer);
	bool Lobby_Is_Full();
	void OnFailure_Event_0();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnMuteStateDelegate_Event_0();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnSuccess_Event_0();
	void PreConstruct(bool IsDesignTime);
	void RefreshPlayerEntry(const struct FLobbyPlayer& Player);
	void Toggle_Mute_Player(const struct FLobbyPlayer& LobbyPlayer, class UW_PlayersList_Entry_C* EntryRef);
	void UpdatePlayersList();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_PlayersList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_PlayersList_C")
	}
	static class UW_PlayersList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlayersList_C>();
	}
};
DUMPER7_ASSERTS_UW_PlayersList_C;

}

