#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PreMission_PlanningMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PreMission_PlanningMap.W_PreMission_PlanningMap_C
// 0x0378 (0x0860 - 0x04E8)
class UW_PreMission_PlanningMap_C final : public UMissionPlanWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GamepadCrosshairHover;                             // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_PremissionTablet_Button_C*           btn_Legend;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PremissionTablet_Button_C*           btn_Players;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       GamepadCrosshair;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icn_GPS;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              lbl_GPS;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LevelSwitcher;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvas;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              MapBaseScale;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PreviewCanvas;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMissionPlanLinesWidget*                PreviewLineRenderer;                               // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SwitcherScaleBox;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              txt_NoMap;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PreMission_PlanningMap_Level_C*      W_PreMission_PlanningMap_Level;                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PreMission_Tablet_Legend_C*          W_PreMission_Tablet_Legend;                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Premission_Tablet_PlayerList_C*      W_Premission_Tablet_PlayerList;                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<int32, class UW_PreMission_Tablet_MapMarker_C*> MarkerMap;                                  // 0x0570(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        DefaultZoomIncrements;                             // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinZoom;                                           // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxZoom;                                           // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentZoom;                                       // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LastNormalizedLocation;                            // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Radial_MapMarking_C*                 Radial;                                            // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RadialCoords;                                      // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RecreateRadial;                                    // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Panning;                                           // 0x0609(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CreatingLine;                                      // 0x060A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RadialOpen;                                        // 0x060B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PreMission_PlanningMap_Line_C*       PreviewLine_0;                                     // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPlanningLine                          NewLine;                                           // 0x0618(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWidget*>                        TempLine;                                          // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<int32, class UCanvasPanel*>              LineMap;                                           // 0x0650(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UW_PreMission_Tablet_MapMarker_C*       RotatingMarker;                                    // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentFloor;                                      // 0x06A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AC[0x4];                                      // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FLevelFloorData>           Levels;                                            // 0x06B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(const class FString& MissionURL, const struct FLevelFloor& FloorData)> OnMapLevelChanged; // 0x0700(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<int32, class UW_PreMission_PlanningMap_Level_C*> LevelCanvases;                             // 0x0710(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCanvasPanel*                           CurrentMarkerCanvas;                               // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CursorZoomWeight;                                  // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CurrentMission;                                    // 0x0770(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<int32, struct FLevelFloor>               OrderedFloors;                                     // 0x0780(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LegendOpen;                                        // 0x07D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EntryPointsOpen;                                   // 0x07D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D2[0x6];                                      // 0x07D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PreMission_Tablet_EntryPoint_C*      CurrentActiveEntryPointButton;                     // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeadPlayer;                                      // 0x07E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PreMission_Tablet_EntryPoint_Selection_C* EntryPointPopout;                             // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PanMouseStart;                                     // 0x07F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PanCanvasStart;                                    // 0x0800(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsingGamepad;                                    // 0x0810(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LeftStickPosition;                                 // 0x0818(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentZoomDirection;                              // 0x0830(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDrawing;                                         // 0x0834(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_835[0x3];                                      // 0x0835(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ZoomVelocity;                                      // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnMapInputOptionsChange;                           // 0x0840(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         HoveredLineId;                                     // 0x0850(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HoveredIconId;                                     // 0x0854(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeftMouseButtonDown;                             // 0x0858(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayerListOpen;                                  // 0x0859(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddPreviewLinePoint(const struct FVector2D& Coordinates);
	void BackPage(bool* Handled);
	void BndEvt__W_PreMission_PlanningMap_btn_Legend_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UW_PremissionTablet_Button_C* TriggeringButton);
	void BndEvt__W_PreMission_PlanningMap_btn_Players_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(class UW_PremissionTablet_Button_C* TriggeringButton);
	void ChangeFloorByIndex(int32 Index_0);
	void ChangeFloorByNumber(int32 FloorNumber);
	void ChangePage(class FName PageName);
	void Clamp_Map_Coorinates_to_Screen_View(double in_x, double in_y, double* X, double* Y);
	void CloseRadial();
	void Construct();
	void CreateEntryPoints(const struct FLevelDataLookupTable& LevelDataLookupTable, const TDelegate<void(class UW_PreMission_Tablet_EntryPoint_C* Clicked)>& OnEntryPointSelected);
	void CreateMapLevelCanvas(int32 Index_0, const struct FLevelFloor& LevelData);
	void DrawLine(int32 ID, const struct FPlanningLine& LineData);
	void DrawMarker(const int32& MarkerID, const struct FPlanningMarker& MarkerData);
	void EndMarkerRotation(class UW_PreMission_Tablet_MapMarker_C* TriggeringMarker);
	void EraseLine(int32 ID);
	void ExecuteUbergraph_W_PreMission_PlanningMap(int32 EntryPoint);
	void Gamepad_Move_Map();
	void Gamepad_Zoom_Map(double DeltaTime);
	void GetCurrentLevelMap(class UW_PreMission_PlanningMap_Level_C** CurrentLevelCanvas);
	void GetGamepadMidPoint(struct FVector2D* Coordinates);
	void GetLineAngle(const struct FVector2D& PointA, const struct FVector2D& PointB, double* Angle);
	void GetLineLength(const struct FVector2D& PointA, const struct FVector2D& PointB, double* Length);
	bool GetVectorOverThreshold(const struct FVector2D& Delta, double Threshold);
	void GoBackInRadial();
	struct FEventReply HandleEntryPointsBorderClicked(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Hide(double Delay, bool Collapse);
	void IsGamepadCrosshairHovering(bool* Hovering);
	void IsValidEntryPoint(TArray<ECOOPMode>& ExcludedGameModes, bool* IsValid);
	void LineDrawn(const int32 LineID, const class UCanvasPanel* LineCanvas);
	void LineStartNodeRightClicked(class UW_OfficerMarker_C* OfficerMarker);
	void LineStartNodeSelected(class UW_OfficerMarker_C* OfficerMarker);
	void MapMarkerDrawn(const int32 MarkerID, const class UW_PreMission_Tablet_MapMarker_C* Marker);
	void MarkerRotated(class UW_PreMission_Tablet_MapMarker_C* TriggeringMarker, int32 Floor, double Rotation);
	void MissionChanged(const class FString& MissionURL, const struct FLevelDataLookupTable& LevelData);
	void MissionSetup(const class FString& URL, const struct FLevelDataLookupTable& LevelData);
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void OnEntryPointChanged(const struct FEntryPoint& NewEntryPoint);
	void OnEntryPointSelected(class UW_PreMission_Tablet_EntryPoint_C* Clicked);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnInputChange(ECommonInputType bNewInputType);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnLeftClickUp(const struct FGeometry& InGeometry, const struct FPointerEvent& InMouseEvent);
	void OnLineAdded(int32 ID, const struct FPlanningLine& Line);
	void OnLineRemoved(int32 ID);
	void OnMarkerAdded(int32 ID, const struct FPlanningMarker& Marker);
	void OnMarkerRemoved(int32 ID);
	void OnMissionChanged(const class FString& URL, const struct FLevelDataLookupTable& LevelData);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OpenRadial(const struct FVector2D& CursorPosition);
	void PreConstruct(bool IsDesignTime);
	void RadialCollapsed();
	void RadialMarkerSelected(class FName CategoryName, class FName MarkerName);
	void RemovePreviewLine();
	void Reveal(double Delay);
	void RotateMarker(class UW_PreMission_Tablet_MapMarker_C* RotatingMarker_0, const struct FVector2D& MousePos);
	void ScaleLineWeightByZoom(double CurrentZoom_0);
	void Set_Hovered_Ids(int32 LineID, int32 IconId);
	void SetInputMode(bool IsGamepad);
	struct FEventReply SetLinePart();
	void StartMarkerRotation(class UW_PreMission_Tablet_MapMarker_C* TriggeringMarker);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Toggle_Radial(const struct FVector2D& Coordinates);
	void ToggleEntrySelection();
	void ToggleLegend();
	void TogglePlayerList();
	void UpdateEntryPointSelection(const struct FEntryPoint& EntryPointData);
	void UpdatePreviewLine(const struct FVector2D& MousePos);
	void Zoom(const struct FGeometry& Geometry, const struct FPointerEvent& PointerEvent, bool ZoomOnCursor_0, bool ZoomIn, double ZoomIncrements);
	void ZoomOnCursor(const struct FGeometry& Geometry, const struct FPointerEvent& PointerEvent, double PreviousZoom, double NewZoom);

	void GetFocusTarget(class UWidget** Focus) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_PreMission_PlanningMap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_PreMission_PlanningMap_C")
	}
	static class UW_PreMission_PlanningMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PreMission_PlanningMap_C>();
	}
};
DUMPER7_ASSERTS_UW_PreMission_PlanningMap_C;

}

