#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Premission_Tablet_Overlay

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Premission_Tablet_Overlay.W_Premission_Tablet_Overlay_C
// 0x0040 (0x0330 - 0x02F0)
class UW_Premission_Tablet_Overlay_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_ScreenFooter_C*                      BriefFooter;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScreenFooter_C*                      ChatFooter;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScreenFooter_C*                      MapFooter;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScreenFooter_C*                      RosterFooter;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScreenFooter_C*                      TeamViewFooter;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PreMission_Tablet_C*                 PremissionTablet;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ScreenFooter_C*                      ActiveFooter;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_Premission_Tablet_Overlay(int32 EntryPoint);
	void HandleInputChange(ECommonInputType bNewInputType);
	void ScreenChange();
	void SetChatFooterVisibility(bool bIsChatVisible);
	void SetVisibilityFromBool(class UCommonUserWidget* Widget, bool Bool, ESlateVisibility VisibilityIfTrue, ESlateVisibility VisibilityIfFalse, bool* SameBool);
	void SubscribeToTabletEvents(class UW_PreMission_Tablet_C* Tablet);
	void Update_Brief_Buttons();
	void Update_Map_Buttons();
	void Update_Roster_Buttons();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Premission_Tablet_Overlay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Premission_Tablet_Overlay_C")
	}
	static class UW_Premission_Tablet_Overlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Premission_Tablet_Overlay_C>();
	}
};
DUMPER7_ASSERTS_UW_Premission_Tablet_Overlay_C;

}

