#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PreMission_Tablet_Roster_MP

#include "Basic.hpp"

#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PreMission_Tablet_Roster_MP.W_PreMission_Tablet_Roster_MP_C
// 0x0078 (0x04A0 - 0x0428)
class UW_PreMission_Tablet_Roster_MP_C final : public URosterSelectionWidget
{
public:
	class UW_PremissionTablet_Button_C*           btn_ChangeTeam;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PremissionTablet_Button_C*           btn_Invite;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_PlayerList;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class AReadyOrNotPlayerState*, class UW_PreMission_Tablet_Roster_Entry_C*> RosterMap;       // 0x0440(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	class UW_RosterSelection_Card_C*              PreviousCharacterCard;                             // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERosterSquadPosition                          CurrentPositionSelection;                          // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddPlayer(const class AReadyOrNotPlayerState*& Ready_or_Not_Player_State);
	void RemovePlayer(class AReadyOrNotPlayerState* Ready_or_Not_Player_State);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_PreMission_Tablet_Roster_MP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_PreMission_Tablet_Roster_MP_C")
	}
	static class UW_PreMission_Tablet_Roster_MP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PreMission_Tablet_Roster_MP_C>();
	}
};
DUMPER7_ASSERTS_UW_PreMission_Tablet_Roster_MP_C;

}

