#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_QuickPlay_Acknowledgement

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_QuickPlay_Acknowledgement.W_QuickPlay_Acknowledgement_C.BndEvt__W_CommanderIntro_IntroButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_QuickPlay_Acknowledgement_C_BndEvt__W_CommanderIntro_IntroButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_QuickPlay_Acknowledgement_C_BndEvt__W_CommanderIntro_IntroButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function W_QuickPlay_Acknowledgement.W_QuickPlay_Acknowledgement_C.ExecuteUbergraph_W_QuickPlay_Acknowledgement
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlay_Acknowledgement_C_ExecuteUbergraph_W_QuickPlay_Acknowledgement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenu_V3_C*                       CallFunc_GetFirstWidgetOfClass_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_QuickPlay_Acknowledgement_C_ExecuteUbergraph_W_QuickPlay_Acknowledgement;

// Function W_QuickPlay_Acknowledgement.W_QuickPlay_Acknowledgement_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_QuickPlay_Acknowledgement_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_QuickPlay_Acknowledgement_C_BP_GetDesiredFocusTarget;

}

