#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Quickplay_Station_Acknowledgement

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Quickplay_Station_Acknowledgement.W_Quickplay_Station_Acknowledgement_C.BndEvt__W_Quickplay_Station_Acknowledgement_btn_No_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Quickplay_Station_Acknowledgement_C_BndEvt__W_Quickplay_Station_Acknowledgement_btn_No_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Quickplay_Station_Acknowledgement_C_BndEvt__W_Quickplay_Station_Acknowledgement_btn_No_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature;

// Function W_Quickplay_Station_Acknowledgement.W_Quickplay_Station_Acknowledgement_C.BndEvt__W_Quickplay_Station_Acknowledgement_btn_Yes_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Quickplay_Station_Acknowledgement_C_BndEvt__W_Quickplay_Station_Acknowledgement_btn_Yes_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Quickplay_Station_Acknowledgement_C_BndEvt__W_Quickplay_Station_Acknowledgement_btn_Yes_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function W_Quickplay_Station_Acknowledgement.W_Quickplay_Station_Acknowledgement_C.ExecuteUbergraph_W_Quickplay_Station_Acknowledgement
// 0x0030 (0x0030 - 0x0000)
struct W_Quickplay_Station_Acknowledgement_C_ExecuteUbergraph_W_Quickplay_Station_Acknowledgement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMainMenuGM*                            K2Node_DynamicCast_AsMain_Menu_GM;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveStationQuickplay_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Quickplay_Station_Acknowledgement_C_ExecuteUbergraph_W_Quickplay_Station_Acknowledgement;

// Function W_Quickplay_Station_Acknowledgement.W_Quickplay_Station_Acknowledgement_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_Quickplay_Station_Acknowledgement_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Quickplay_Station_Acknowledgement_C_BP_GetDesiredFocusTarget;

}

