#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RadioContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_RadioContainer.W_RadioContainer_C.OnNewChildSelected
// 0x0028 (0x0028 - 0x0000)
struct W_RadioContainer_C_OnNewChildSelected final
{
public:
	TScriptInterface<class IIRadioWidget_C>       NewSelectedChild;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Equals_Result;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_RadioContainer_C_OnNewChildSelected;

// Function W_RadioContainer.W_RadioContainer_C.RegisterRadioChild
// 0x0018 (0x0018 - 0x0000)
struct W_RadioContainer_C_RegisterRadioChild final
{
public:
	TScriptInterface<class IIRadioWidget_C>       NewChild;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_RadioContainer_C_RegisterRadioChild;

}

