#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RadialSelectionBase

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_RadialSelectionBase.W_RadialSelectionBase_C.ExecuteUbergraph_W_RadialSelectionBase
// 0x0020 (0x0020 - 0x0000)
struct W_RadialSelectionBase_C_ExecuteUbergraph_W_RadialSelectionBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABasePlayer_C*                          K2Node_DynamicCast_AsBase_Player;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_RadialSelectionBase_C_ExecuteUbergraph_W_RadialSelectionBase;

// Function W_RadialSelectionBase.W_RadialSelectionBase_C.Next
// 0x0001 (0x0001 - 0x0000)
struct W_RadialSelectionBase_C_Next final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_RadialSelectionBase_C_Next;

// Function W_RadialSelectionBase.W_RadialSelectionBase_C.OnDeselected
// 0x0001 (0x0001 - 0x0000)
struct W_RadialSelectionBase_C_OnDeselected final
{
public:
	bool                                          Play_Animation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_RadialSelectionBase_C_OnDeselected;

// Function W_RadialSelectionBase.W_RadialSelectionBase_C.OnSelected
// 0x0001 (0x0001 - 0x0000)
struct W_RadialSelectionBase_C_OnSelected final
{
public:
	bool                                          Play_Animation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_RadialSelectionBase_C_OnSelected;

// Function W_RadialSelectionBase.W_RadialSelectionBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RadialSelectionBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_RadialSelectionBase_C_PreConstruct;

// Function W_RadialSelectionBase.W_RadialSelectionBase_C.Previous
// 0x0002 (0x0002 - 0x0000)
struct W_RadialSelectionBase_C_Previous final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSucceeded;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_RadialSelectionBase_C_Previous;

// Function W_RadialSelectionBase.W_RadialSelectionBase_C.Select
// 0x0004 (0x0004 - 0x0000)
struct W_RadialSelectionBase_C_Select final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_RadialSelectionBase_C_Select;

// Function W_RadialSelectionBase.W_RadialSelectionBase_C.UpdateIcon
// 0x00E0 (0x00E0 - 0x0000)
struct W_RadialSelectionBase_C_UpdateIcon final
{
public:
	int32                                         SelectionIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            InBrush;                                           // 0x0010(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_RadialSelectionBase_C_UpdateIcon;

}

