#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RoundupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RoundupWidget.W_RoundupWidget_C
// 0x0070 (0x04D8 - 0x0468)
class UW_RoundupWidget_C final : public URoundupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RevealContent;                                     // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reveal;                                            // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           ContentBox;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       FooterSwitcher;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RoundupActions;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RoundupActionsDivider;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RoundUplocksDivider;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RoundupUnlocks;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Footer_C*                            W_Footer;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Footer_C*                            W_Footer_Trigger;                                  // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          SwitchBumpers;                                     // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddRoundupAction(const class FText& Action);
	void AddRoundupEntry(const class FText& Text, class UVerticalBox* VerticalBox);
	void AddRoundupUnlock(const class FText& Unlock);
	void BndEvt__W_RoundupWidget_W_Footer_1_K2Node_ComponentBoundEvent_1_OnDismissInputAction__DelegateSignature();
	void BndEvt__W_RoundupWidget_W_Footer_K2Node_ComponentBoundEvent_0_OnDismissInputAction__DelegateSignature();
	void CollapseContent();
	void Construct();
	void EmptyWidget();
	void ExecuteUbergraph_W_RoundupWidget(int32 EntryPoint);
	void ExpandContent();
	void HideRoundupActions();
	void HideRoundupUnlocks();
	void HideWidget();
	void OnAnimationComplete();
	void PreConstruct(bool IsDesignTime);
	void RefreshWidget();
	void SetupSampleData();
	void ShowWidget();
	void ToggleContent();
	void UpdateFooter(bool InitializeFooter);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_RoundupWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_RoundupWidget_C")
	}
	static class UW_RoundupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_RoundupWidget_C>();
	}
};
DUMPER7_ASSERTS_UW_RoundupWidget_C;

}

