#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Roster_OfficerEvent_Entry

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Roster_OfficerEvent_Entry.W_Roster_OfficerEvent_Entry_C.ExecuteUbergraph_W_Roster_OfficerEvent_Entry
// 0x0008 (0x0008 - 0x0000)
struct W_Roster_OfficerEvent_Entry_C_ExecuteUbergraph_W_Roster_OfficerEvent_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Roster_OfficerEvent_Entry_C_ExecuteUbergraph_W_Roster_OfficerEvent_Entry;

// Function W_Roster_OfficerEvent_Entry.W_Roster_OfficerEvent_Entry_C.ExpandEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Roster_OfficerEvent_Entry_C_ExpandEvent final
{
public:
	bool                                          Expanded_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Roster_OfficerEvent_Entry_C_ExpandEvent;

// Function W_Roster_OfficerEvent_Entry.W_Roster_OfficerEvent_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Roster_OfficerEvent_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Roster_OfficerEvent_Entry_C_PreConstruct;

// Function W_Roster_OfficerEvent_Entry.W_Roster_OfficerEvent_Entry_C.SetEventText
// 0x0018 (0x0018 - 0x0000)
struct W_Roster_OfficerEvent_Entry_C_SetEventText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_Roster_OfficerEvent_Entry_C_SetEventText;

}

