#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Roster_Status

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Roster_Status.W_Roster_Status_C
// 0x00D0 (0x04F8 - 0x0428)
class UW_Roster_Status_C final : public UCharacterStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_InputActionButton_C*                 btn_ChangeTeam_Gamepad;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButton_C*                        btn_ChangeTeam_MKB;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            btn_ClosePage_1;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CharacterList;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Characters;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icn_Close_1;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_div_header_1;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PlayerCount;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             PlayerScrollBox;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               PlayerWrapBox;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_RosterSelf_Card_C*                   SelfCard;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       txt_HeaderTitle_1;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       txt_PlayerCount;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_Status;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_TeamList;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Roster_Status_Card_C*                W_Roster_Status_Card;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Roster_Status_Card_C*                W_Roster_Status_Card_1;                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Roster_Status_Card_C*                W_Roster_Status_Card_83;                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Roster_Status_Card_C*                W_Roster_Status_Card_158;                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Roster_PlayerStatus_Card_C*          W_RosterPlayer_1;                                  // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Roster_PlayerStatus_Card_C*          W_RosterPlayer_2;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Roster_PlayerStatus_Card_C*          W_RosterPlayer_3;                                  // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Roster_PlayerStatus_Card_C*          W_RosterPlayer_4;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Roster_PlayerStatus_Card_C*          W_RosterPlayer_Card_1;                             // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bMultiplayer;                                      // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AudioPlayerVisible(class UW_AudioPlayer_C* PlayerWidget, bool PlayerVisible);
	void BndEvt__W_Roster_Status_btn_ChangeTeam_Gamepad_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Roster_Status_btn_ChangeTeam_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Roster_Status_W_RosterPlayer_1_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UW_Roster_PlayerStatus_Card_C* Card);
	void BndEvt__W_Roster_Status_W_RosterPlayer_2_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(class UW_Roster_PlayerStatus_Card_C* Card);
	void BndEvt__W_Roster_Status_W_RosterPlayer_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(class UW_Roster_PlayerStatus_Card_C* Card);
	void BndEvt__W_Roster_Status_W_RosterPlayer_4_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature(class UW_Roster_PlayerStatus_Card_C* Card);
	void BP_OnActivated();
	void CharacterCardClicked(class UW_Roster_Status_Card_C* Card);
	void ClearCards();
	void Construct();
	void CreateBlankPlayerCard();
	void CreateCharacterProxyCard(class UCharacterProxy* CharacterProxy, bool IsLast);
	void CreatePlayerProxyCard(class UCharacterProxy* CharacterProxy);
	void EmptyPlayerCardClicked(class UW_Roster_PlayerStatus_Card_C* Card);
	void ExecuteUbergraph_W_Roster_Status(int32 EntryPoint);
	void GetCardWidgetBySlotIndex(int32 Index_0, class UW_Roster_PlayerStatus_Card_C** CardWidget);
	bool GetIsSelfHost();
	void GetSwatCardWidgetBySlotIndex(int32 Index_0, class UW_Roster_Status_Card_C** CardWidget);
	void InitializePlayerProxyCard(class UCharacterProxy* CharacterProxy, class UW_Roster_PlayerStatus_Card_C* CharacterCard);
	void Input_Changed(ECommonInputType NewParam);
	void IsPlayerSelf(class APlayerState* PlayerState, bool* IsSelf);
	void IsProxySelf(class UCharacterProxy* Proxy, bool* IsSelf);
	void OnCharacterAdded(class UCharacterProxy* CharacterProxy);
	void OnCharacterRemoved(class UCharacterProxy* CharacterProxy);
	void OnRosterCardClicked(class UW_Roster_PlayerStatus_Card_C* Card);
	void PlayerCardClicked(class UW_Roster_PlayerStatus_Card_C* Card);
	void PopulatePlayers();
	void PopulatePlayersByProxy();
	void PopulateTeam();
	void SetPlayerCount(int32 PlayerCount_0, int32 Total);
	void SetTabletState(bool IsAwake);
	void SetVisualTheme(bool UseDarkTheme);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateTeamList(bool bForce);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Roster_Status_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Roster_Status_C")
	}
	static class UW_Roster_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Roster_Status_C>();
	}
};
DUMPER7_ASSERTS_UW_Roster_Status_C;

}

