#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ScreenFooterEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.BackPage
// 0x0001 (0x0001 - 0x0000)
struct W_ScreenFooterEntry_C_BackPage final
{
public:
	bool                                          Handled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_BackPage;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.BndEvt__W_ScreenFooterEntry_W_FooterInputActionButton_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_ScreenFooterEntry_C_BndEvt__W_ScreenFooterEntry_W_FooterInputActionButton_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_BndEvt__W_ScreenFooterEntry_W_FooterInputActionButton_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.ChangePage
// 0x0008 (0x0008 - 0x0000)
struct W_ScreenFooterEntry_C_ChangePage final
{
public:
	class FName                                   PageName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_ChangePage;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.ExecuteUbergraph_W_ScreenFooterEntry
// 0x0080 (0x0080 - 0x0000)
struct W_ScreenFooterEntry_C_ExecuteUbergraph_W_ScreenFooterEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsGamepad;                            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay_1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Collapse;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PageName;                             // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_ExecuteUbergraph_W_ScreenFooterEntry;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.GetButtonID
// 0x0010 (0x0010 - 0x0000)
struct W_ScreenFooterEntry_C_GetButtonID final
{
public:
	class FString                                 ButtonId;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_GetButtonID;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.GetButtonLabel
// 0x0018 (0x0018 - 0x0000)
struct W_ScreenFooterEntry_C_GetButtonLabel final
{
public:
	class FText                                   ButtonLabel;                                       // 0x0000(0x0018)(Parm, OutParm)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_GetButtonLabel;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.GetInputAction
// 0x0010 (0x0010 - 0x0000)
struct W_ScreenFooterEntry_C_GetInputAction final
{
public:
	struct FDataTableRowHandle                    InputAction;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_GetInputAction;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.GetInputActions
// 0x0010 (0x0010 - 0x0000)
struct W_ScreenFooterEntry_C_GetInputActions final
{
public:
	TArray<struct FDataTableRowHandle>            InputActions;                                      // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_GetInputActions;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.GetIsButton
// 0x0001 (0x0001 - 0x0000)
struct W_ScreenFooterEntry_C_GetIsButton final
{
public:
	bool                                          IsButton;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_GetIsButton;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.GetIsMultiInput
// 0x0001 (0x0001 - 0x0000)
struct W_ScreenFooterEntry_C_GetIsMultiInput final
{
public:
	bool                                          IsMulti;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_GetIsMultiInput;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.GetMultipleInputActions
// 0x0010 (0x0010 - 0x0000)
struct W_ScreenFooterEntry_C_GetMultipleInputActions final
{
public:
	TArray<struct FDataTableRowHandle>            InputActions;                                      // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_GetMultipleInputActions;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.GetTriggeringInputAction
// 0x0010 (0x0010 - 0x0000)
struct W_ScreenFooterEntry_C_GetTriggeringInputAction final
{
public:
	struct FDataTableRowHandle                    TriggeringInputAction;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_GetTriggeringInputAction;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.Hide
// 0x0010 (0x0010 - 0x0000)
struct W_ScreenFooterEntry_C_Hide final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Collapse;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_Hide;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.InputSwitched
// 0x0001 (0x0001 - 0x0000)
struct W_ScreenFooterEntry_C_InputSwitched final
{
public:
	bool                                          UseGamepad_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_InputSwitched;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.InputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct W_ScreenFooterEntry_C_InputTypeChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_InputTypeChanged;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ScreenFooterEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_PreConstruct;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.Reveal
// 0x0008 (0x0008 - 0x0000)
struct W_ScreenFooterEntry_C_Reveal final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_Reveal;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.Set Button Text
// 0x0018 (0x0018 - 0x0000)
struct W_ScreenFooterEntry_C_Set_Button_Text final
{
public:
	class FText                                   ButtonText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_Set_Button_Text;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.Set Input Actions
// 0x0138 (0x0138 - 0x0000)
struct W_ScreenFooterEntry_C_Set_Input_Actions final
{
public:
	TArray<struct FDataTableRowHandle>            InInputActions;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FKey                                   Key;                                               // 0x0010(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDataTableRowHandle>            Actions;                                           // 0x0028(0x0010)(Edit, BlueprintVisible)
	class FText                                   LabelText;                                         // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FString                                 CallFunc_Abbreviate_Key_Abreviated_Name;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetButtonLabel_ButtonLabel;               // 0x0080(0x0018)()
	class FText                                   CallFunc_GetButtonLabel_ButtonLabel_1;             // 0x0098(0x0018)()
	struct FDataTableRowHandle                    CallFunc_GetTriggeringInputAction_TriggeringInputAction; // 0x00B0(0x0010)(NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FDataTableRowHandle>            CallFunc_GetInputActions_InputActions;             // 0x00D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetInputActionData_ActionName;            // 0x00F0(0x0018)()
	struct FKey                                   CallFunc_GetInputActionData_ActionKey;             // 0x0108(0x0018)(HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0120(0x0010)(NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_Set_Input_Actions;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.SetFooterEntryData
// 0x0078 (0x0078 - 0x0000)
struct W_ScreenFooterEntry_C_SetFooterEntryData final
{
public:
	struct FScreenFooterEntry                     FooterEntryData_0;                                 // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_SetFooterEntryData;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.SetInputAction
// 0x0088 (0x0088 - 0x0000)
struct W_ScreenFooterEntry_C_SetInputAction final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class FText                                   CallFunc_GetInputActionData_ActionName;            // 0x0010(0x0018)()
	struct FKey                                   CallFunc_GetInputActionData_ActionKey;             // 0x0028(0x0018)(HasGetValueTypeHash)
	class FString                                 CallFunc_Abbreviate_Key_Abreviated_Name;           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	class FText                                   CallFunc_GetButtonLabel_ButtonLabel;               // 0x0068(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_SetInputAction;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.SetInputMode
// 0x0001 (0x0001 - 0x0000)
struct W_ScreenFooterEntry_C_SetInputMode final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_SetInputMode;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.SetLabel
// 0x0018 (0x0018 - 0x0000)
struct W_ScreenFooterEntry_C_SetLabel final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_SetLabel;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.SetMultiInputAction
// 0x0010 (0x0010 - 0x0000)
struct W_ScreenFooterEntry_C_SetMultiInputAction final
{
public:
	TArray<struct FDataTableRowHandle>            InputActionRows;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_SetMultiInputAction;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.UpdateEntry
// 0x0010 (0x0010 - 0x0000)
struct W_ScreenFooterEntry_C_UpdateEntry final
{
public:
	TArray<struct FDataTableRowHandle>            Temp_struct_Variable;                              // 0x0000(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_UpdateEntry;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.UpdateVisualState
// 0x0005 (0x0005 - 0x0000)
struct W_ScreenFooterEntry_C_UpdateVisualState final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsButton_IsButton;                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsButton_IsButton_1;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_UpdateVisualState;

// Function W_ScreenFooterEntry.W_ScreenFooterEntry_C.GetFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct W_ScreenFooterEntry_C_GetFocusTarget final
{
public:
	class UWidget*                                Focus;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ScreenFooterEntry_C_GetFocusTarget;

}

