#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ScreenFooterEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ScreenFooterEntry.W_ScreenFooterEntry_C
// 0x00F0 (0x0558 - 0x0468)
class UW_ScreenFooterEntry_C final : public UPageFooter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_FooterInputActionButton_C*           W_FooterInputActionButton;                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          UseGamepad;                                        // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EntryID;                                           // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FScreenFooterEntry                     FooterEntryData;                                   // 0x0490(0x0078)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class UW_ScreenFooterEntry_C* FooterEntry)> OnClicked;             // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_ScreenFooterEntry_C* FooterEntry)> OnHovered;             // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_ScreenFooterEntry_C* FooterEntry)> OnPressed;             // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_ScreenFooterEntry_C* FooterEntry)> OnReleased;            // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BackPage(bool* Handled);
	void BndEvt__W_ScreenFooterEntry_W_FooterInputActionButton_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ChangePage(class FName PageName);
	void Construct();
	void ExecuteUbergraph_W_ScreenFooterEntry(int32 EntryPoint);
	void GetButtonID(class FString* ButtonId);
	void GetButtonLabel(class FText* ButtonLabel);
	void GetInputAction(struct FDataTableRowHandle* InputAction);
	void GetInputActions(TArray<struct FDataTableRowHandle>* InputActions);
	void GetIsButton(bool* IsButton);
	void GetIsMultiInput(bool* IsMulti);
	void GetMultipleInputActions(TArray<struct FDataTableRowHandle>* InputActions);
	void GetTriggeringInputAction(struct FDataTableRowHandle* TriggeringInputAction);
	void Hide(double Delay, bool Collapse);
	void InputSwitched(bool UseGamepad_0);
	void InputTypeChanged(ECommonInputType bNewInputType);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Reveal(double Delay);
	void Set_Button_Text(const class FText& ButtonText);
	void Set_Input_Actions(TArray<struct FDataTableRowHandle>& InInputActions);
	void SetFooterEntryData(const struct FScreenFooterEntry& FooterEntryData_0);
	void SetInputAction(const struct FDataTableRowHandle& InputActionRow);
	void SetInputMode(bool IsGamepad);
	void SetInputVisibility();
	void SetLabel(const class FText& InText);
	void SetMultiInputAction(TArray<struct FDataTableRowHandle>& InputActionRows);
	void UpdateEntry();
	void UpdateVisualState();

	void GetFocusTarget(class UWidget** Focus) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ScreenFooterEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ScreenFooterEntry_C")
	}
	static class UW_ScreenFooterEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ScreenFooterEntry_C>();
	}
};
DUMPER7_ASSERTS_UW_ScreenFooterEntry_C;

}

