#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ScreenFooter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "ReadyOrNot_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ScreenFooter.W_ScreenFooter_C
// 0x0260 (0x06C8 - 0x0468)
class UW_ScreenFooter_C final : public UPageFooter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas;                                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Center;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_FooterEntries;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Left;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Right;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Fade;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FScreenFooterEntry>             FooterEntriesArray;                                // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class UW_ScreenFooterEntry_C* FooterEntry)> OnFooterEntryClicked;  // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_ScreenFooterEntry_C* FooterEntry)> OnFooterEntryHovered;  // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFooterEntryUnhovered;                            // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Spacing;                                           // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFooterEntriesUpdated;                            // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSet<int32>                                   HiddenIndices;                                     // 0x04F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<class FString>                           HiddenIDs;                                         // 0x0548(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	ECommonInputType                              NewVar_0;                                          // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_ScreenFooterEntry_C*>         EntryWidgets;                                      // 0x05A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWidget*                                FocusedEntry;                                      // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UW_ScreenFooterEntry_C* Entry)> OnFooterEntryPressed;        // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_ScreenFooterEntry_C* Entry)> OnFooterEntryReleased;       // 0x05C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class FString, class UW_ScreenFooterEntry_C*> IdToFooterEntry;                              // 0x05D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSet<class FString>                           DisabledIDs;                                       // 0x0628(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, class FText>              EntryText;                                         // 0x0678(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddFooterEntry(int32 InsertAtIndex, class FString& EntryID, const struct FScreenFooterEntry& ScreenFooterEntry);
	void BackPage(bool* Handled);
	void ChangePage(class FName PageName);
	void Construct();
	void DisableEntryByID(const class FString& EntryID);
	void EnableEntryByID(const class FString& EntryID);
	void ExecuteUbergraph_W_ScreenFooter(int32 EntryPoint);
	void FooterEntryClicked(class UW_ScreenFooterEntry_C* Entry);
	void FooterEntryHovered(class UW_ScreenFooterEntry_C* Entry);
	void FooterEntryPressed(class UW_ScreenFooterEntry_C* Entry);
	void FooterEntryReleased(class UW_ScreenFooterEntry_C* Entry);
	void FooterEntryUnhovered();
	void Hide(double Delay, bool Collapse);
	void HideEntryByID(const class FString& ButtonId);
	void HideEntryByIndex(int32 Index_0);
	void InsertFooterEntryAtIndex();
	bool IsHiddenIndex(const int32& Index_0);
	void PopulateEntries();
	void PreConstruct(bool IsDesignTime);
	void ResetEntryTextByID(const class FString& EntryID);
	void Reveal(double Delay);
	void SetEntryTextByID(const class FString& EntryID, const class FText& NewText);
	void SetFocusByID(const class FString& ID, class UWidget** FocusedEntryButton);
	void SetFooterEntries(const TMap<class FString, struct FScreenFooterEntry>& Footer_Entries);
	void SetInputMode(bool IsGamepad);
	void UnhideEntryByID(const class FString& ID);
	void UnhideEntryByIndex(const int32& Index_0);

	void GetFocusTarget(class UWidget** Focus) const;
	bool IsHiddenEntry(const class FString& EntryID) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ScreenFooter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ScreenFooter_C")
	}
	static class UW_ScreenFooter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ScreenFooter_C>();
	}
};
DUMPER7_ASSERTS_UW_ScreenFooter_C;

}

