#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SocialSettings

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SocialSettings.W_SocialSettings_C
// 0x0030 (0x0448 - 0x0418)
class UW_SocialSettings_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_CommonCarousel_C*                    Audio_DefaultVoipChannel;                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_MicGainVolume;                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                    Audio_Slider_VOIPVolume;                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SocialSettings;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*              W_OptionsContainer_UE5;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_ConsoleLobbyManager_Audio_Slider_MicGainVolume_K2Node_ComponentBoundEvent_2_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_ConsoleLobbyManager_Audio_Slider_VOIPVolume_K2Node_ComponentBoundEvent_1_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SocialSettings_Audio_DefaultVoipChannel_K2Node_ComponentBoundEvent_0_OnPageIndexChanged__DelegateSignature(int32 Index_0, const class FString& Value);
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_W_SocialSettings(int32 EntryPoint);
	void PopulateAudioSettings();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_SocialSettings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_SocialSettings_C")
	}
	static class UW_SocialSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SocialSettings_C>();
	}
};
DUMPER7_ASSERTS_UW_SocialSettings_C;

}

