#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Stats_FriendsList_Entry

#include "Basic.hpp"

#include "ReadyOrNot_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Stats_FriendsList_Entry.W_Stats_FriendsList_Entry_C.ExecuteUbergraph_W_Stats_FriendsList_Entry
// 0x0068 (0x0068 - 0x0000)
struct W_Stats_FriendsList_Entry_C_ExecuteUbergraph_W_Stats_FriendsList_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetProfileResizedURI_ReturnValue;         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_InTexture;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture2D* InTexture)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextStyle*                       CallFunc_GetCurrentTextStyle_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColor_OutColor;                        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0014)()
};
DUMPER7_ASSERTS_W_Stats_FriendsList_Entry_C_ExecuteUbergraph_W_Stats_FriendsList_Entry;

// Function W_Stats_FriendsList_Entry.W_Stats_FriendsList_Entry_C.OnImageFetched
// 0x0008 (0x0008 - 0x0000)
struct W_Stats_FriendsList_Entry_C_OnImageFetched final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Stats_FriendsList_Entry_C_OnImageFetched;

// Function W_Stats_FriendsList_Entry.W_Stats_FriendsList_Entry_C.UpdateFriend
// 0x01E0 (0x01E0 - 0x0000)
struct W_Stats_FriendsList_Entry_C_UpdateFriend final
{
public:
	struct FFriend                                Friend_0;                                          // 0x0000(0x01C8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01C8(0x0018)()
};
DUMPER7_ASSERTS_W_Stats_FriendsList_Entry_C_UpdateFriend;

// Function W_Stats_FriendsList_Entry.W_Stats_FriendsList_Entry_C.UpdatePlatformIcon
// 0x0030 (0x0030 - 0x0000)
struct W_Stats_FriendsList_Entry_C_UpdatePlatformIcon final
{
public:
	EGamePlatform                                 CallFunc_GetPlatform_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetPlatformIcon_NewParam;                 // 0x0008(0x0028)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Stats_FriendsList_Entry_C_UpdatePlatformIcon;

}

