#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Stats_Missions

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Stats_Missions.W_Stats_Missions_C.BackPage
// 0x0001 (0x0001 - 0x0000)
struct W_Stats_Missions_C_BackPage final
{
public:
	bool                                          Handled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Stats_Missions_C_BackPage;

// Function W_Stats_Missions.W_Stats_Missions_C.ChangePage
// 0x0008 (0x0008 - 0x0000)
struct W_Stats_Missions_C_ChangePage final
{
public:
	class FName                                   PageName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Stats_Missions_C_ChangePage;

// Function W_Stats_Missions.W_Stats_Missions_C.ExecuteUbergraph_W_Stats_Missions
// 0x0028 (0x0028 - 0x0000)
struct W_Stats_Missions_C_ExecuteUbergraph_W_Stats_Missions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PageName;                             // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Delay;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Collapse;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsGamepad;                            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Stats_Missions_C_ExecuteUbergraph_W_Stats_Missions;

// Function W_Stats_Missions.W_Stats_Missions_C.Hide
// 0x0010 (0x0010 - 0x0000)
struct W_Stats_Missions_C_Hide final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Collapse;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Stats_Missions_C_Hide;

// Function W_Stats_Missions.W_Stats_Missions_C.Reveal
// 0x0008 (0x0008 - 0x0000)
struct W_Stats_Missions_C_Reveal final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Stats_Missions_C_Reveal;

// Function W_Stats_Missions.W_Stats_Missions_C.SetInputMode
// 0x0001 (0x0001 - 0x0000)
struct W_Stats_Missions_C_SetInputMode final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Stats_Missions_C_SetInputMode;

// Function W_Stats_Missions.W_Stats_Missions_C.GetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_Stats_Missions_C_GetFocusTarget final
{
public:
	class UWidget*                                Focus;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Stats_Missions_C_GetFocusTarget;

}

