#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Stats_Missions

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Stats_Missions.W_Stats_Missions_C
// 0x0030 (0x0448 - 0x0418)
class UW_Stats_Missions_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_62;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Stats_Missions_Favorite_C*           W_Stat_FavoriteMission;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Stats_List_C*                        W_Stat_List;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Stats_Radial_C*                      W_Stats_AverageGrade;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Stats_Missions_Totals_C*             W_Stats_Missions_Totals;                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BackPage(bool* Handled);
	void ChangePage(class FName PageName);
	void ExecuteUbergraph_W_Stats_Missions(int32 EntryPoint);
	void Hide(double Delay, bool Collapse);
	void Reveal(double Delay);
	void SetInputMode(bool IsGamepad);

	void GetFocusTarget(class UWidget** Focus) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Stats_Missions_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Stats_Missions_C")
	}
	static class UW_Stats_Missions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Stats_Missions_C>();
	}
};
DUMPER7_ASSERTS_UW_Stats_Missions_C;

}

