#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SubMenu

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SubMenu.W_SubMenu_C
// 0x0038 (0x0450 - 0x0418)
class UW_SubMenu_C : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             Contents;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget*                                DesiredFocus;                                      // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               PreviousMenu;                                      // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              HandleBackPress;                                   // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          OnlyActiveForMKB;                                  // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	bool BP_OnHandleBackAction();
	void Construct();
	void DisableInputConsume();
	void EnableInputConsume();
	void ExecuteUbergraph_W_SubMenu(int32 EntryPoint);
	void InputModeChanged(bool UsingGamepad);
	void OnInputMethodChanged_Event_0(ECommonInputType bNewInputType);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_SubMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_SubMenu_C")
	}
	static class UW_SubMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SubMenu_C>();
	}
};
DUMPER7_ASSERTS_UW_SubMenu_C;

}

