#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SubtitleBlock

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_SubtitleBlock.W_SubtitleBlock_C.ExecuteUbergraph_W_SubtitleBlock
// 0x0030 (0x0030 - 0x0000)
struct W_SubtitleBlock_C_ExecuteUbergraph_W_SubtitleBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_Color;                                // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0018(0x0018)(ConstParm)
};
DUMPER7_ASSERTS_W_SubtitleBlock_C_ExecuteUbergraph_W_SubtitleBlock;

// Function W_SubtitleBlock.W_SubtitleBlock_C.SetBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct W_SubtitleBlock_C_SetBackgroundColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_SubtitleBlock_C_SetBackgroundColor;

// Function W_SubtitleBlock.W_SubtitleBlock_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct W_SubtitleBlock_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_W_SubtitleBlock_C_SetText;

}

