#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TabCarousel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TabCarousel.W_TabCarousel_C
// 0x00C8 (0x0538 - 0x0470)
class UW_TabCarousel_C final : public UCommonTabListWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Button_C*                            btn_Left;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            btn_Right;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Nav;                                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    LeftActionWidget;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    RightActionWidget;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Size;                                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Size_Left;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Size_Right;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, class UCommonButtonBase*>   NavMap;                                            // 0x04B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector2D                              InputActionIconSize;                               // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TabStyle;                                          // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EListItemAlignment                            TabOrientation;                                    // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           TabHistory;                                        // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BackPage(bool* Handled);
	void BndEvt__W_TabCarousel_LeftActionWidget_K2Node_ComponentBoundEvent_1_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void ChangePage(class FName PageName);
	void ClearHistory();
	void Construct();
	void ExecuteUbergraph_W_TabCarousel(int32 EntryPoint);
	void HandleTabCreation(class FName TabNameID, class UCommonButtonBase* TabButton);
	void HandleTabRemoval(class FName TabNameID, class UCommonButtonBase* TabButton);
	void Hide(double Delay, bool Collapse);
	void LogTabHistory(class FName TabId);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RegisterStyledTab(const class FText& ButtonText, class FName TabNameID, class UWidget* ContentWidget);
	void RemoveTabFromHistory(class FName TabNameID);
	void Reveal(double Delay);
	void SetDefaultTab(class FName TabNameID);
	void SetInputActionIconSize(const struct FVector2D& IconSize);
	void SetInputActionIconVisibility(bool bHideIcons);
	void SetInputMode(bool IsGamepad);
	void SetTabName(class FName TabNameID, const class FText& ButtonText);
	void SetTabOrientation(class UHorizontalBoxSlot* HorizontalBoxSlotItem);
	void SetTabStyle(class FName TabNameID, class UClass* ButtonStyle);

	void GetFocusTarget(class UWidget** Focus) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_TabCarousel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_TabCarousel_C")
	}
	static class UW_TabCarousel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TabCarousel_C>();
	}
};
DUMPER7_ASSERTS_UW_TabCarousel_C;

}

