#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Tablet_Roster

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Tablet_Roster.W_Tablet_Roster_C
// 0x0028 (0x0440 - 0x0418)
class UW_Tablet_Roster_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActivatableWidgetStack*          RosterContainer;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsManager;                                        // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PreMission_Tablet_RosterManager_C*   Manager;                                           // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Roster_Status_C*                     Status;                                            // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AudioPlayerVisible(class UW_AudioPlayer_C* PlayerWidget, bool PlayerVisible);
	void BackPage(bool* Handled);
	void BP_OnActivated();
	void ChangePage(class FName PageName);
	void Construct();
	void ExecuteUbergraph_W_Tablet_Roster(int32 EntryPoint);
	void Hide(double Delay, bool Collapse);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void PreConstruct(bool IsDesignTime);
	void Reveal(double Delay);
	void SetInputMode(bool IsGamepad);
	void SetTabletState(bool IsAwake);
	void SetVisualTheme(bool UseDarkTheme);
	void UpdateCard();
	void UpdateHealth();

	void GetFocusTarget(class UWidget** Focus) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Tablet_Roster_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Tablet_Roster_C")
	}
	static class UW_Tablet_Roster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Tablet_Roster_C>();
	}
};
DUMPER7_ASSERTS_UW_Tablet_Roster_C;

}

