#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TutorialOverviewText

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ReadyOrNot_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TutorialOverviewText.W_TutorialOverviewText_C
// 0x00B0 (0x0378 - 0x02C8)
class UW_TutorialOverviewText_C final : public UTutorialTextPrompt_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_104;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_286;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             MessageContentBox;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextContent;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTitle;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title_Text;                                        // 0x02F8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class FText>                           Content_Text;                                      // 0x0310(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateFontInfo                         MessageFontInfo;                                   // 0x0320(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_104_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_TutorialOverviewText(int32 EntryPoint);
	void ShowOverview(const class FText& Title_Text_0, TArray<class FText>& TitleContent);
	void UpdateMessageContent(const TArray<class FText>& MessageContent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_TutorialOverviewText_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_TutorialOverviewText_C")
	}
	static class UW_TutorialOverviewText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TutorialOverviewText_C>();
	}
};
DUMPER7_ASSERTS_UW_TutorialOverviewText_C;

}

