#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TutorialMessageEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TutorialMessageEntry.W_TutorialMessageEntry_C
// 0x0088 (0x0350 - 0x02C8)
class UW_TutorialMessageEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_53;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MessageContent;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MessageContentText;                                // 0x02E0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateFontInfo                         FontInfo;                                          // 0x02F8(0x0058)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_TutorialMessageEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_TutorialMessageEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_TutorialMessageEntry_C")
	}
	static class UW_TutorialMessageEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TutorialMessageEntry_C>();
	}
};
DUMPER7_ASSERTS_UW_TutorialMessageEntry_C;

}

