#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponWheel_MagazineDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WeaponWheel_MagazineDisplay.W_WeaponWheel_MagazineDisplay_C
// 0x00B0 (0x0378 - 0x02C8)
class UW_WeaponWheel_MagazineDisplay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Container_MagSlot;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UImage*>                         Mags;                                              // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABaseMagazineWeapon*                    MagazineWeapon;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalMags;                                         // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxAmmo;                                           // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EmptyMags;                                         // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IconSize;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_WeaponWheel_MagazineSlot_C*>  MagSlots;                                          // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bOnlyShowOneSlot;                                  // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxMagsPerSlot;                                    // 0x0324(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<int32, int32>                            SlotIndexToMags;                                   // 0x0328(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CreateMag(class UW_WeaponWheel_MagazineSlot_C*& MagSlot);
	void CreateMagOutline(class UW_WeaponWheel_MagazineSlot_C*& MagSlot);
	void CreateMags();
	class UW_WeaponWheel_MagazineSlot_C* CreateMagSlot();
	void ExecuteUbergraph_W_WeaponWheel_MagazineDisplay(int32 EntryPoint);
	int32 GetMaxSlots();
	void Initialize(class ABaseMagazineWeapon* InMagazineWeapon, double IconSize_0);
	void PopulateSlotIndexToMagsMap();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateMagIcon(int32 MagIndex, double CurrentAmmo);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_WeaponWheel_MagazineDisplay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_WeaponWheel_MagazineDisplay_C")
	}
	static class UW_WeaponWheel_MagazineDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_WeaponWheel_MagazineDisplay_C>();
	}
};
DUMPER7_ASSERTS_UW_WeaponWheel_MagazineDisplay_C;

}

