#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponWheel_MultiItem_Selection

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WeaponWheel_MultiItem_Selection.W_WeaponWheel_MultiItem_Selection_C
// 0x0078 (0x0340 - 0x02C8)
class UW_WeaponWheel_MultiItem_Selection_C final : public UUserWidget
{
public:
	class UHorizontalBox*                         Dots_Container;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MultiItemVisual;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NextItemIcon;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PreviousItemIcon;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UImage*>                         Dots;                                              // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FLinearColor                           UnselectedColor;                                   // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SelectedColor;                                     // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ItemIndex;                                         // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HighlightedIconColor;                              // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnhighlightedIconColor;                            // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CreateIndex();
	void Deselect(int32 Index_0);
	void DetermineIconColor(class UImage* Next_Icon, int32 IndexToCheck);
	void HighlightIcon(class UImage* Arrow);
	void NextItem(bool* bSuccess);
	void PreviousItem(bool* bSuccess);
	void Refresh(int32 NewAmount, int32 StartingItemIndex);
	void Select(int32 Index_0);
	void UnhighlightIcon(class UImage* Arrow);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_WeaponWheel_MultiItem_Selection_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_WeaponWheel_MultiItem_Selection_C")
	}
	static class UW_WeaponWheel_MultiItem_Selection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_WeaponWheel_MultiItem_Selection_C>();
	}
};
DUMPER7_ASSERTS_UW_WeaponWheel_MultiItem_Selection_C;

}

