#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WheelIcon_Pip

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_WheelIcon_Pip.W_WheelIcon_Pip_C.ExecuteUbergraph_W_WheelIcon_Pip
// 0x0008 (0x0008 - 0x0000)
struct W_WheelIcon_Pip_C_ExecuteUbergraph_W_WheelIcon_Pip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Unselected;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Selected;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_WheelIcon_Pip_C_ExecuteUbergraph_W_WheelIcon_Pip;

// Function W_WheelIcon_Pip.W_WheelIcon_Pip_C.OnHighlight
// 0x0001 (0x0001 - 0x0000)
struct W_WheelIcon_Pip_C_OnHighlight final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_WheelIcon_Pip_C_OnHighlight;

// Function W_WheelIcon_Pip.W_WheelIcon_Pip_C.OnUnhighlight
// 0x0001 (0x0001 - 0x0000)
struct W_WheelIcon_Pip_C_OnUnhighlight final
{
public:
	bool                                          Unselected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_WheelIcon_Pip_C_OnUnhighlight;

}

