#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_XboxCrossplayWarning

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_XboxCrossplayWarning.W_XboxCrossplayWarning_C.ExecuteUbergraph_W_XboxCrossplayWarning
// 0x0018 (0x0018 - 0x0000)
struct W_XboxCrossplayWarning_C_ExecuteUbergraph_W_XboxCrossplayWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseCountdown;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_XboxCrossplayWarning_C_ExecuteUbergraph_W_XboxCrossplayWarning;

// Function W_XboxCrossplayWarning.W_XboxCrossplayWarning_C.SetUseCountdown
// 0x0001 (0x0001 - 0x0000)
struct W_XboxCrossplayWarning_C_SetUseCountdown final
{
public:
	bool                                          bInUseCountdown;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_XboxCrossplayWarning_C_SetUseCountdown;

}

